{"sequenceId":"845363884551","id":"34207167029","language":"English","title":"Page 1802","content":"((Triple Saturday -- Page 3 of 3)) “What?” said Roman. “I’m not saying you should try to keep them under your thumb like some kind dictator. That’d be a good way to make them hate you. For anything like this to work, they would have to consider it a beneficial relationship from their end, too.” Still, Hector merely kept looking at him. Roman sighed. “Hector. Trust me. If you just let them go, they will.” ‘That, or they’ll try to take Warrenhold from you,’ said Voreese. ‘‘Bout a fifty-fifty shot either way, I’d say.’ Hector shot her a look, now. “The Rainlords wouldn’t do something like that.” ‘Oh, right, because they’re so honorable or whatever?’ said Voreese. ‘Please. Lotta pretty words and warm feelings--that’s all that is. Make no mistake, Hector. If they ever come to see you as an obstacle, they’ll turn on you in a heartbeat. Unless you marry into one of the families, maybe. In fact, I bet they’ll try to pressure you into that soon.’ ‘Gah, why’d you have to go and warn him?’ said Garovel. ‘I wanted to see his raw reaction when they suddenly spring it on him, dammit.’ ‘Oh. Ah. My bad.’ Hector’s face was stuck as he thought about what they’d just said. Marriage? What the fuck? Who the hell was gonna--? ‘There, you see? Look at him. You’ve ruined it.’ ‘Sorry. It’s probably for the best that he’s thinking about it, though. Wouldn’t want him to make a poor decision while he’s too surprised to think clearly.’ ‘As if I’d let him do that.’ ‘Oho. Feeling protective of your prize-winning pony? Don’t want him to breed with any old donkey, eh?’ ‘Of course.’ That was enough to bring Hector back into the conversation. “You guys are disgusting.” “I think they’re kidding,” said Roman. ‘Of course we’re kidding,’ said Vorese. ‘Hector can fuck all the donkeys he wants. We don’t care.’ The conversation lasted until the end of the meal, and as was perhaps to be expected, there was considerably more shit talk than business talk. Roman and Voreese both kept trying to encourage him to do something about the Rainlords--what, exactly, remained unclear. The way they talked about it, they made it sound like they wanted him to trick the Rainlords somehow, just as before, they kept saying that it would have to be a mutually beneficial relationship. Or something. Hector didn’t really understand what they were trying to say, and he wasn’t entirely sure that he wanted to, either. After the meal, they went their separate ways again. Roman said that they would be sticking around Warrenhold for a while and that he also wanted to go with Hector to meet Leo again. Hector didn’t know if that last was such a good idea, but he couldn’t think of a very good reason to refuse the man, nor did he particularly want to talk to Leo without any sort of backup again, either. Hector was still reluctant, however, and in the end, he told Roman that he wanted to think about it a bit more. Roman didn’t look like he appreciated that answer very much, but the man didn’t argue with him.","contentWithMarkup":"<span style=\"font-size: x-small;\"><b><span style=\"color: #bb3333;\">((Triple Saturday -- Page 3 of 3))</span></b></span><br /><span style=\"font-family: \"courier new\" , \"courier\" , monospace;\">“What?” said Roman. “I’m not saying you should try to keep them under your thumb like some kind dictator. That’d be a good way to make them hate you. For anything like this to work, they would have to consider it a beneficial relationship from their end, too.” <br /><br />Still, Hector merely kept looking at him.  <br /><br />Roman sighed. “Hector. Trust me. If you just let them go, they <i>will</i>.” <br /><br />‘<i>That, or they’ll try to take Warrenhold from you</i>,’ said Voreese. ‘<i>‘Bout a fifty-fifty shot either way, I’d say.</i>’ <br /><br />Hector shot her a look, now. “The Rainlords wouldn’t do something like that.” <br /><br />‘<i>Oh, right, because they’re so honorable or whatever?</i>’ said Voreese. ‘<i>Please. Lotta pretty words and warm feelings--that’s all that is. Make no mistake, Hector. If they ever come to see you as an obstacle, they’ll turn on you in a heartbeat. Unless you marry into one of the families, maybe. In fact, I bet they’ll try to pressure you into that soon.</i>’ <br /><br />‘<i>Gah, why’d you have to go and warn him?</i>’ said Garovel. ‘<i>I wanted to see his raw reaction when they suddenly spring it on him, dammit.</i>’ <br /><br />‘<i>Oh. Ah. My bad.</i>’ <br /><br />Hector’s face was stuck as he thought about what they’d just said. Marriage? What the fuck? Who the hell was gonna--? <br /><br />‘<i>There, you see? Look at him. You’ve ruined it.</i>’ <br /><br />‘<i>Sorry. It’s probably for the best that he’s thinking about it, though. Wouldn’t want him to make a poor decision while he’s too surprised to think clearly.</i>’ <br /><br />‘<i>As if I’d let him do that.</i>’ <br /><br />‘<i>Oho. Feeling protective of your prize-winning pony? Don’t want him to breed with any old donkey, eh?</i>’ <br /><br />‘<i>Of course.</i>’ <br /><br />That was enough to bring Hector back into the conversation. “You guys are disgusting.” <br /><br />“I <i>think</i> they’re kidding,” said Roman. <br /><br />‘<i>Of course we’re kidding</i>,’ said Vorese. ‘<i>Hector can fuck all the donkeys he wants. We don’t care.</i>’ <br /><br />The conversation lasted until the end of the meal, and as was perhaps to be expected, there was considerably more shit talk than business talk. Roman and Voreese both kept trying to encourage him to do something about the Rainlords--<i>what</i>, exactly, remained unclear. The way they talked about it, they made it sound like they wanted him to trick the Rainlords somehow, just as before, they kept saying that it would have to be a mutually beneficial relationship. Or something.  <br /><br />Hector didn’t really understand what they were trying to say, and he wasn’t entirely sure that he wanted to, either.  <br /><br />After the meal, they went their separate ways again. Roman said that they would be sticking around Warrenhold for a while and that he also wanted to go with Hector to meet Leo again. Hector didn’t know if that last was such a good idea, but he couldn’t think of a very good reason to refuse the man, nor did he particularly want to talk to Leo without any sort of backup again, either. Hector was still reluctant, however, and in the end, he told Roman that he wanted to think about it a bit more. Roman didn’t look like he appreciated that answer very much, but the man didn’t argue with him.</span>","tags":["ch190"],"publishedDate":"2018-06-02T20:00:03Z","harvestDate":"2018-06-02T21:38:21Z","estimatedPublishedDate":"2018-06-02T20:00:03Z","url":"http://ct.moreover.com/?a=34207167029&p=1u0&v=1&x=Lbj1FUVpAnHI-mTPoRiCoA","originalUrl":"https://thezombieknight.blogspot.com/2018/06/page-1802.html","commentsUrl":"https://thezombieknight.blogspot.com/2018/06/page-1802.html#comment-form","outboundUrls":[],"wordCount":"529","dataFormat":"text","duplicateGroupId":"34207167029","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"Good Idea SA","symbol":"GDI","exchange":"WAR","isin":"PLGOODI00012","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"George M. Frost","publishingPlatform":{}},"licenses":[],"source":{"name":"The Zombie Knight Saga","homeUrl":"https://thezombieknight.blogspot.com/","location":{},"feed":{"id":"354874679","name":"The Zombie Knight Saga","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"A dark serial novel. Set in a modern fantasy world called Eleg. Mature language. Updates by ~500 words every night at midnight EST. Triple updates on Mon/Wed/Sat.","tags":["Chapter","ch181","ch138","ch128","ch141","ch145","ch139","ch186","ch81","ch10","ch110","ch132","ch135","ch170","ch185","ch120","ch155","ch177","ch189","ch6","ch82","ch152","ch158","ch58","ch76","ch1","ch100","ch143","ch144","ch83","ch93","ch106","ch125","ch134","ch162","ch174","ch179","ch38","ch40","ch59","ch77","ch101","ch122","ch124","ch12"],"language":"English","dataFormat":"text","rank":{"autoRank":"7","autoRankOrder":"121620","inboundLinkCount":"1"},"inWhiteList":"true","autoTopics":[]}},"es_id":86992225}