{"sequenceId":"845363517921","id":"34207154232","language":"English","title":"Why you should consider wearing socks to sleep","content":"© Anna Kolosiuk/Shutterstock To wear or not to wear—that is, your socks to bed. The controversy over whether or not we’re supposed to wear socks to bed has been debated for years. Fortunately, we have an answer. Sure, those Christmas socks aren’t the most stylish, but keeping your feet warm at night has been proven to actually makes a difference in your sleeping patterns. According to sleep.org, “Heating cold feet causes vasodilation—dilation of the blood vessels—which may tell the brain that it is bedtime. After the blood vessels open in the hands and feet, heat is redistributed throughout the body to prepare for sleep.” (Don’t miss some other weird tricks to help you go to sleep.) In other words, keeping your feet warm in bed helps you have less restless nights. It also results in falling asleep at a quicker rate. In case you’re not convinced, here’s a study that was published in the International Weekly Journal of Science that says hitting the hay with socks on actually helps you fall asleep fifteen minutes sooner than usual. Wearing socks to bed is also useful in aiding hot flashes, improving dry feet, and increasing orgasms. Traditional Chinese medicine also backs up this wear-socks-to-bed concept, specifically focusing on its ability to enhance circulation. “Cold feet can drain the energy of the body and can obstruct the flow of vital qi (energy) and blood (nutrition) in the body. For that reason we want to circulate the ‘qi and blood.’ By doing so we keep painful obstruction away from the body and keep the energy flowing smoothly,” Dr. Elizabeth Trattner A.P. DOM, Doctor of Chinese and Integrative Medicine, told Reader’s Digest. “Cold impedes the flow of energy and heat or warmth encourages it. If you think about a warm bath you relax, and in cold water you tense up. Cold creates stagnation which can also lead to pain (think Reynaud’s Syndrome).” Wearing socks to bed isn’t the only secret to a sweet slumber.  Disclaimer: Views expressed in this article are the author's own and MSN does not endorse them in any way. Neither can MSN independently verify any claims made in the article. You should consult your physician before starting any weight loss or health management programme to determine if it is right for your needs.","contentWithMarkup":"<img align=\"left\" src=\"http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AArX8A9.img?h=100&w=100&m=6&q=60&o=f&l=f&x=541&y=382\" />","tags":[],"harvestDate":"2018-06-02T21:35:04Z","estimatedPublishedDate":"2018-06-02T21:35:04Z","url":"http://ct.moreover.com/?a=34207154232&p=1u0&v=1&x=VpF5LICNWSt4M4FBPIoHEQ","originalUrl":"https://www.msn.com/en-in/lifestyle/lifestylegeneral/if-you-don%E2%80%99t-sleep-with-socks-on-here%E2%80%99s-why-you-should-start-tonight/ar-AAy88eB?srcref=rss","outboundUrls":["https://www.rd.com/health/wellness/sleep-tricks/","http://www.nature.com/nature/journal/v401/n6748/full/401036a0.html?foxtrotcallback=true","http://www.elizabethtrattner.com/"],"wordCount":"381","dataFormat":"text","duplicateGroupId":"34202539312","media":{"audio":[],"images":[{"url":"http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AArX8A9.img?h=100&w=100&m=6&q=60&o=f&l=f&x=541&y=382"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"publishingPlatform":{}},"licenses":[],"source":{"name":"Style, Beauty & Fashion News, Horoscope, Relationship News | MSN India","homeUrl":"http://www.msn.com/en-in/lifestyle/","location":{"country":"India","countryCode":"IN","region":"Asia","subregion":"Southern Asia"},"feed":{"id":"182236815","name":"Style, Beauty & Fashion News, Horoscope, Relationship News | MSN India","mediaType":"Blog","description":"Get the latest beauty and fashion trends, horoscopes, relationship advice, smart living tips and more.","tags":[],"copyright":"MSN India","language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":["ugc food feeds","ugc sport feeds","ugc recreation feeds","ugc arts feeds","ugc health feeds"],"editorialTopics":["Lifestyle","Consumer"]}},"es_id":86991765}