{"sequenceId":"845366056864","id":"34207230499","language":"English","title":"Pendulum Palace","content":"~AJA~ “I wish…” I’ve learned it’s best not to… “I wish she wouldn’t…” “I wish he would…” “I wish they didn’t…” “I wish I could…” “I wish I was…” ‘Wishing’ is a dangerous way to pass the time.  It lures us to a place where we’re engulfed in the quicksand of fairy dust and wizardry…. Sunshine and rainbows… bubble gum and lollipops. We eventually return to reality… void of all fairies – to the world of what “isn’t.” Indignation sets in – bold statements of what we wish – and what we believe must then “be.” ‘Wishing’ settles us into a destructive pattern.  It allows us to wallow in what isn’t – what can’t be – what will never be… I wish she wouldn’t – but she will. I wish he would – but he won’t. I wish they didn’t – but they do. I wish I could – but I can’t. I wish I was – but I’m not. We just spent a week in the Happiest Place on Earth. And yet – wherever we turned, we heard crying children, scolding parents, snappy spouses… “I wish it wasn’t raining.” “I wish it wasn’t so humid.” “I wish the line wasn’t so long.” It didn’t sound happy. It sounded downright miserable. It sounded like a desperate resolve – after all the money and energy and time spent – to be happy, damn it. It was an attempt to keep heads above the waves of long-time-coming “wishes” that were slowly drowning them. I didn’t know their specific wishes.  But I knew.  It was a common theme in the theme-park.   I didn’t know much – but I knew they were wishing. There are so many adventures to be had – characters to meet – rides to experience – foods to sample – countries to visit – senses to overload – money to spend – determination to muster – frustration to overcome… Don’t misunderstand.   I wouldn’t have changed a minute of it (ok, maybe a few)… Our kids loved (most of) it… they heard “yes” far more than “no” (90/10), we had FastPasses, recommendations and tips from friends to make our vacation the best it could be – and it was.  Possibly once in a lifetime.  More than likely, only once in their childhood. All of the good far overshadowed the moments of not-so-good. Yes, the pendulum swung low – down with the heavy rain and tired feet and hazy days. And then the pendulum swung again – high with joy of new experiences, full body laughter, sparkling amazement and never-before-encountered friends. I’ve learned it’s best not to wish.  It’s best to focus. Focus on the upswing of the pendulum – focus on the direction – focus on the future ups that no doubt will come after the downs (that no doubt, come). I wish she wouldn’t – but she will. (I will accept what she “will” – and focus on managing that will) I wish he would – but he won’t. (I will accept what he “won’t” – and will encourage him to try) I wish they didn’t – but they do. (I will accept that they “do” – and will encourage them to consider) I wish I could – but I can’t. (I will accept that “I can’t” now – and focus on “will someday”) I wish I was – but I am not. (I will accept what “I am not” – and will focus on who “I am”) We planned ahead; we packed ponchos and patience (and snacks), we stayed hydrated. We considered time and distance and recognized maxed out moments, and took rest days… But I didn’t wish upon a star – I didn’t wish at all. We focused on what was joyful – miraculous – heartwarming – dare I say, magical… sparkling eyes and moments of compassion and fits of laughter and cannonball splashes and movie popcorn and hardly-whispered bedtime stories and fears faced and invitations to sit next to and requests to go with and airplane views and humid hugs and sweaty high fives and up-to-something grins… I didn’t wish for any of it.  But it’s what I got. I didn’t wish for what “isn’t” – I focused, instead, on what “is.” And it was magical. The “happiest place on earth” – it’s a bit of false advertising. Apparently, the happiest place on earth – this year – is Finland… (and you can’t get there from Epcot). “The most magical place on earth”?  Possibly. Not because we wished it to be. Because we focused on the magic that came when we took a tour through Pendulum Palace. Advertisements","contentWithMarkup":"~AJA~ “I wish…” I’ve learned it’s best not to… “I wish she wouldn’t…” “I wish he would…” “I wish they didn’t…” “I wish I could…” “I wish I was…” ‘Wishing’ is a dangerous way to pass the time.  It lures us to a place where we’re engulfed in the quicksand of fairy dust and wizardry…. … <a href=\"https://ultimatehappyhour.wordpress.com/2018/06/02/pendulum-palace/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> \"Pendulum Palace\"</span></a>","tags":["Observations"],"publishedDate":"2018-06-02T21:53:18Z","harvestDate":"2018-06-02T21:53:23Z","estimatedPublishedDate":"2018-06-02T21:53:18Z","url":"http://ct.moreover.com/?a=34207230499&p=1u0&v=1&x=UxVsYscVeeQ95nogei-DMw","originalUrl":"https://ultimatehappyhour.wordpress.com/2018/06/02/pendulum-palace/","outboundUrls":[],"wordCount":"725","dataFormat":"text","duplicateGroupId":"34207230499","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"1708"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Shaken Not Stirred","publishingPlatform":{"userId":"55639899"}},"licenses":[],"source":{"name":"Mixed Messages: Shaken, Not Stirred","homeUrl":"https://ultimatehappyhour.wordpress.com","location":{},"feed":{"id":"389312911","name":"Mixed Messages: Shaken, Not Stirred","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"58205793","generator":"http://wordpress.com/","description":"Two women looking for the ultimate happy hour","tags":[],"language":"Unassigned","dataFormat":"text","rank":{"autoRank":"9","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994033}