{"sequenceId":"845366575189","id":"34207245287","language":"English","title":"The Fox and the Goat\nA fox one day fell into a deep well and could find no means of escape. ...","content":"  13  /  26   The Fox and the Goat A fox one day fell into a deep well and could find no means of escape. A Goat, overcome with thirst, came to the same well, and seeing the Fox, inquired if the water was good. Concealing his sad plight under a merry guise, the Fox indulged in a lavish praise of the water, saying it was excellent beyond measure, and encouraging him to descend. The Goat, mindful only of his thirst, thoughtlessly jumped down, but just as he drank, the Fox informed him of the difficulty they were both in and suggested a scheme for their common escape. If, said he, you will place your forefeet upon the wall and bend your head, I will run up your back and escape, and will help you out afterwards. The Goat readily assented and the Fox leaped upon his back. Steadying himself with the Goat's horns, he safely reached the mouth of the well and made off as fast as he could. When the Goat upbraided him for breaking his promise, he turned around and cried out, You foolish old fellow! If you had as many brains in your head as you have hairs in your beard, you would never have gone down before you had inspected the way up, nor have exposed yourself to dangers from which you had no means of escape. Look before you leap.\tby Aesop Found in Aesop fables Quotes, Share to:","contentWithMarkup":"The Fox and the Goat\nA fox one day fell into a deep well and could find no means of escape. A Goat, overcome with thirst, came to the same well, and seeing the Fox, inquired if the water was good. Concealing his sad plight under a merry guise, the Fox indulged in a lavish praise of the water, saying it was excellent beyond measure, and encouraging him to descend. The Goat, mindful only of his thirst, thoughtlessly jumped down, but just as he drank, the Fox informed him of the difficulty they were both in and suggested a scheme for their common escape. If, said he, you will place your forefeet upon the wall and bend your head, I will run up your back and escape, and will help you out afterwards. The Goat readily assented and the Fox leaped upon his back. Steadying himself with the Goat's horns, he safely reached the mouth of the well and made off as fast as he could. When the Goat upbraided him for breaking his promise, he turned around and cried out, You foolish old fellow! If you had as many brains in your head as you have hairs in your beard, you would never have gone down before you had inspected the way up, nor have exposed yourself to dangers from which you had no means of escape. \nLook before you leap.","tags":[],"harvestDate":"2018-06-02T21:57:17Z","estimatedPublishedDate":"2018-06-02T21:57:17Z","url":"http://ct.moreover.com/?a=34207245287&p=1u0&v=1&x=eQ5yputtHMy3xbt7EPEwwg","originalUrl":"http://www.maxioms.com/maxiom/1536","outboundUrls":[],"wordCount":"241","dataFormat":"text","duplicateGroupId":"34207245287","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"publishingPlatform":{}},"licenses":[],"source":{"name":"Maxioms.com","homeUrl":"http://www.maxioms.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"172099137","name":"Maxioms.com","mediaType":"Blog","description":"Quotes, Famous Quotes, Sayings, Proverbs, Maxims, Axioms, Maxioms","tags":[],"copyright":"Copyright 2018 Maxioms.com. All Rights Reserved.","language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994489}