{"sequenceId":"845362393123","id":"34207118281","language":"English","title":"The Wire Troll: Jordan Lyles Locks Down Rotation Spot","content":"Jordan Lyles is a factor now that he’s starting again. (Gregory Bull, AP)   Welcome back to another week of Fantasy baseball. We’re now into June, just two days from the start of the 2018 MLB Draft. Soon, we’ll have a whole new batch of prospects to drool over.    This week, the Dodgers got Clayton Kershaw off the DL, but his back acted up again, and now he’s out another month; Mookie Betts , who has been the top Fantasy player over the first two months of the season, has landed on the DL with an abdominal strain; and Russell Wilson has joined a group that is trying to bring an MLB team to Portland, Oregon.    And now, here are this week’s Fantasy baseball waiver wire recommendations, as we focus on pitching in this installment…    Jordan Lyles , RP, San Diego Padres (ESPN: 10.4 per cent; CBS: 27 per cent): About three weeks ago, Lyles was inserted into the Padre rotation, and the results have been mixed. He was solid in his first start and spectacular in his second before a couple of rough outings. But Lyles rebounded from that on Thursday with a very strong seven innings of work against the Fish to earn another win. When the Padres signed him last year and brought him up late in the season to start, things didn’t go well at all. Undeterred, they’ve given Lyles another chance to start this year and it’s now paying off. His hit rates are much better and he’s never produced an ERA even close to this low. Note that Lyles’s FIP (4.09) suggests there will be some regression, but not dramatically so. Still, after he began the season in the bullpen, the veteran has really brought some stability to the Padre rotation and San Diego has won each of his last four starts. After flaming out in Houston, Lyles was being counted on to be a key cog in the Rockies’ rotation, but injuries and ineffectiveness derailed that, and he was shifted to the pen. It’s great to see him get another crack at starting now, and he seems to be running with it. Working as a reliever has taught him to speed things up a bit now that he’s starting again (see video below).       Jalen Beeks , SP, Boston Red Sox (ESPN: 0.6 per cent; CBS: 6 per cent): Boston’s 12th round pick in 2014 sure looked shaky when he began his pro career, and his inability to consistently throw his three pitch arsenal for strikes suggested he was ultimately bullpen bound. But each season, Beeks has gotten a little bit better (4.32 ERA in 2015; 3.87 in 2016; and 3.29 last year), and this season, he’s looking like an ace at Triple-A, and was among the hottest pitchers in the entire BoSox system in May. The difference in the last year and half has been a better changeup and new cutter — tweaks that have Beeks on the precipice of a promotion to Boston as the next in line starting pitcher. His 43 Ks in May paced the entire organization, and through 10 starts this season, he’s only given up 20 runs (2.56 ERA) while whiffing an astonishing 80 batters in 56 1/3 IP. Beeks has arrived as a legitimate prospect, and someone to watch as Drew Pomeranz struggles.    Steven Wright , SP, Boston Red Sox (ESPN: 0.5 per cent; CBS: 2 per cent): Speaking of Pomeranz being on thin ice, perhaps the most likely replacement is Wright. Since being a candidate for a spot on the prestigious Wire Troll All-Star Team in 2016 , Wright hasn’t been heard from much. After all, injuries limited him to five ugly starts last year (8.25 ERA). He’s finally healthy again, and since coming off the DL just over two weeks ago, he’s been pitching in long relief. Other than some control issues (to be expected as he shakes off the rust), he’s been stellar, with a career-best 2.25 ERA. Don’t be shocked if Wright replaces Pomeranz in the Boston rotation very shortly.    Quick Hits    With Toronto’s season spinning out of control, it’s just a matter of time before catcher of the future Danny Jansen arrives in the bigs. With his play at Triple-A this season, he’s clearly established himself as a top 100 prospect and a superb dynasty league option.  Kyle Schwarber continues to flash great power, on Friday managing four RBI despite not entering the game until the sixth inning (sac fly, three-run homer). He’s on pace to see more action than ever before in what’s shaping up as a career year.  It’s time to take another look at San Francisco hurler Chris Stratton . He started the season well, but saw his ERA rise in each of the last seven starts before tossing six goose egg frames on Friday. Stratton has won each of his last four starts, giving him seven victories (second in the NL).  Chris Sale had been absolutely cruising along this season, but has been roughed up for 11 hits, 10 earned runs, two homers and four walks over his last two starts (10 1/3 IP), losing both. Still, his command continues to look sharp, so this probably isn’t worth getting your panties in a knot over. Maybe his owner is concerned; a low-ball offer wouldn’t hurt.  The reeling Mets have now fallen below .500, wasting a solid outing by Zack Wheeler on Friday thanks to their awful bullpen. He seems to be alternating quality outings with rancid ones. Despite inducing a higher percentage of ground balls this year, Wheeler isn’t showing much progress. Start to start consistency would be a good place to begin.    RotoRob Tune of the Day    Welcome to our newest feature, in which we select a song of the day. To kick things off, here’s a live performance of “All the Diamonds in the World,” by Canadian folk legend Bruce Cockburn .        Now it’s your turn. Let us know in the comments below who your favourite Fantasy baseball waiver wire pick of the week is.","contentWithMarkup":"<div class=\"centerimage\"><a href=\"http://www.rotorob.com/wp-content/uploads/2018/06/Jordan_Lyles.jpg\"><img src=\"http://www.rotorob.com/wp-content/uploads/2018/06/Jordan_Lyles.jpg\" alt=\"Jordan Lyles has moved into the rotation for the San Diego Padres.\" class=\"aligncenter\"/></a><br />\nJordan Lyles is a factor now that he’s starting again. (Gregory Bull, AP)</div>\n<p>Welcome back to another week of Fantasy baseball. We’re now into June, just two days from the start of the 2018 MLB Draft. Soon, we’ll have a whole new batch of prospects to drool over.</p>\n<p>This week, the Dodgers got <strong>Clayton Kershaw</strong> off the DL, but his back acted up again, and now he’s out another month; <strong>Mookie Betts</strong>, who has been the top Fantasy player over the first two months of the season, has landed on the DL with an abdominal strain; and <strong>Russell Wilson</strong> has joined a group that is trying to bring an MLB team to Portland, Oregon.</p>\n<p>And now, here are this week’s Fantasy baseball waiver wire recommendations, as we focus on pitching in this installment… </p>\n<p><strong>Jordan Lyles</strong>, RP, San Diego Padres (ESPN: 10.4 per cent; CBS: 27 per cent): About three weeks ago, Lyles was inserted into the Padre rotation, and the results have been mixed. He was solid in his first start and spectacular in his second before a couple of rough outings. But Lyles rebounded from that on Thursday with a very strong seven innings of work against the Fish to earn another win. When the Padres signed him last year and brought him up late in the season to start, things didn’t go well at all. Undeterred, they’ve given Lyles another chance to start this year and it’s now paying off. His hit rates are much better and he’s never produced an ERA even close to this low. Note that Lyles’s FIP (4.09) suggests there will be some regression, but not dramatically so. Still, after he began the season in the bullpen, the veteran has really brought some stability to the Padre rotation and San Diego has won each of his last four starts. After flaming out in Houston, Lyles was being counted on to be a key cog in the Rockies’ rotation, but injuries and ineffectiveness derailed that, and he was shifted to the pen. It’s great to see him get another crack at starting now, and he seems to be running with it. Working as a reliever has taught him to speed things up a bit now that he’s starting again (see video below).</p>\n<p><iframe width=\"450\" height=\"253\" src=\"https://www.youtube.com/embed/RvkljLCQ1_A\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe></p>\n<p><strong>Jalen Beeks</strong>, SP, Boston Red Sox (ESPN: 0.6 per cent; CBS: 6 per cent): Boston’s 12th round pick in 2014 sure looked shaky when he began his pro career, and his inability to consistently throw his three pitch arsenal for strikes suggested he was ultimately bullpen bound. But each season, Beeks has gotten a little bit better (4.32 ERA in 2015; 3.87 in 2016; and 3.29 last year), and this season, he’s looking like an ace at Triple-A, and was among the hottest pitchers in the entire BoSox system in May. The difference in the last year and half has been a better changeup and new cutter — tweaks that have Beeks on the precipice of a promotion to Boston as the next in line starting pitcher. His 43 Ks in May paced the entire organization, and through 10 starts this season, he’s only given up 20 runs (2.56 ERA) while whiffing an astonishing 80 batters in 56 1/3 IP. Beeks has arrived as a legitimate prospect, and someone to watch as <strong>Drew Pomeranz</strong> struggles.</p>\n<p><strong>Steven Wright</strong>, SP, Boston Red Sox (ESPN: 0.5 per cent; CBS: 2 per cent): Speaking of Pomeranz being on thin ice, perhaps the most likely replacement is Wright. Since being a candidate for a spot on the prestigious <a href=\"http://www.rotorob.com/2016/10/10/2016-wire-troll-all-star-team\">Wire Troll All-Star Team in 2016</a>, Wright hasn’t been heard from much. After all, injuries limited him to five ugly starts last year (8.25 ERA). He’s finally healthy again, and since coming off the DL just over two weeks ago, he’s been pitching in long relief. Other than some control issues (to be expected as he shakes off the rust), he’s been stellar, with a career-best 2.25 ERA. Don’t be shocked if Wright replaces Pomeranz in the Boston rotation very shortly.</p>\n<p><strong>Quick Hits</strong></p>\n<ul style=\"margin-left:20px\">\n<li>With Toronto’s season spinning out of control, it’s just a matter of time before catcher of the future <strong>Danny Jansen</strong> arrives in the bigs. With his play at Triple-A this season, he’s clearly established himself as a top 100 prospect and a superb dynasty league option.</li>\n<li><strong>Kyle Schwarber</strong> continues to flash great power, on Friday managing four RBI despite not entering the game until the sixth inning (sac fly, three-run homer). He’s on pace to see more action than ever before in what’s shaping up as a career year.</li>\n<li>It’s time to take another look at San Francisco hurler <strong>Chris Stratton</strong>. He started the season well, but saw his ERA rise in each of the last seven starts before tossing six goose egg frames on Friday. Stratton has won each of his last four starts, giving him seven victories (second in the NL).</li>\n<li><strong>Chris Sale</strong> had been absolutely cruising along this season, but has been roughed up for 11 hits, 10 earned runs, two homers and four walks over his last two starts (10 1/3 IP), losing both. Still, his command continues to look sharp, so this probably isn’t worth getting your panties in a knot over. Maybe his owner is concerned; a low-ball offer wouldn’t hurt.</li>\n<li>The reeling Mets have now fallen below .500, wasting a solid outing by <strong>Zack Wheeler</strong> on Friday thanks to their awful bullpen. He seems to be alternating quality outings with rancid ones. Despite inducing a higher percentage of ground balls this year, Wheeler isn’t showing much progress. Start to start consistency would be a good place to begin.</li>\n</ul>\n<p><strong>RotoRob Tune of the Day</strong></p>\n<p>Welcome to our newest feature, in which we select a song of the day. To kick things off, here’s a live performance of “All the Diamonds in the World,” by Canadian folk legend <strong>Bruce Cockburn</strong>. </p>\n<p><iframe width=\"450\" height=\"253\" src=\"https://www.youtube.com/embed/dMTX_00SEHQ\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe> </p>\n<p>Now it’s your turn. Let us know in the comments below who your favourite Fantasy baseball waiver wire pick of the week is.</p>\n<p><a class=\"a2a_dd a2a_target addtoany_share_save\" href=\"https://www.addtoany.com/share#url=http%3A%2F%2Fwww.rotorob.com%2F2018%2F06%2F02%2Fthe-wire-troll-jordan-lyles-locks-down-rotation-spot%2F&title=The%20Wire%20Troll%3A%20Jordan%20Lyles%20Locks%20Down%20Rotation%20Spot\" id=\"wpa2a_2\"><img src=\"http://www.rotorob.com/wp-content/plugins/add-to-any/share_save_171_16.png\" width=\"171\" height=\"16\" alt=\"Share\"/></a></p>","tags":["BASEBALL","RotoRob","The Wire Troll"],"publishedDate":"2018-06-02T20:04:21Z","harvestDate":"2018-06-02T21:26:11Z","estimatedPublishedDate":"2018-06-02T20:04:21Z","url":"http://ct.moreover.com/?a=34207118281&p=1u0&v=1&x=z4A1uuP81BsSALrK-CKaBg","originalUrl":"http://www.rotorob.com/2018/06/02/the-wire-troll-jordan-lyles-locks-down-rotation-spot/","commentsUrl":"http://www.rotorob.com/2018/06/02/the-wire-troll-jordan-lyles-locks-down-rotation-spot/#comments","outboundUrls":["https://www.addtoany.com/share#url=http%3A%2F%2Fwww.rotorob.com%2F2018%2F06%2F02%2Fthe-wire-troll-jordan-lyles-locks-down-rotation-spot%2F&title=The%20Wire%20Troll%3A%20Jordan%20Lyles%20Locks%20Down%20Rotation%20Spot"],"wordCount":"970","dataFormat":"text","duplicateGroupId":"34207118281","media":{"audio":[],"images":[{"url":"http://www.rotorob.com/wp-content/uploads/2018/06/Jordan_Lyles.jpg"},{"url":"http://www.rotorob.com/wp-content/plugins/add-to-any/share_save_171_16.png"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"RotoRob","publishingPlatform":{}},"licenses":[],"source":{"name":"RotoRob","homeUrl":"http://www.rotorob.com","location":{},"feed":{"id":"681161","name":"RotoRob","mediaType":"Blog","publishingPlatform":"WordPress","generator":"http://wordpress.org/?v=2.8.4","description":"Fantasy Sports Analysis With an Edge","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"7","autoRankOrder":"121620","inboundLinkCount":"1"},"inWhiteList":"true","autoTopics":["ugc sport feeds","ugc health feeds"]}},"es_id":86990591}