{"sequenceId":"845362382640","id":"34207117720","language":"English","title":"Scottsdale Victims in Murders: Paralegals, Doctors Killed","content":"Four murders in Scottsdale, Arizona may be connected, sparking fears in the community as people connected to the legal and medical communities have been gunned down in the span of three days.  The murders began on Thursday, May 31, 2018, when a high-profile psychiatrist was slain outside his Scottsdale office. They escalated with three more deaths the next two days.  The spree of murders is believed to be connected to the same gunman, Scottsdale police now say. Some news reports say, though, that authorities are still trying to definitively link the fourth homicide to the string of them. The suspect is at large and has not been named. Police do not feel the homicides are random.  Stefania Okolie, the reporter for Fox10 Phoenix, is reporting that the suspect is a local attorney. \"Law enforcement sources confirming shooting death of Steven Pitt, 2 paralegals at a Scottsdale firm, & a Doctor at a Scottsdale therapist office are ALL connected. Sources also telling me who they believe is behind the shooting. He is also an attorney in the Valley #Fox10Phoenix,\" she reported. Police have released a sketch developed from witness accounts of the shooter.  https://twitter.com/ObiSun/status/1002999997959323648  Authorities had not yet confirmed that account nor released the suspect's name.  Here are the victims who have been identified so far   Steven Pitt https://twitter.com/shannahogan/status/1003000570603401218  Steven Pitt, a 59-year-old psychiatrist, was prominent in the legal world because of his long-time consultations with law enforcement throughout the country on some of the nation's highest-profile crime cases. It's not yet clear whether his work on any of those cases played a role in his death. He consulted on the Baseline Killer too. Pitt was also involved in consulting on the Columbine school shooting, according to NBC News.  Vincent Lewis, of the Phoenix Police Department said the shooting death occurred around 5:30 p.m. on Thursday, May 31, 2018, near Scottsdale and Bell roads. Witnesses described hearing \"a loud argument followed by gunshots,\" and the shooter fled, according to AZCentral.com.  The motive was not clear, and Pitt was found dead at the scene. \"We are not ruling anything out, but at this point, a loud argument probably suggests they knew each other either professionally or personally,\" Lewis said.  The Phoenix New Times previously described Pitt's work on the infamous murder case of JonBenet, the child beauty pageant contest found murdered in her family home. Pitt, who generally worked with law enforcement, was a consultant for the District Attorney and the Boulder Police Department on that case.   Born to a homemaker and school administrator in Michigan, Pitt was described by the Phoenix publication as \"a street-smart, openly ambitious wiseguy who seems most comfortable helping detectives sort out the psychopathology that has led someone -- known or unknown -- to commit a crime.\"  According to his website, \"Steven E. Pitt, D.O., is a Clinical Associate Professor of Psychiatry at the University of Arizona College of Medicine - Phoenix. A graduate of Michigan State University's College of Osteopathic Medicine, Dr. Pitt completed his residency training in psychiatry at the University of Michigan Medical Center and a fellowship in forensic psychiatry at the University of Maryland School of Medicine.\"  His website continues, \"Dr. Pitt has garnered a national reputation for his work in conducting forensic psychiatric evaluations, particularly regarding innovations that combine videotaping and transcription. Dr. Pitt's consulting background includes work with the Phoenix Police Department Homicide and Missing Persons Units, and he has performed evaluations, testified and consulted on forensic psychiatry topics on a variety of criminal cases with national and international visibility.\"  Veleria Sharp & Laura Anderson https://twitter.com/FOX10Phoenix/status/1002998557148770304  Horrifically, Valeria Sharp and Laura Anderson, both paralegals, were shot in a downtown law office near government buildings and the local Scottsdale library. One of the women was shot in the dead.   The double shooting occurred on Friday, June 1, 2018. The victims were identified as 48-year-old Sharp and 49-year-old Anderson.   Police said both women were shot in the law firm office, and that one injured woman \"ran outside and told a limo bus driver to call 911. The woman was transported to a nearby hospital where she later died,\" according to ABC15. The second woman was located dead inside the law office building. the television station reported.  \"MORE: Scottsdale police also now confirming, what we reported late last night. The shooting death of 2 paralegals at Burt|Feldman|Grenier Law office is connected to shooting death of Steven Pitt #Fox10Phoenix,\" Stefania Okolie, a reporter for Fox10 Phoenix, wrote on Twitter.  The shootings occurred at the Burt, Feldman, Grenier Law firm.   Fourth Victim https://twitter.com/StefaniaFOX10/status/1002997223288782848  By Saturday, June 2, 2018, police were confirming that the murders of Sharp and Anderson were possibly connected to yet another homicide, although this had not yet been definitively determined.  \"UPDATE: Scottsdale police now confirming this is a homicide they are working at a office off of Hayden road. Law enforcement source tells me it is a therapist office. And the man killed is a psychologist,\" Okolie wrote on Twitter. The fourth victim has not yet been identified.  https://twitter.com/mrobisonfox10/status/1002999848860184577  According to AZFamily.com, the fourth murder occurred \"at a business near the area of Hayden and Mountain roads\" and both Scottsdale and Phoenix police were investigating.  The fourth murder occurred on Saturday, June 2, 2018, meaning that a homicide was occurring every day. The victim has not yet been identified.","contentWithMarkup":"Four murders in Scottsdale, Arizona may be connected, sparking fears in the community as people connected to the legal and medical communities have been gunned down in the span of three days.\n\nThe murders began on Thursday, May 31, 2018, when a high-profile psychiatrist was slain outside his Scottsdale office. They escalated with three more deaths the next two days.\n\nThe spree of murders is believed to be connected to the same gunman, <a href=\"https://www.azcentral.com/story/news/local/scottsdale-breaking/2018/06/02/scottsdale-police-shooting-investigation/666467002/\" target=\"_blank\">Scottsdale police now say.</a> Some news reports say, though, that authorities <a href=\"https://twitter.com/BrianaWhitney/status/1003017083293089793\" target=\"_blank\">are still trying </a>to definitively link the fourth homicide to the string of them. The suspect is at large and has not been named. Police <a href=\"https://www.abc15.com/news/region-northeast-valley/scottsdale/scottsdale-police-investigating-shooting-at-business\" target=\"_blank\">do not feel</a> the homicides are random.\n\nStefania Okolie, the reporter for Fox10 Phoenix, is reporting that the suspect is a local attorney. \"Law enforcement sources confirming shooting death of Steven Pitt, 2 paralegals at a Scottsdale firm, & a Doctor at a Scottsdale therapist office are ALL connected. Sources also telling me who they believe is behind the shooting. He is also an attorney in the Valley #Fox10Phoenix,\" she reported. Police have released a sketch developed from witness accounts of the shooter.\n\nhttps://twitter.com/ObiSun/status/1002999997959323648\n\nAuthorities had not yet confirmed that account nor released the suspect's name.\n\nHere are the victims who have been identified so far\n\n<hr />\n<h2>Steven Pitt</h2>\nhttps://twitter.com/shannahogan/status/1003000570603401218\n\nSteven Pitt, a 59-year-old psychiatrist, was prominent in the legal world because of his long-time consultations with law enforcement throughout the country on some of the nation's highest-profile crime cases. It's not yet clear whether his work on any of those cases played a role in his death. <a href=\"https://www.azcentral.com/story/news/local/phoenix-breaking/2018/06/01/steven-pitt-forensic-psychologist-baseline-killer-case-killed/663556002/\" target=\"_blank\">He consulted on</a> the Baseline Killer too. Pitt was also involved in consulting on the Columbine school shooting, <a href=\"https://www.nbcnews.com/news/crime-courts/high-profile-forensic-psychiatrist-shot-dead-outside-phoenix-office-n879291\" target=\"_blank\">according to NBC News.</a>\n\nVincent Lewis, of the Phoenix Police Department said the shooting death occurred around 5:30 p.m. on Thursday, May 31, 2018, near Scottsdale and Bell roads. Witnesses described hearing \"a loud argument followed by gunshots,\" and the shooter fled, <a href=\"https://www.azcentral.com/story/news/local/phoenix-breaking/2018/06/01/steven-pitt-forensic-psychologist-baseline-killer-case-killed/663556002/\" target=\"_blank\">according to AZCentral.com.</a>\n\nThe motive was not clear, and Pitt was found dead at the scene. \"We are not ruling anything out, but at this point, a loud argument probably suggests they knew each other either professionally or personally,\" <a href=\"https://www.nbcnews.com/news/crime-courts/high-profile-forensic-psychiatrist-shot-dead-outside-phoenix-office-n879291\" target=\"_blank\">Lewis said.</a>\n\nThe Phoenix New Times <a href=\"http://www.phoenixnewtimes.com/news/pitt-and-the-pendulum-6420923\" target=\"_blank\">previously described </a>Pitt's work on the infamous murder case of JonBenet, the child beauty pageant contest found murdered in her family home. Pitt, who generally worked with law enforcement, was a consultant for the District Attorney and the Boulder Police Department on that case. \n\nBorn to a homemaker and school administrator in Michigan, Pitt was described by the Phoenix publication as \"a street-smart, openly ambitious wiseguy who seems most comfortable helping detectives sort out the psychopathology that has led someone -- known or unknown -- to commit a crime.\"\n\nAccording to his website, \"Steven E. Pitt, D.O., is a Clinical Associate Professor of Psychiatry at the University of Arizona College of Medicine - Phoenix. A graduate of Michigan State University's College of Osteopathic Medicine, Dr. Pitt completed his residency training in psychiatry at the University of Michigan Medical Center and a fellowship in forensic psychiatry at the University of Maryland School of Medicine.\"\n\n<a href=\"http://www.stevenpittassociates.com/associates-steven-pitt.html\" target=\"_blank\">His website continues</a>, \"Dr. Pitt has garnered a national reputation for his work in conducting forensic psychiatric evaluations, particularly regarding innovations that combine videotaping and transcription. Dr. Pitt's consulting background includes work with the Phoenix Police Department Homicide and Missing Persons Units, and he has performed evaluations, testified and consulted on forensic psychiatry topics on a variety of criminal cases with national and international visibility.\"\n<hr />\n<h2>Veleria Sharp & Laura Anderson</h2>\nhttps://twitter.com/FOX10Phoenix/status/1002998557148770304\n\nHorrifically, Valeria Sharp and Laura Anderson, both paralegals, were shot in a downtown law office near government buildings and the local Scottsdale library. One of the women was shot in the dead. \n\nThe double shooting occurred on Friday, June 1, 2018. The victims <a href=\"http://www.azfamily.com/story/38333440/4th-homicide-confirmed-in-scottsdale-may-be-connected-to-recent-murders\" target=\"_blank\">were identified </a>as 48-year-old Sharp and 49-year-old Anderson. \n\nPolice said both women were shot in the law firm office, and that one injured woman \"ran outside and told a limo bus driver to call 911. The woman was transported to a nearby hospital where she later died,\" <a href=\"https://www.abc15.com/news/region-northeast-valley/scottsdale/scottsdale-police-investigating-shooting-at-business\" target=\"_blank\">according to ABC15.</a> The second woman was located dead inside the law office building. the television station reported.\n\n\"MORE: Scottsdale police also now confirming, what we reported late last night. The shooting death of 2 paralegals at Burt|Feldman|Grenier Law office is connected to shooting death of Steven Pitt #Fox10Phoenix,\" Stefania Okolie, a reporter for Fox10 Phoenix, wrote on Twitter.\n\nThe shootings occurred at the Burt, Feldman, Grenier Law firm. \n<hr />\n<h2>Fourth Victim</h2>\nhttps://twitter.com/StefaniaFOX10/status/1002997223288782848\n\nBy Saturday, June 2, 2018, police were confirming that the murders of Sharp and Anderson were possibly connected to yet another homicide, although this had not yet been definitively determined.\n\n\"UPDATE: Scottsdale police now confirming this is a homicide they are working at a office off of Hayden road. Law enforcement source tells me it is a therapist office. And the man killed is a psychologist,\" Okolie wrote on Twitter. The fourth victim has not yet been identified.\n\nhttps://twitter.com/mrobisonfox10/status/1002999848860184577\n\n<a href=\"http://www.azfamily.com/story/38333440/4th-homicide-confirmed-in-scottsdale-may-be-connected-to-recent-murders\" target=\"_blank\">According to AZFamily.com</a>, the fourth murder occurred \"at a business near the area of Hayden and Mountain roads\" and both Scottsdale and Phoenix police were investigating.\n\nThe fourth murder occurred on Saturday, June 2, 2018, meaning that a homicide was occurring every day. The victim has not yet been identified.\n<hr />","tags":["News","5 Fast Facts","Arizona","Breaking News","Crime"],"publishedDate":"2018-06-02T21:25:53Z","harvestDate":"2018-06-02T21:26:00Z","estimatedPublishedDate":"2018-06-02T21:25:53Z","url":"http://ct.moreover.com/?a=34207117720&p=1u0&v=1&x=w2AAaDh_0eycAN-dsYahHw","originalUrl":"http://heavy.com/news/2018/06/scottsdale-victims-murders-paralegals-doctors/","outboundUrls":["https://www.azcentral.com/story/news/local/scottsdale-breaking/2018/06/02/scottsdale-police-shooting-investigation/666467002/","https://twitter.com/BrianaWhitney/status/1003017083293089793","https://www.abc15.com/news/region-northeast-valley/scottsdale/scottsdale-police-investigating-shooting-at-business","https://www.azcentral.com/story/news/local/phoenix-breaking/2018/06/01/steven-pitt-forensic-psychologist-baseline-killer-case-killed/663556002/","https://www.nbcnews.com/news/crime-courts/high-profile-forensic-psychiatrist-shot-dead-outside-phoenix-office-n879291","http://www.phoenixnewtimes.com/news/pitt-and-the-pendulum-6420923","http://www.stevenpittassociates.com/associates-steven-pitt.html","http://www.azfamily.com/story/38333440/4th-homicide-confirmed-in-scottsdale-may-be-connected-to-recent-murders","https://twitter.com/ObiSun/status/1002999997959323648","https://twitter.com/shannahogan/status/1003000570603401218","https://twitter.com/FOX10Phoenix/status/1002998557148770304","https://twitter.com/StefaniaFOX10/status/1002997223288782848","https://twitter.com/mrobisonfox10/status/1002999848860184577"],"wordCount":"867","dataFormat":"text","duplicateGroupId":"34207060413","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"1713950"},"adultLanguage":"false","topics":[{"name":"Phoenix news","group":"US regional"},{"name":"Crime and punishment news","group":"Society"}],"companies":[],"author":{"name":"Jessica McBride","publishingPlatform":{"userId":"107044925"}},"licenses":[],"source":{"name":"Heavy.com","homeUrl":"http://heavy.com","location":{},"feed":{"id":"455011881","name":"Heavy.com","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"62957618","generator":"http://wordpress.com/","description":"Breaking News, Sports, Entertainment, TV, Tech, Gaming & Health.","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"4","autoRankOrder":"14020","inboundLinkCount":"56"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990576}