{"sequenceId":"845365634025","id":"34207220583","language":"English","title":"HEALTH: Necrotizing fasciitis - From Wikipedia, the free encyclopedia","content":"Person with necrotizing fasciitis. The left leg shows extensive redness and tissue death. Pronunciation Necrotizing fasciitis Synonyms Flesh-eating bacteria, flesh-eating bacteria syndrome,[1] necrotizing soft tissue infection (NSTI),[2] fasciitis necroticans /ˈnɛkrəˌtaɪzɪŋ ˌfæʃiˈaɪtɪs/ or /ˌfæs-/ Specialty Infectious disease Symptoms Severe pain, fever, purple colored skin in the affected area[3] Usual onset Sudden, spreads rapidly[3] Causes Multiple types of bacteria[4] Risk factors Poor immune function such as from diabetes or cancer, obesity, alcoholism, intravenous drug use, peripheral vascular disease[2][3] Diagnostic method Based on symptoms, medical imaging[4] Prevention Wound care, handwashing[3] Treatment Surgery to remove the infected tissue, intravenous antibiotics[2][3] Prognosis ~30% mortality[2] Frequency 0.7 per 100,000 per year[4] Necrotizing fasciitis (NF), commonly known as flesh-eating disease, is an infection that results in the death of the body's soft tissue.[3] It is a severe disease of sudden onset that spreads rapidly.[3] Symptoms include red or purple skin in the affected area, severe pain, fever, and vomiting.[3] The most commonly affected areas are the limbs and perineum.[2] Typically, the infection enters the body through a break in the skin such as a cut or burn.[3] Risk factors include poor immune function such as from diabetes or cancer, obesity, alcoholism, intravenous drug use, and peripheral vascular disease.[2][3] It is not typically spread between people.[3] The disease is classified into four types, depending on the infecting organism.[4] Between 55 and 80% of cases involve more than one type of bacteria.[4] Methicillin-resistant Staphylococcus aureus (MRSA) is involved in up to a third of cases.[4] Medical imaging is helpful to confirm the diagnosis.[4] Necrotizing fasciitis may be prevented with proper wound care and handwashing.[3] It is usually treated with surgery to remove the infected tissue and intravenous antibiotics.[2][3] Often, a combination of antibiotics is used, such as penicillin G, clindamycin, vancomycin, and gentamicin.[2] Delays in surgery are associated with a higher risk of death.[4] Despite high-quality treatment, the risk of death is between 25 and 35%.[2] Necrotizing fasciitis affects 0.4 to 1.0 person per 100,000 per year.[4] Both sexes are affected equally.[2] It becomes more common among older people and is very rare in children.[4] It has been described at least since the time of Hippocrates.[2] The term \"necrotizing fasciitis\" first came into use in 1952.[4][5] Signs and symptoms[edit] The start of necrotizing fasciitis Symptoms may include fever, swelling, and complaint of excessive pain when compared to a small, benign swelling on the skin. The initial skin changes are similar to cellulitis and abscess, thus making the diagnosis of necrotizing fasciitis at early stages difficult. Induration (hardening of the skin and soft tissue) and swelling beyond the area of skin changes are commonly present in those with early necrotizing changes.[2] The redness and swelling usually blend into surrounding normal tissues. The overlying skin may appear shiny and tense.[6] Other signs which are more suggestive of necrotizing changes (but present in later stages in 7 to 44% of the cases) are: formation of bullae, skin ecchymosis which is present before skin necrosis[2] (skin turning from red to purple and black due to thrombosis of blood vessels),[6]presence of gas in tissues, and reduced or absent sensation over the skin[2] (due to the necrosis of the underlying nerves).[6] Rapid progression to shock despite antibiotic therapy is another indication of necrotizing fasciiitis. Necrotizing changes affecting the groin are known as Fournier gangrene.[2] However, those who are immunocompromised (malignancy, corticosteroid usage, radiotherapy, chemotherapy, HIV/AIDS, or prior organ or bone marrow transplantation) may not show normal signs and symptoms. Immunocompromised persons also have two-fold higher risk of death from necrotizing infections, so higher suspicion should be maintained in this group.[2] Cause[edit] Risk factors[edit] More than 70% of cases are recorded in people with at least one of these clinical situations: immunosuppression, diabetes, alcoholism/drug abuse/smoking, malignancies, and chronic systemic diseases. For reasons that are unclear, it occasionally occurs in people with an apparently normal general condition.[7] Necrotizing fasciitis can occur at any part of the body, but it is more commonly seen at the extremities, perineum, and genitals. Only a few of such cases arise from the chest and abdomen. Trauma is the usual cause of the infection such as intravenous drug injection, insulin injection, animals and insect bites, catheter insertion over the skin, or a fistulaconnecting skin to the internal body organs. Skin infections such as abscess and ulcers can also complicate necrotizing fasciitis. Spreading of infection through blood has been suggested for those with streptococcal pharyngitis. For infection of the perineum and genitals (Fournier gangrene), trauma, surgery, urinary tract infection, stones, and Bartholin glandabscess are the usual causes.[2] Bacteria[edit] Types of soft-tissue necrotizing infection can be divided into four classes according to the types of bacteria infecting the soft tissue. This classification system was first described by Giuliano and his colleagues in 1977.[4][2] Type I infection - This is the most common type of infection which accounts for 70 to 80% of the cases. It is caused by a mixture of bacterial types, usually in abdominal or groin areas.[4] This type of infection is usually inhabited by various species of Gram-positive cocci,(Staphylococcus aureus, Streptococcus pyogenes, and enterococci), Gram-negativerods, (Escherichia coli, Pseudomonas aeruginosa), and anaerobes, (Bacteroides and Clostridium species).[4] Populations of those affected are typically older with medical comorbidities such as diabetes mellitus, obesity, and immunodeficiency.[4] Usually, trauma is not the cause of such infections. Previous history of abscess infection or gut perforation with bacterial translocation may be elicited. Clostridial infection accounts for 10% of type I infection. Clostrdium species involved are Clostridium perfringens (typically causes gas gangrene), Clostridium septicum, and Clostridium sordellii. Clostrodium species produce two types of deadly toxins: alpha toxin and theta toxin. Alpha toxins cause excessive platelet aggregation which blocks blood vessels and deprives the vital organs of oxygen supply. This creates an acidic, oxygen deficient environment for the proliferation of bacteria. When alpha-toxin is absorbed by soft tissues, it can inhibit the migration of white blood cells from the blood vessels into the soft tissue, thus impairing phagocyte function. These two toxins together can cause destruction of red blood cells in blood vessels, damage to the integrity of the blood vessels, and suppression of heart function. These species are usually found in heroin injection users. Those with clostridial infections typically have severe pain at the wound site, where the wound typically drains foul-smelling blood mixing with serum(serosanguinous discharge). Shock can progress rapidly after initial injury or infection, and once the state of shock is established, the chance of dying exceeds 50%. Another bacterium with similar rapid progression is group A streptococcal infection (mostly Streptococcus pyogenes). Meanwhile, other bacterial infections require two or more days to become symptomatic.[2] Type II infection - This infection accounts for 20 to 30% of the cases, mainly involving the extremities.[4][8] This mainly involves Streptococcus pyogenes bacteria or in combination with staphylococcal infections. Both types of bacteria can progress rapidly and manifest as toxic shock syndrome. Streptococcus species produce M protein, which acts as superantigen, thus stimulating a massive systemic immune response, which is not effective against the bacterial antigen, precipitating shock. Type II infection more commonly affects young, healthy adults with a history of injury.[2] Type III infection - Vibrio vulnificus, a bacterium found in saltwater, is a rare cause of this infection, which occurs through a break in the skin. Disease progression can be as rapid as type II infection without any visible skin changes.[2] Type IV infection - Some authors have described the type IV infection as fungal infection.[4] Diagnosis[edit] Necrotizing fasciitis producing gas in the soft tissues as seen on CT scan Necrotizing fasciitis as seen on ultrasound[9] Micrograph of necrotizing fasciitis, showing necrosis (center of image) of the dense connective tissue, i.e. fascia, interposed between fat lobules (top-right and bottom-left of image), H&E stain Early diagnosis is difficult, as the disease often looks early on like a simple superficial skin infection.[4] While a number of laboratory and imaging modalities can raise the suspicion for necrotizing fasciitis, the gold standard for diagnosis is a surgical exploration in the setting of high suspicion. When in doubt, a small incision can be made into the affected tissue, and if a finger easily separates the tissue along the fascial plane, the diagnosis is confirmed and an extensive debridement should be performed.[2] Medical imaging[edit] Imaging has a limited role in the diagnosis of necrotizing fasciitis. The time delay in performing imaging is a concern. Plain radiography may show subcutaneous emphysema (gas in the subcutaneous tissue) which is strongly suggestive of necrotizing changes, but it is not sensitive enough to detect all the cases, because necrotizing skin infections caused by the bacteria other than clostridial infections usually do not show subcutaneous emphysema. If the diagnosis is still in doubt, computed tomography (CT) scans and magnetic resonance imaging (MRI) are more sensitive modalities than plain radiography. However, both the CT scan and MRI are not sensitive enough rule out necrotizing changes completely.[2] CT scan may show fascial thickening, edema, subcutaneous gas, and abscess formation.[2] In MRI, when fluid collection with deep fascia involvement occurs, thickening or enhancement with contrast injection, necrotizing fasciitis should be strongly suspected. Meanwhile, ultrasonography can show superficial abscess formation, but is not sensitive enough to diagnose necrotizing fasciitis.[2] CT scan is able to detect about 80% of cases, while MRI may pick up slightly more.[10] Scoring system[edit] A white blood cell count less than 15,000 cells/mm3 and serum sodium level greater than 135 mmol/l have a sensitivity of 90% in detecting the necrotizing soft tissue infection. It also has a 99% chance of ruling out necrotizing changes if the values have shown otherwise. Various scoring systems are being developed to determine the likelihood of getting necrotizing fasciitis, but a scoring system developed by Wong and colleagues in 2004 is the most commonly used. It is the laboratory risk indicator for necrotizing fasciitis (LRINEC) score, which can be used to stratify by risk those people having signs of severe cellulitis or abscess to determine the likelihood of necrotizing fasciitis being present. It uses six laboratory values: C-reactive protein, total white blood cell count, hemoglobin, sodium, creatinine, and blood glucose.[2] A score greater than or equal to 6 indicates that necrotizing fasciitis should be seriously considered.[11] The scoring criteria are: CRP (mg/L) ≥150: 4 points WBC count (×103/mm3) <15: 0 points 15–25: 1 point >25: 2 points Hemoglobin (g/dl) >13.5: 0 points 11–13.5: 1 point <11: 2 points Sodium (mmol/l) <135: 2 points Creatinine (umol/l) >141: 2 points Glucose (mmol/l) >10: 1 point[11][12] However, the scoring system has not been validated. The values would be falsely positive if any other inflammatory conditions are present. Therefore, the values derived from this scoring system should be interpreted with caution.[2] About 10% of patients with necrotizing fasciitis in the original study still had a LRINEC score <6.[11] A validation study showed that patients with a LRINEC score ≥6 have a higher rate of both death and amputation.[13] Prevention[edit] Prevention is by good wound care and handwashing.[3] Treatment[edit] Surgical debridement (cutting away affected tissue) is the mainstay of treatment for necrotizing fasciitis. Early medical treatment is often presumptive; thus, antibiotics should be started as soon as this condition is suspected. Given the dangerous nature of the disease, a high index of suspicion is needed. Cultures are taken to determine appropriate antibiotic coverage, and antibiotics may be changed when culture results are obtained. Besides blood pressure control and hydration, support should be initiated for those with unstable vital signs and low urine output.[2] Treatment for necrotizing fasciitis may involve an interdisciplinary care team. For example, in the case of a necrotizing fasciitis involving the head and neck, the team could include otolaryngologists, speech pathologists, intensivists, infectious-disease specialists, and plastic surgeons or oral and maxillofacial surgeons.[14] Maintaining strict asepsis during any surgical procedure and regional anaesthesia techniques are vital in preventing the occurrence of the disease.[15] Surgery[edit] In necrotizing fasciitis, aggressive wound debridement (removal of unhealthy tissues) is always necessary to keep it from spreading and is the only treatment available. Surgical incisions should extend beyond the area of induration because dermal lymphatic blockage and thrombosis of small veins are the causes of such induration. However, cellulitic soft tissue can be spared from debridement for later skin coverage of the wound. The subcutaneous tissue should be debrided until the healthy, bleeding tissue is seen. A second-look operation maybe planned within 24 hours to remove additional necrotic tissue, and typically three or four operations are required for one person. Sometimes, amputation of the affected limb or the debridement of internal organs may be necessary. After the wound debridement, adequate dressings should be applied to prevent exposure of bones, tendons, and cartilages so that such structures do not dry out and to promote wound healing.[2] For necrotizing infection of the perineal area (Fournier gangrene), wound debridement and wound care in this area can be difficult because of the excretory products that often render this area dirty and affect the wound-healing process. Therefore, regular dressing changes with a fecal management system can help to keep the wound at the perineal area clean. Sometimes, colostomy maybe necessary to divert the excretory products to keep the wound at the perineal area clean.[2] Necrotic tissue from the left leg surgically removed Postsurgical debridement and skin grafting After knee disarticulation amputation Antibiotics[edit] Broad-spectrum antibiotics that cover Gram-positive, Gram-negative, and anaerobic bacteria should be used with the consideration of MRSA coverage. Examples of antibiotics used are penicillin G, clindamycin, vancomycin, and gentamicin. Penicillin G is effective against the streptococcal and clostridial infections. Clindamycin is effective in reducing the alpha toxins produced by Clostridium species, reducing the production of M protein by streptococci, and reducing the production of tumor necrosis factor alpha by monocytes. Vancomycin is the treatment of choice for MRSA. Meanwhile, gentamicin is useful against many Gram-negative rods and anaerobic bacteria. Fluoroquinolone may be used instead of gentamicin for those with acute kidney injury for kidney protection. Antibiotics are typically continued until the cultures come back for appropriate narrowing of antibiotic spectrum or until the completion of wound debridement and the person's vital signs are stable with normal white blood cell count.[2] Others[edit] Hyperbaric oxygen treatment is sometimes used to treat necrotizing soft-tissue infection in combination with antibiotics and debridement. A person is placed inside a high-pressure chamber where oxygen is delivered at two to three times the atmospheric pressure. This results in arterial oxygen tension of 2000 mmHg and tissue oxygen tension of 300 mmHg as compared with 300 mmHg arterial oxygen tension and 75 mmHg tissue oxygen tension when breathing 100% oxygen. Human and animal studies have shown that high oxygen tension in tissues helps to reduces edema, stimulate fibroblast growth, increase the killing ability of white blood cells and toxic effects on anaerobes, inhibit bacterial toxin release, and increase antibiotics efficacy.[2] However, a lack of compelling evidence exists regarding its efficacy for this purpose.[16][17] Therefore, hyperbaric oxygen therapy is only used for those with stable vital signs in conditions where surgical debridement will not be delayed.[2] Intravenous immunoglobulin is considered for the treatment of necrotizing soft tissue infection because the immunoglobulins can bind to the exotoxins produced by streptococcal and staphylococcal infections, which subsequently limits immune response of the human body. However, data are limited on the efficacy of this therapy; such therapy is limited only for those who are critically ill.[2] Definitive management[edit] Wound dressings applied on the should allow for ambulation to prevent hospital-acquired pneumonia, urinary tract infection, and deep vein thrombosis. The use of mafenide (2.5 or 5% dilution) or Dakin solution, pulse lavage (wound irrigation using pressurized jets of normal saline to remove fibrous material and bacteria), and negative-pressure wound therapy(vacuum dressing; promotes vascularisation of wound bed) can be helpful. Wound closure should be delayed if hypoperfusion of the tissues due to hypotension is seen. Wound closure can be started once the wound bed is clean with good tissue perfusion.[2] Pain control is another important modality in wound management, as pain can affect wound healing. The severity of pain can be assessed by the Wong-Baker faces pain-rating scaleand numeric rating scale according to the age and cultural background of the those in pain. Pain can be divided into three types: background pain, breakthrough pain, and procedural pain. Background pain is relatively constant and may be started before the onset of necrotizing fasciitis which can range from mild to moderate pain. Such pain can be treated by methadone. Breakthrough pain is the sudden worsening of pain in addition to background pain, which is precipitated by movements or emotions. This type of pain can be treated by morphine, or oxycodone with combination of nonsteroidal anti-inflammatory drugs. Procedural pain is the intense burning or stinging pain when procedures are performed such as wound debridement, changing of dressings, or physiotherapy. Morphine or oxycodone, in combination with short-acting anxiolytic drugs such as midazolam and lorazepam are used. Gabapentin, an anticonvulsant, can be used to control neuropathic pain in surgical debridement and amputations. Skin graft and tissue rearrangement can be used to achieve wound closure.[2] Epidemiology[edit] Necrotizing fasciitis affects about 0.4 in every 100,000 people per year in the United States.[4] About 1,000 cases of necrotizing fasciitis cases occur per year in the United States, but the rates have been increasing. This could be due to increasing awareness of this condition, leading to increased reporting, or bacterial virulence or increasing bacterial resistance against antibiotics.[2] In some areas of the world, it is as common as one in every 100,000 people.[4] Higher rates of necrotizing fasciitis are seen in those with obesity or diabetes, those who are immunocompromised or alcoholic, or have peripheral vascular disease. However, the disease may also occur in young, healthy adults with no underlying illnesses. NSAIDs may have increase the rates of necrotizing infections due to the modification of immune response in the body, because NSAIDs inhibit the cycloxygenase -1 and cycloxygenase-2 enzymes which are important in producing thromboxane and prostaglandin E2. Prostaglandin has been responsible for fever, inflammation, and pain. The inhibition of prostangladin E2 production reduces inflammatory response and leukocyte adhesion, and thus reduces immune response against bacterial invasion, giving rise to soft-tissue infection.[2] History[edit] In the fifth century BC, Hippocrates described necrotizing soft tissue infection as a disease which was the complication of streptococcal infection where those affected would have \"erysipelas all over the body while the cause was only a trivial accident. Bones, flesh, and sinew (cord, tendon, or nerve) would fall off from the body and there were many deaths\". The first English description for necrotizing soft-tissue infection was by British surgeon Leonard Gillespie and British physicians Gilbert Blaine and Thomas Trotter in the 18th century. At that time, necrotizing soft-tissue infection was known as phagedaenic (gnaw - biting or chewing which gradually make a hole or destroying it) ulcer, phagedena gangrenous, gangrenous ulcer, malignant ulcer, putrid ulcer, or hospital gangrene. Later, \"hospital gangrene\" became more commonly used. In 1871, Confederate States Army surgeon Joseph Jones reported 2,642 cases of hospital gangrene with a mortality rate of 46%. In 1883, Dr Jean-Alfred Fournier described the necrotizing infection of the perineum and scrotum which termed as Fournier gangrene today. The term \"necrotizing fasciitis\" was first coined by Wilson in 1952. Its definition has become broader, to include not only infection of fascia, but also other soft-tissue infection.[2] Notable cases[edit] 1994 Lucien Bouchard, former premier of Québec, Canada, who was infected while leader of the federal official opposition Bloc Québécois party, lost a leg to the illness.[18] 1994 A cluster of cases occurred in Gloucestershire, in the west of England. Of five confirmed and one probable infection, two died. The cases were believed to be connected. The first two had acquired the Streptococcus pyogenes bacteria during surgery; the remaining four were community-acquired.[19] The cases generated much newspaper coverage, with lurid headlines such as \"Flesh Eating Bug Ate My Face\".[20] 1997 Ken Kendrick, former agent and partial owner of the San Diego Padres and Arizona Diamondbacks, contracted the disease. He had seven surgeries in a little more than a week and later fully recovered.[21] 2004 Eric Allin Cornell, winner of the 2001 Nobel Prize in Physics, lost his left arm and shoulder to the disease.[22] 2005 Alexandru Marin, an experimental particle physicist, professor at MIT, Boston University, and Harvard University, and researcher at CERN and JINR, died from the disease.[23] 2006 Alan Coren, British writer and satirist, announced in his Christmas column for The Times that his long absence as a columnist had been caused by his contracting the disease while on holiday in France.[24] 2009 R. W. Johnson, British journalist and historian, contracted the disease in March after injuring his foot while swimming. His leg was amputated above the knee.[25] 2011 Jeff Hanneman, guitarist for the thrash metal band Slayer, contracted the disease. He died of liver failure two years later, on May 2, 2013, and his infection was speculated to be the cause of death. However, on May 9, 2013, the official cause of death was announced as alcohol-related cirrhosis. Hanneman and his family had apparently been unaware of the extent of the condition until shortly before his death.[26] 2011 Peter Watts, Canadian science-fiction author, contracted the disease. On his blog, Watts reported, \"I’m told I was a few hours away from being dead...If there was ever a disease fit for a science-fiction writer, flesh-eating disease has got to be it. This...spread across my leg as fast as a Star Trek space disease in time-lapse.\"[27] 2014 Daniel Gildenlöw, Swedish singer and songwriter for the band Pain of Salvation, spent several months in a hospital after being diagnosed with necrotizing fasciitis on his back in early 2014. After recovering, he wrote the album In the Passing Light of Day,[28] a concept album about his experience during the hospitalization.[29] 2015 Edgar Savisaar, Estonian politician, had his right leg was amputated. He got the disease during a trip to Thailand.[30] See also Necrotizing fasciitis - Wikipedia Necrotizing fasciitis may be prevented with proper wound care and handwashing. It is usually treated with surgery to remove the infected tissue and intravenous antibiotics. Often, a combination of antibiotics is used, such as penicillin G, clindamycin, vancomycin, and gentamicin. Delays in surgery are associated with a higher risk of death.","contentWithMarkup":"<a href=\"https://en.wikipedia.org/wiki/File:Necrotizing_fasciitis_left_leg.JPEG\"><img height=\"366\" src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Necrotizing_fasciitis_left_leg.JPEG/300px-Necrotizing_fasciitis_left_leg.JPEG\" width=\"640\" /></a><br />Person with necrotizing fasciitis. The left leg shows extensive redness and <a href=\"https://en.wikipedia.org/wiki/Necrosis\">tissue death</a>.<br />Pronunciation <br /><br />Necrotizing fasciitis<br />Synonyms Flesh-eating bacteria, flesh-eating bacteria syndrome,<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-1\">[1]</a> necrotizing soft tissue infection (NSTI),<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a> fasciitis necroticans<br /><br /><div><a href=\"https://en.wikipedia.org/wiki/Help:IPA/English\">/ˈnɛkrəˌtaɪzɪŋ ˌfæʃiˈaɪtɪs/</a> or <a href=\"https://en.wikipedia.org/wiki/Help:IPA/English\">/ˌfæs-/</a><br /><a href=\"https://en.wikipedia.org/wiki/Specialty_(medicine)\">Specialty</a> <a href=\"https://en.wikipedia.org/wiki/Infectious_disease_(medical_specialty)\">Infectious disease</a><br />Symptoms <a href=\"https://en.wikipedia.org/wiki/Pain_out_of_proportion\">Severe pain</a>, <a href=\"https://en.wikipedia.org/wiki/Fever\">fever</a>, purple colored skin in the affected area<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-CDC2016-3\">[3]</a><br />Usual onset Sudden, spreads rapidly<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-CDC2016-3\">[3]</a><br />Causes Multiple types of <a href=\"https://en.wikipedia.org/wiki/Bacteria\">bacteria</a><a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a><br /><a href=\"https://en.wikipedia.org/wiki/Risk_factor\">Risk factors</a> <a href=\"https://en.wikipedia.org/wiki/Immunodeficiency\">Poor immune function</a> such as from <a href=\"https://en.wikipedia.org/wiki/Diabetes\">diabetes</a> or <a href=\"https://en.wikipedia.org/wiki/Cancer\">cancer</a>, <a href=\"https://en.wikipedia.org/wiki/Obesity\">obesity</a>, <a href=\"https://en.wikipedia.org/wiki/Alcoholism\">alcoholism</a>, <a href=\"https://en.wikipedia.org/wiki/Intravenous_drug_use\">intravenous drug use</a>, <a href=\"https://en.wikipedia.org/wiki/Peripheral_vascular_disease\">peripheral vascular disease</a><a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-CDC2016-3\">[3]</a><br /><a href=\"https://en.wikipedia.org/wiki/Diagnostic_method\">Diagnostic method</a> Based on symptoms, <a href=\"https://en.wikipedia.org/wiki/Medical_imaging\">medical imaging</a><a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a><br />Prevention <a href=\"https://en.wikipedia.org/wiki/Wound_care\">Wound care</a>, <a href=\"https://en.wikipedia.org/wiki/Handwashing\">handwashing</a><a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-CDC2016-3\">[3]</a><br />Treatment <a href=\"https://en.wikipedia.org/wiki/Debridement\">Surgery to remove the infected tissue</a>, intravenous <a href=\"https://en.wikipedia.org/wiki/Antibiotic\">antibiotics</a><a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-CDC2016-3\">[3]</a><br />Prognosis ~30% mortality<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br />Frequency 0.7 per 100,000 per year<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a><br /><br />Necrotizing fasciitis (NF), commonly known as flesh-eating disease, is an <a href=\"https://en.wikipedia.org/wiki/Infection\">infection</a> that results in the <a href=\"https://en.wikipedia.org/wiki/Necrosis\">death</a> of the body's <a href=\"https://en.wikipedia.org/wiki/Soft_tissue\">soft tissue</a>.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-CDC2016-3\">[3]</a> It is a severe disease of sudden onset that spreads rapidly.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-CDC2016-3\">[3]</a> Symptoms include red or purple skin in the affected area, severe pain, <a href=\"https://en.wikipedia.org/wiki/Fever\">fever</a>, and vomiting.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-CDC2016-3\">[3]</a> The most commonly affected areas are the <a href=\"https://en.wikipedia.org/wiki/Limb_(anatomy)\">limbs</a> and <a href=\"https://en.wikipedia.org/wiki/Perineum\">perineum</a>.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br /><br />Typically, the infection enters the body through a break in the skin such as a cut or <a href=\"https://en.wikipedia.org/wiki/Burn\">burn</a>.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-CDC2016-3\">[3]</a> Risk factors include <a href=\"https://en.wikipedia.org/wiki/Immunodeficiency\">poor immune function</a> such as from <a href=\"https://en.wikipedia.org/wiki/Diabetes\">diabetes</a> or <a href=\"https://en.wikipedia.org/wiki/Cancer\">cancer</a>, <a href=\"https://en.wikipedia.org/wiki/Obesity\">obesity</a>, <a href=\"https://en.wikipedia.org/wiki/Alcoholism\">alcoholism</a>, <a href=\"https://en.wikipedia.org/wiki/Intravenous_drug_use\">intravenous drug use</a>, and <a href=\"https://en.wikipedia.org/wiki/Peripheral_vascular_disease\">peripheral vascular disease</a>.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-CDC2016-3\">[3]</a> It is not typically spread between people.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-CDC2016-3\">[3]</a> The disease is classified into four types, depending on the infecting organism.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a> Between 55 and 80% of cases involve more than one type of <a href=\"https://en.wikipedia.org/wiki/Bacteria\">bacteria</a>.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a> <a href=\"https://en.wikipedia.org/wiki/Methicillin-resistant_Staphylococcus_aureus\">Methicillin-resistant Staphylococcus aureus</a> (MRSA) is involved in up to a third of cases.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a> <a href=\"https://en.wikipedia.org/wiki/Medical_imaging\">Medical imaging</a> is helpful to confirm the diagnosis.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a><br /><br />Necrotizing fasciitis may be prevented with proper <a href=\"https://en.wikipedia.org/wiki/Wound_care\">wound care</a> and <a href=\"https://en.wikipedia.org/wiki/Handwashing\">handwashing</a>.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-CDC2016-3\">[3]</a> It is usually treated with <a href=\"https://en.wikipedia.org/wiki/Debridement\">surgery to remove the infected tissue</a> and intravenous <a href=\"https://en.wikipedia.org/wiki/Antibiotic\">antibiotics</a>.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-CDC2016-3\">[3]</a> Often, a combination of antibiotics is used, such as <a href=\"https://en.wikipedia.org/wiki/Penicillin_G\">penicillin G</a>, <a href=\"https://en.wikipedia.org/wiki/Clindamycin\">clindamycin</a>, <a href=\"https://en.wikipedia.org/wiki/Vancomycin\">vancomycin</a>, and <a href=\"https://en.wikipedia.org/wiki/Gentamicin\">gentamicin</a>.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a> Delays in surgery are associated with a higher risk of death.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a> Despite high-quality treatment, the risk of death is between 25 and 35%.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br /><br />Necrotizing fasciitis affects 0.4 to 1.0 person per 100,000 per year.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a> Both sexes are affected equally.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a> It becomes more common among older people and is very rare in children.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a> It has been described at least since the time of <a href=\"https://en.wikipedia.org/wiki/Hippocrates\">Hippocrates</a>.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a> The term \"necrotizing fasciitis\" first came into use in 1952.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a><a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-5\">[5]</a><br /><br />Signs and symptoms[<a href=\"https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=1\">edit</a>]<br /><a href=\"https://en.wikipedia.org/wiki/File:Beginning_of_Necrotizing_Fasciitis_01.jpg\"><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Beginning_of_Necrotizing_Fasciitis_01.jpg/220px-Beginning_of_Necrotizing_Fasciitis_01.jpg\" /></a><br /><a href=\"https://en.wikipedia.org/wiki/File:Beginning_of_Necrotizing_Fasciitis_01.jpg\"></a>The start of necrotizing fasciitis<br /><br />Symptoms may include fever, swelling, and complaint of excessive pain when compared to a small, benign swelling on the skin. The initial skin changes are similar to <a href=\"https://en.wikipedia.org/wiki/Cellulitis\">cellulitis</a> and <a href=\"https://en.wikipedia.org/wiki/Abscess\">abscess</a>, thus making the diagnosis of necrotizing fasciitis at early stages difficult. Induration (hardening of the skin and soft tissue) and swelling beyond the area of skin changes are commonly present in those with early necrotizing changes.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a> The redness and swelling usually blend into surrounding normal tissues. The overlying skin may appear shiny and tense.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Trent_2002-6\">[6]</a> Other signs which are more suggestive of necrotizing changes (but present in later stages in 7 to 44% of the cases) are: formation of <a href=\"https://en.wikipedia.org/wiki/Bulla_(dermatology)\">bullae</a>, skin <a href=\"https://en.wikipedia.org/wiki/Ecchymosis\">ecchymosis</a> which is present before skin <a href=\"https://en.wikipedia.org/wiki/Necrosis\">necrosis</a><a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a> (skin turning from red to purple and black due to <a href=\"https://en.wikipedia.org/wiki/Thrombosis\">thrombosis</a> of blood vessels),<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Trent_2002-6\">[6]</a>presence of gas in tissues, and reduced or absent sensation over the skin<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a> (due to the necrosis of the underlying nerves).<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Trent_2002-6\">[6]</a> Rapid progression to <a href=\"https://en.wikipedia.org/wiki/Shock_(circulatory)\">shock</a> despite antibiotic therapy is another indication of necrotizing fasciiitis. Necrotizing changes affecting the groin are known as <a href=\"https://en.wikipedia.org/wiki/Fournier_gangrene\">Fournier gangrene</a>.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br /><br />However, those who are immunocompromised (malignancy, <a href=\"https://en.wikipedia.org/wiki/Corticosteroid\">corticosteroid</a> usage, <a href=\"https://en.wikipedia.org/wiki/Radiotherapy\">radiotherapy</a>, <a href=\"https://en.wikipedia.org/wiki/Chemotherapy\">chemotherapy</a>, <a href=\"https://en.wikipedia.org/wiki/HIV/AIDS\">HIV/AIDS</a>, or prior organ or <a href=\"https://en.wikipedia.org/wiki/Bone_marrow\">bone marrow</a> transplantation) may not show normal signs and symptoms. Immunocompromised persons also have two-fold higher risk of death from necrotizing infections, so higher suspicion should be maintained in this group.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br />Cause[<a href=\"https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=2\">edit</a>]<br />Risk factors[<a href=\"https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=3\">edit</a>]<br /><br />More than 70% of cases are recorded in people with at least one of these clinical situations: immunosuppression, diabetes, alcoholism/drug abuse/smoking, malignancies, and chronic systemic diseases. For reasons that are unclear, it occasionally occurs in people with an apparently normal general condition.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-7\">[7]</a><br /><br />Necrotizing fasciitis can occur at any part of the body, but it is more commonly seen at the extremities, <a href=\"https://en.wikipedia.org/wiki/Perineum\">perineum</a>, and <a href=\"https://en.wikipedia.org/wiki/Genital\">genitals</a>. Only a few of such cases arise from the chest and abdomen. Trauma is the usual cause of the infection such as intravenous drug injection, insulin injection, animals and insect bites, catheter insertion over the skin, or a <a href=\"https://en.wikipedia.org/wiki/Fistula\">fistula</a>connecting skin to the internal body organs. Skin infections such as abscess and ulcers can also complicate necrotizing fasciitis. Spreading of infection through blood has been suggested for those with streptococcal pharyngitis. For infection of the perineum and genitals (<a href=\"https://en.wikipedia.org/wiki/Fournier_gangrene\">Fournier gangrene</a>), trauma, surgery, <a href=\"https://en.wikipedia.org/wiki/Urinary_tract_infection\">urinary tract infection</a>, stones, and <a href=\"https://en.wikipedia.org/wiki/Bartholin_gland\">Bartholin gland</a>abscess are the usual causes.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br />Bacteria[<a href=\"https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=4\">edit</a>]<br /><br />Types of soft-tissue necrotizing infection can be divided into four classes according to the types of bacteria infecting the soft tissue. This classification system was first described by Giuliano and his colleagues in 1977.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a><a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br /><br />Type I infection - This is the most common type of infection which accounts for 70 to 80% of the cases. It is caused by a mixture of bacterial types, usually in abdominal or groin areas.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a> This type of infection is usually inhabited by various species of <a href=\"https://en.wikipedia.org/wiki/Gram-positive\">Gram-positive</a> cocci,(<a href=\"https://en.wikipedia.org/wiki/Staphylococcus_aureus\">Staphylococcus aureus</a>, <a href=\"https://en.wikipedia.org/wiki/Streptococcus_pyogenes\">Streptococcus pyogenes</a>, and <a href=\"https://en.wikipedia.org/wiki/Enterococci\">enterococci</a>), <a href=\"https://en.wikipedia.org/wiki/Gram-negative\">Gram-negative</a>rods, (<a href=\"https://en.wikipedia.org/wiki/Escherichia_coli\">Escherichia coli</a>, <a href=\"https://en.wikipedia.org/wiki/Pseudomonas_aeruginosa\">Pseudomonas aeruginosa</a>), and anaerobes, (<a href=\"https://en.wikipedia.org/wiki/Bacteroides\">Bacteroides</a> and <a href=\"https://en.wikipedia.org/wiki/Clostridium\">Clostridium</a> species).<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a> Populations of those affected are typically older with medical comorbidities such as diabetes mellitus, obesity, and immunodeficiency.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a> Usually, trauma is not the cause of such infections. Previous history of abscess infection or gut perforation with bacterial translocation may be elicited. Clostridial infection accounts for 10% of type I infection. Clostrdium species involved are <a href=\"https://en.wikipedia.org/wiki/Clostridium_perfringens\">Clostridium perfringens</a> (typically causes <a href=\"https://en.wikipedia.org/wiki/Gas_gangrene\">gas gangrene</a>), <a href=\"https://en.wikipedia.org/wiki/Clostridium_septicum\">Clostridium septicum</a>, and <a href=\"https://en.wikipedia.org/wiki/Clostridium_sordellii\">Clostridium sordellii</a>. Clostrodium species produce two types of deadly toxins: <a href=\"https://en.wikipedia.org/wiki/Clostridium_perfringens\">alpha toxin</a> and theta toxin. Alpha toxins cause excessive platelet aggregation which blocks blood vessels and deprives the vital organs of oxygen supply. This creates an acidic, oxygen deficient environment for the proliferation of bacteria. When alpha-toxin is absorbed by soft tissues, it can inhibit the <a href=\"https://en.wikipedia.org/wiki/Leukocyte_extravasation\">migration of white blood cells from the blood vessels into the soft tissue</a>, thus impairing <a href=\"https://en.wikipedia.org/wiki/Phagocyte\">phagocyte</a> function. These two toxins together can cause <a href=\"https://en.wikipedia.org/wiki/Haemolysis\">destruction of red blood cells in blood vessels</a>, damage to the integrity of the blood vessels, and suppression of heart function. These species are usually found in <a href=\"https://en.wikipedia.org/wiki/Heroin\">heroin</a> injection users. Those with clostridial infections typically have severe pain at the wound site, where the wound typically drains foul-smelling blood mixing with <a href=\"https://en.wikipedia.org/wiki/Serous_fluid\">serum</a>(serosanguinous discharge). <a href=\"https://en.wikipedia.org/wiki/Shock_(circulatory)\">Shock</a> can progress rapidly after initial injury or infection, and once the state of shock is established, the chance of dying exceeds 50%. Another bacterium with similar rapid progression is <a href=\"https://en.wikipedia.org/wiki/Group_A_streptococcal_infection\">group A streptococcal infection</a> (mostly <a href=\"https://en.wikipedia.org/wiki/Streptococcus_pyogenes\">Streptococcus pyogenes</a>). Meanwhile, other bacterial infections require two or more days to become symptomatic.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br /><br />Type II infection - This infection accounts for 20 to 30% of the cases, mainly involving the extremities.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a><a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-SaraniStrong2009-8\">[8]</a> This mainly involves Streptococcus pyogenes bacteria or in combination with staphylococcal infections. Both types of bacteria can progress rapidly and manifest as <a href=\"https://en.wikipedia.org/wiki/Toxic_shock_syndrome\">toxic shock syndrome</a>. Streptococcus species produce <a href=\"https://en.wikipedia.org/wiki/M_protein_(Streptococcus)\">M protein</a>, which acts as <a href=\"https://en.wikipedia.org/wiki/Superantigen\">superantigen</a>, thus stimulating a massive systemic immune response, which is not effective against the bacterial antigen, precipitating shock. Type II infection more commonly affects young, healthy adults with a history of injury.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br /><br />Type III infection - <a href=\"https://en.wikipedia.org/wiki/Vibrio_vulnificus\">Vibrio vulnificus</a>, a bacterium found in <a href=\"https://en.wikipedia.org/wiki/Seawater\">saltwater</a>, is a rare cause of this infection, which occurs through a break in the skin. Disease progression can be as rapid as type II infection without any visible skin changes.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br /><br />Type IV infection - Some authors have described the type IV infection as fungal infection.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a><br />Diagnosis[<a href=\"https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=5\">edit</a>]<br /><a href=\"https://en.wikipedia.org/wiki/File:Pnecrotisingfasc.png\"><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Pnecrotisingfasc.png/220px-Pnecrotisingfasc.png\" /></a><br /><a href=\"https://en.wikipedia.org/wiki/File:Pnecrotisingfasc.png\"></a>Necrotizing fasciitis producing gas in the soft tissues as seen on CT scan<br /><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/UOTW_58_-_Ultrasound_of_the_Week_1.webm/220px--UOTW_58_-_Ultrasound_of_the_Week_1.webm.jpg\" /><a href=\"https://upload.wikimedia.org/wikipedia/commons/2/2a/UOTW_58_-_Ultrasound_of_the_Week_1.webm\"></a><br /><a href=\"https://en.wikipedia.org/wiki/File:UOTW_58_-_Ultrasound_of_the_Week_1.webm\"></a>Necrotizing fasciitis as seen on ultrasound<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-9\">[9]</a><br /><a href=\"https://en.wikipedia.org/wiki/File:Necrotizing_fasciitis_-_intermed_mag.jpg\"><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Necrotizing_fasciitis_-_intermed_mag.jpg/220px-Necrotizing_fasciitis_-_intermed_mag.jpg\" /></a><br /><a href=\"https://en.wikipedia.org/wiki/File:Necrotizing_fasciitis_-_intermed_mag.jpg\"></a><a href=\"https://en.wikipedia.org/wiki/Micrograph\">Micrograph</a> of necrotizing fasciitis, showing necrosis (center of image) of the dense connective tissue, i.e. <a href=\"https://en.wikipedia.org/wiki/Fascia\">fascia</a>, interposed between fat lobules (top-right and bottom-left of image), <a href=\"https://en.wikipedia.org/wiki/H%26E_stain\">H&E stain</a><br /><br />Early diagnosis is difficult, as the disease often looks early on like a <a href=\"https://en.wikipedia.org/wiki/Cellulitis\">simple superficial skin infection</a>.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a> While a number of laboratory and imaging modalities can raise the suspicion for necrotizing fasciitis, the gold standard for diagnosis is a surgical exploration in the setting of high suspicion. When in doubt, a small incision can be made into the affected tissue, and if a finger easily separates the tissue along the <a href=\"https://en.wikipedia.org/wiki/Fascia\">fascial</a> plane, the diagnosis is confirmed and an extensive <a href=\"https://en.wikipedia.org/wiki/Debridement\">debridement</a> should be performed.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br />Medical imaging[<a href=\"https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=6\">edit</a>]<br /><br />Imaging has a limited role in the diagnosis of necrotizing fasciitis. The time delay in performing imaging is a concern. Plain radiography may show subcutaneous emphysema (gas in the <a href=\"https://en.wikipedia.org/wiki/Subcutaneous_tissue\">subcutaneous</a> tissue) which is strongly suggestive of necrotizing changes, but it is not sensitive enough to detect all the cases, because necrotizing skin infections caused by the bacteria other than clostridial infections usually do not show subcutaneous emphysema. If the diagnosis is still in doubt, <a href=\"https://en.wikipedia.org/wiki/Computed_tomography\">computed tomography</a> (CT) scans and <a href=\"https://en.wikipedia.org/wiki/Magnetic_resonance_imaging\">magnetic resonance imaging</a> (MRI) are more sensitive modalities than plain radiography. However, both the CT scan and MRI are not sensitive enough rule out necrotizing changes completely.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a> CT scan may show fascial thickening, edema, subcutaneous gas, and abscess formation.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a> In MRI, when fluid collection with deep fascia involvement occurs, thickening or enhancement with <a href=\"https://en.wikipedia.org/wiki/Contrast_medium\">contrast</a> injection, necrotizing fasciitis should be strongly suspected. Meanwhile, ultrasonography can show superficial abscess formation, but is not sensitive enough to diagnose necrotizing fasciitis.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a> CT scan is able to detect about 80% of cases, while MRI may pick up slightly more.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-10\">[10]</a><br />Scoring system[<a href=\"https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=7\">edit</a>]<br /><br />A white blood cell count less than 15,000 cells/mm3 and serum sodium level greater than 135 mmol/l have a sensitivity of 90% in detecting the necrotizing soft tissue infection. It also has a 99% chance of <a href=\"https://en.wikipedia.org/wiki/Positive_and_negative_predictive_values\">ruling out necrotizing changes if the values have shown otherwise</a>. Various scoring systems are being developed to determine the likelihood of getting necrotizing fasciitis, but a scoring system developed by Wong and colleagues in 2004 is the most commonly used. It is the laboratory risk indicator for necrotizing fasciitis (LRINEC) score, which can be used to stratify by risk those people having signs of severe cellulitis or abscess to determine the likelihood of necrotizing fasciitis being present. It uses six laboratory values: <a href=\"https://en.wikipedia.org/wiki/C-reactive_protein\">C-reactive protein</a>, total <a href=\"https://en.wikipedia.org/wiki/White_blood_cell\">white blood cell</a> count, <a href=\"https://en.wikipedia.org/wiki/Hemoglobin\">hemoglobin</a>, <a href=\"https://en.wikipedia.org/wiki/Sodium\">sodium</a>, <a href=\"https://en.wikipedia.org/wiki/Creatinine\">creatinine</a>, and blood <a href=\"https://en.wikipedia.org/wiki/Glucose\">glucose</a>.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a> A score greater than or equal to 6 indicates that necrotizing fasciitis should be seriously considered.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Wong_2004-11\">[11]</a> The scoring criteria are:<br />CRP (mg/L) ≥150: 4 points<br />WBC count (×103/mm3)<br /><15: 0 points<br />15–25: 1 point<br />>25: 2 points<br />Hemoglobin (g/dl)<br />>13.5: 0 points<br />11–13.5: 1 point<br /><11: 2 points<br />Sodium (mmol/l) <135: 2 points<br />Creatinine (umol/l) >141: 2 points<br />Glucose (mmol/l) >10: 1 point<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Wong_2004-11\">[11]</a><a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-12\">[12]</a><br /><br />However, the scoring system has not been validated. The values would be falsely positive if any other inflammatory conditions are present. Therefore, the values derived from this scoring system should be interpreted with caution.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a> About 10% of patients with necrotizing fasciitis in the original study still had a LRINEC score <6.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Wong_2004-11\">[11]</a> A validation study showed that patients with a LRINEC score ≥6 have a higher rate of both death and amputation.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-13\">[13]</a><br />Prevention[<a href=\"https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=8\">edit</a>]<br /><br />Prevention is by good <a href=\"https://en.wikipedia.org/wiki/Wound_care\">wound care</a> and handwashing.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-CDC2016-3\">[3]</a><br />Treatment[<a href=\"https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=9\">edit</a>]<br /><br />Surgical <a href=\"https://en.wikipedia.org/wiki/Debridement\">debridement</a> (cutting away affected tissue) is the mainstay of treatment for necrotizing fasciitis. Early medical treatment is often presumptive; thus, antibiotics should be started as soon as this condition is suspected. Given the dangerous nature of the disease, a high index of suspicion is needed. Cultures are taken to determine appropriate antibiotic coverage, and antibiotics may be changed when culture results are obtained. Besides blood pressure control and hydration, support should be initiated for those with unstable vital signs and low urine output.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br /><br />Treatment for necrotizing fasciitis may involve an interdisciplinary care team. For example, in the case of a necrotizing fasciitis involving the head and neck, the team could include otolaryngologists, speech pathologists, intensivists, infectious-disease specialists, and plastic surgeons or oral and maxillofacial surgeons.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Malik-14\">[14]</a> Maintaining strict asepsis during any surgical procedure and regional anaesthesia techniques are vital in preventing the occurrence of the disease.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-pmid24163537-15\">[15]</a><br />Surgery[<a href=\"https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=10\">edit</a>]<br /><br />In necrotizing fasciitis, aggressive wound debridement (removal of unhealthy tissues) is always necessary to keep it from spreading and is the only treatment available. Surgical incisions should extend beyond the area of induration because dermal lymphatic blockage and thrombosis of small veins are the causes of such induration. However, cellulitic soft tissue can be spared from debridement for later skin coverage of the wound. The subcutaneous tissue should be debrided until the healthy, bleeding tissue is seen. A second-look operation maybe planned within 24 hours to remove additional necrotic tissue, and typically three or four operations are required for one person. Sometimes, amputation of the affected limb or the debridement of internal organs may be necessary. After the wound debridement, adequate dressings should be applied to prevent exposure of bones, <a href=\"https://en.wikipedia.org/wiki/Tendon\">tendons</a>, and <a href=\"https://en.wikipedia.org/wiki/Cartilage\">cartilages</a> so that such structures do not dry out and to promote wound healing.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br /><br />For necrotizing infection of the perineal area (Fournier gangrene), wound debridement and wound care in this area can be difficult because of the excretory products that often render this area dirty and affect the wound-healing process. Therefore, regular dressing changes with a fecal management system can help to keep the wound at the perineal area clean. Sometimes, <a href=\"https://en.wikipedia.org/wiki/Colostomy\">colostomy</a> maybe necessary to divert the excretory products to keep the wound at the perineal area clean.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br /><a href=\"https://en.wikipedia.org/wiki/File:Necrotizing_fasciitis_left_leg_debridement.JPEG\"><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Necrotizing_fasciitis_left_leg_debridement.JPEG/120px-Necrotizing_fasciitis_left_leg_debridement.JPEG\" /></a><br /><br /><br />Necrotic tissue from the left leg surgically removed <br /><a href=\"https://en.wikipedia.org/wiki/File:Post_surgical_debridement_and_skin_grafting..jpg\"><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Post_surgical_debridement_and_skin_grafting..jpg/90px-Post_surgical_debridement_and_skin_grafting..jpg\" /></a><br /><br /><br />Postsurgical debridement and skin grafting <br /><a href=\"https://en.wikipedia.org/wiki/File:Knee_Disarticulation_Amputation.jpg\"><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Knee_Disarticulation_Amputation.jpg/90px-Knee_Disarticulation_Amputation.jpg\" /></a><br /><br /><br />After knee disarticulation amputation<br />Antibiotics[<a href=\"https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=11\">edit</a>]<br /><br />Broad-spectrum antibiotics that cover Gram-positive, Gram-negative, and anaerobic bacteria should be used with the consideration of MRSA coverage. Examples of antibiotics used are <a href=\"https://en.wikipedia.org/wiki/Penicillin_G\">penicillin G</a>, <a href=\"https://en.wikipedia.org/wiki/Clindamycin\">clindamycin</a>, <a href=\"https://en.wikipedia.org/wiki/Vancomycin\">vancomycin</a>, and <a href=\"https://en.wikipedia.org/wiki/Gentamicin\">gentamicin</a>. Penicillin G is effective against the streptococcal and clostridial infections. Clindamycin is effective in reducing the alpha toxins produced by Clostridium species, reducing the production of M protein by streptococci, and reducing the production of <a href=\"https://en.wikipedia.org/wiki/Tumor_necrosis_factor_alpha\">tumor necrosis factor alpha</a> by <a href=\"https://en.wikipedia.org/wiki/Monocytes\">monocytes</a>. Vancomycin is the treatment of choice for MRSA. Meanwhile, gentamicin is useful against many Gram-negative rods and anaerobic bacteria. <a href=\"https://en.wikipedia.org/wiki/Fluoroquinolone\">Fluoroquinolone</a> may be used instead of gentamicin for those with <a href=\"https://en.wikipedia.org/wiki/Acute_kidney_injury\">acute kidney injury</a> for kidney protection. Antibiotics are typically continued until the cultures come back for appropriate narrowing of antibiotic spectrum or until the completion of wound debridement and the person's vital signs are stable with normal white blood cell count.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br />Others[<a href=\"https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=12\">edit</a>]<br /><br /><a href=\"https://en.wikipedia.org/wiki/Hyperbaric_oxygen\">Hyperbaric oxygen</a> treatment is sometimes used to treat necrotizing soft-tissue infection in combination with antibiotics and debridement. A person is placed inside a high-pressure chamber where oxygen is delivered at two to three times the atmospheric pressure. This results in arterial oxygen tension of 2000 mmHg and tissue oxygen tension of 300 mmHg as compared with 300 mmHg arterial oxygen tension and 75 mmHg tissue oxygen tension when breathing 100% oxygen. Human and animal studies have shown that high oxygen tension in tissues helps to reduces edema, stimulate <a href=\"https://en.wikipedia.org/wiki/Fibroblast\">fibroblast</a> growth, increase the killing ability of white blood cells and toxic effects on anaerobes, inhibit bacterial toxin release, and increase antibiotics efficacy.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a> However, a lack of compelling evidence exists regarding its efficacy for this purpose.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-16\">[16]</a><a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-17\">[17]</a> Therefore, hyperbaric oxygen therapy is only used for those with stable vital signs in conditions where surgical debridement will not be delayed.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br /><br /><a href=\"https://en.wikipedia.org/wiki/Intravenous_immunoglobulin\">Intravenous immunoglobulin</a> is considered for the treatment of necrotizing soft tissue infection because the immunoglobulins can bind to the exotoxins produced by streptococcal and staphylococcal infections, which subsequently limits immune response of the human body. However, data are limited on the efficacy of this therapy; such therapy is limited only for those who are critically ill.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br />Definitive management[<a href=\"https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=13\">edit</a>]<br /><br />Wound dressings applied on the should allow for ambulation to prevent hospital-acquired <a href=\"https://en.wikipedia.org/wiki/Pneumonia\">pneumonia</a>, <a href=\"https://en.wikipedia.org/wiki/Urinary_tract_infection\">urinary tract infection</a>, and <a href=\"https://en.wikipedia.org/wiki/Deep_vein_thrombosis\">deep vein thrombosis</a>. The use of <a href=\"https://en.wikipedia.org/wiki/Mafenide\">mafenide</a> (2.5 or 5% dilution) or Dakin solution, <a href=\"https://en.wikipedia.org/wiki/Therapeutic_irrigation\">pulse lavage</a> (wound irrigation using pressurized jets of <a href=\"https://en.wikipedia.org/wiki/Normal_saline\">normal saline</a> to remove fibrous material and bacteria), and <a href=\"https://en.wikipedia.org/wiki/Negative-pressure_wound_therapy\">negative-pressure wound therapy</a>(vacuum dressing; promotes vascularisation of wound bed) can be helpful. Wound closure should be delayed if hypoperfusion of the tissues due to <a href=\"https://en.wikipedia.org/wiki/Hypotension\">hypotension</a> is seen. Wound closure can be started once the wound bed is clean with good tissue perfusion.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br /><br />Pain control is another important modality in wound management, as pain can affect wound healing. The severity of pain can be assessed by the <a href=\"https://en.wikipedia.org/wiki/Wong-Baker_Faces_Pain_Rating_Scale\">Wong-Baker faces pain-rating scale</a>and <a href=\"https://en.wikipedia.org/wiki/Pain_scale\">numeric rating scale</a> according to the age and cultural background of the those in pain. Pain can be divided into three types: background pain, breakthrough pain, and procedural pain. Background pain is relatively constant and may be started before the onset of necrotizing fasciitis which can range from mild to moderate pain. Such pain can be treated by <a href=\"https://en.wikipedia.org/wiki/Methadone\">methadone</a>. Breakthrough pain is the sudden worsening of pain in addition to background pain, which is precipitated by movements or emotions. This type of pain can be treated by <a href=\"https://en.wikipedia.org/wiki/Morphine\">morphine</a>, or <a href=\"https://en.wikipedia.org/wiki/Oxycodone\">oxycodone</a> with combination of <a href=\"https://en.wikipedia.org/wiki/Nonsteroidal_anti-inflammatory_drug\">nonsteroidal anti-inflammatory drugs</a>. Procedural pain is the intense burning or stinging pain when procedures are performed such as wound debridement, changing of dressings, or physiotherapy. Morphine or oxycodone, in combination with short-acting anxiolytic drugs such as <a href=\"https://en.wikipedia.org/wiki/Midazolam\">midazolam</a> and <a href=\"https://en.wikipedia.org/wiki/Lorazepam\">lorazepam</a> are used. <a href=\"https://en.wikipedia.org/wiki/Gabapentin\">Gabapentin</a>, an <a href=\"https://en.wikipedia.org/wiki/Anticonvulsant\">anticonvulsant</a>, can be used to control <a href=\"https://en.wikipedia.org/wiki/Neuropathic_pain\">neuropathic pain</a> in surgical debridement and amputations. Skin graft and tissue rearrangement can be used to achieve wound closure.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br />Epidemiology[<a href=\"https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=14\">edit</a>]<br /><br />Necrotizing fasciitis affects about 0.4 in every 100,000 people per year in the United States.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a> About 1,000 cases of necrotizing fasciitis cases occur per year in the United States, but the rates have been increasing. This could be due to increasing awareness of this condition, leading to increased reporting, or bacterial virulence or increasing bacterial resistance against antibiotics.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a> In some areas of the world, it is as common as one in every 100,000 people.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4\">[4]</a><br /><br />Higher rates of necrotizing fasciitis are seen in those with obesity or diabetes, those who are immunocompromised or alcoholic, or have <a href=\"https://en.wikipedia.org/wiki/Peripheral_vascular_disease\">peripheral vascular disease</a>. However, the disease may also occur in young, healthy adults with no underlying illnesses. <a href=\"https://en.wikipedia.org/wiki/Non-steroidal_anti-inflammatory_drug\">NSAIDs</a> may have increase the rates of necrotizing infections due to the modification of immune response in the body, because NSAIDs inhibit the <a href=\"https://en.wikipedia.org/wiki/Cycloxygenase\">cycloxygenase</a> -1 and cycloxygenase-2 enzymes which are important in producing <a href=\"https://en.wikipedia.org/wiki/Thromboxane\">thromboxane</a> and <a href=\"https://en.wikipedia.org/wiki/Prostaglandin_E2\">prostaglandin E2</a>. Prostaglandin has been responsible for fever, inflammation, and pain. The inhibition of prostangladin E2 production reduces inflammatory response and leukocyte adhesion, and thus reduces immune response against bacterial invasion, giving rise to soft-tissue infection.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br />History[<a href=\"https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=15\">edit</a>]<br /><br />In the fifth century BC, <a href=\"https://en.wikipedia.org/wiki/Hippocrates\">Hippocrates</a> described necrotizing soft tissue infection as a disease which was the complication of streptococcal infection where those affected would have \"<a href=\"https://en.wikipedia.org/wiki/Erysipelas\">erysipelas</a> all over the body while the cause was only a trivial accident. Bones, flesh, and sinew (cord, tendon, or nerve) would fall off from the body and there were many deaths\". The first English description for necrotizing soft-tissue infection was by British surgeon Leonard Gillespie and British physicians Gilbert Blaine and <a href=\"https://en.wikipedia.org/wiki/Thomas_Trotter\">Thomas Trotter</a> in the 18th century. At that time, necrotizing soft-tissue infection was known as phagedaenic (gnaw - biting or chewing which gradually make a hole or destroying it) ulcer, phagedena gangrenous, gangrenous ulcer, malignant ulcer, putrid ulcer, or hospital gangrene. Later, \"hospital gangrene\" became more commonly used. In 1871, <a href=\"https://en.wikipedia.org/wiki/Confederate_States_Army\">Confederate States Army</a> surgeon Joseph Jones reported 2,642 cases of hospital gangrene with a mortality rate of 46%. In 1883, Dr <a href=\"https://en.wikipedia.org/wiki/Jean-Alfred_Fournier\">Jean-Alfred Fournier</a> described the necrotizing infection of the <a href=\"https://en.wikipedia.org/wiki/Perineum\">perineum</a> and <a href=\"https://en.wikipedia.org/wiki/Scrotum\">scrotum</a> which termed as <a href=\"https://en.wikipedia.org/wiki/Fournier_gangrene\">Fournier gangrene</a> today. The term \"necrotizing fasciitis\" was first coined by Wilson in 1952. Its definition has become broader, to include not only infection of <a href=\"https://en.wikipedia.org/wiki/Fascia\">fascia</a>, but also other soft-tissue infection.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2\">[2]</a><br />Notable cases[<a href=\"https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=16\">edit</a>]<br />1994 <a href=\"https://en.wikipedia.org/wiki/Lucien_Bouchard\">Lucien Bouchard</a>, former premier of <a href=\"https://en.wikipedia.org/wiki/Qu%C3%A9bec\">Québec</a>, Canada, who was infected while leader of the federal official opposition <a href=\"https://en.wikipedia.org/wiki/Bloc_Qu%C3%A9b%C3%A9cois\">Bloc Québécois</a> party, lost a leg to the illness.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-18\">[18]</a><br />1994 A cluster of cases occurred in Gloucestershire, in the west of England. Of five confirmed and one probable infection, two died. The cases were believed to be connected. The first two had acquired the Streptococcus pyogenes bacteria during surgery; the remaining four were community-acquired.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-19\">[19]</a> The cases generated much newspaper coverage, with lurid headlines such as \"Flesh Eating Bug Ate My Face\".<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-20\">[20]</a><br />1997 <a href=\"https://en.wikipedia.org/wiki/Ken_Kendrick\">Ken Kendrick</a>, former agent and partial owner of the <a href=\"https://en.wikipedia.org/wiki/San_Diego_Padres\">San Diego Padres</a> and <a href=\"https://en.wikipedia.org/wiki/Arizona_Diamondbacks\">Arizona Diamondbacks</a>, contracted the disease. He had seven surgeries in a little more than a week and later fully recovered.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-21\">[21]</a><br />2004 <a href=\"https://en.wikipedia.org/wiki/Eric_Allin_Cornell\">Eric Allin Cornell</a>, winner of the 2001 <a href=\"https://en.wikipedia.org/wiki/Nobel_Prize_in_Physics\">Nobel Prize in Physics</a>, lost his left arm and shoulder to the disease.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-22\">[22]</a><br />2005 <a href=\"https://en.wikipedia.org/wiki/Alexandru_Marin\">Alexandru Marin</a>, an experimental particle physicist, professor at <a href=\"https://en.wikipedia.org/wiki/Massachusetts_Institute_of_Technology\">MIT</a>, <a href=\"https://en.wikipedia.org/wiki/Boston_University\">Boston University</a>, and <a href=\"https://en.wikipedia.org/wiki/Harvard_University\">Harvard University</a>, and researcher at <a href=\"https://en.wikipedia.org/wiki/CERN\">CERN</a> and <a href=\"https://en.wikipedia.org/wiki/Joint_Institute_for_Nuclear_Research\">JINR</a>, died from the disease.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-23\">[23]</a><br />2006 <a href=\"https://en.wikipedia.org/wiki/Alan_Coren\">Alan Coren</a>, British writer and satirist, announced in his Christmas column for <a href=\"https://en.wikipedia.org/wiki/The_Times\">The Times</a> that his long absence as a columnist had been caused by his contracting the disease while on holiday in France.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-24\">[24]</a><br />2009 <a href=\"https://en.wikipedia.org/wiki/R._W._Johnson\">R. W. Johnson</a>, British journalist and historian, contracted the disease in March after injuring his foot while swimming. His leg was amputated above the knee.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-25\">[25]</a><br />2011 <a href=\"https://en.wikipedia.org/wiki/Jeff_Hanneman\">Jeff Hanneman</a>, guitarist for the thrash metal band <a href=\"https://en.wikipedia.org/wiki/Slayer\">Slayer</a>, contracted the disease. He died of liver failure two years later, on May 2, 2013, and his infection was speculated to be the cause of death. However, on May 9, 2013, the official cause of death was announced as alcohol-related <a href=\"https://en.wikipedia.org/wiki/Cirrhosis\">cirrhosis</a>. Hanneman and his family had apparently been unaware of the extent of the condition until shortly before his death.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-CauseOfDeath-26\">[26]</a><br />2011 <a href=\"https://en.wikipedia.org/wiki/Peter_Watts_(author)\">Peter Watts</a>, Canadian science-fiction author, contracted the disease. On his blog, Watts reported, \"I’m told I was a few hours away from being dead...If there was ever a disease fit for a science-fiction writer, flesh-eating disease has got to be it. This...spread across my leg as fast as a <a href=\"https://en.wikipedia.org/wiki/Star_Trek\">Star Trek</a> space disease in time-lapse.\"<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-27\">[27]</a><br />2014 <a href=\"https://en.wikipedia.org/wiki/Daniel_Gildenl%C3%B6w\">Daniel Gildenlöw</a>, Swedish singer and songwriter for the band <a href=\"https://en.wikipedia.org/wiki/Pain_of_Salvation\">Pain of Salvation</a>, spent several months in a hospital after being diagnosed with necrotizing fasciitis on his back in early 2014. After recovering, he wrote the album In the Passing Light of Day,<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-28\">[28]</a> a concept album about his experience during the hospitalization.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-29\">[29]</a><br />2015 <a href=\"https://en.wikipedia.org/wiki/Edgar_Savisaar\">Edgar Savisaar</a>, Estonian politician, had his right leg was amputated. He got the disease during a trip to <a href=\"https://en.wikipedia.org/wiki/Thailand\">Thailand</a>.<a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-30\">[30]</a><br />See also</div><blockquote class=\"embedly-card\"><h4><a href=\"https://en.wikipedia.org/wiki/Necrotizing_fasciitis\">Necrotizing fasciitis - Wikipedia</a></h4>Necrotizing fasciitis may be prevented with proper wound care and handwashing. It is usually treated with surgery to remove the infected tissue and intravenous antibiotics. Often, a combination of antibiotics is used, such as penicillin G, clindamycin, vancomycin, and gentamicin. Delays in surgery are associated with a higher risk of death.</blockquote><script async=\"\" charset=\"UTF-8\" src=\"//cdn.embedly.com/widgets/platform.js\"></script>","tags":["Health and Fitness"],"publishedDate":"2018-06-02T20:32:12Z","harvestDate":"2018-06-02T21:51:15Z","estimatedPublishedDate":"2018-06-02T20:32:12Z","url":"http://ct.moreover.com/?a=34207220583&p=1u0&v=1&x=f3nTIAn8iefaT8SPpi2CSQ","originalUrl":"http://nangalama.blogspot.com/2018/06/health-necrotizing-fasciitis-from.html","commentsUrl":"http://nangalama.blogspot.com/2018/06/health-necrotizing-fasciitis-from.html#comment-form","outboundUrls":["https://en.wikipedia.org/wiki/File:Necrotizing_fasciitis_left_leg.JPEG","https://en.wikipedia.org/wiki/Necrosis","https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-1","https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Hak2014-2","https://en.wikipedia.org/wiki/Help:IPA/English","https://en.wikipedia.org/wiki/Specialty_(medicine)","https://en.wikipedia.org/wiki/Infectious_disease_(medical_specialty)","https://en.wikipedia.org/wiki/Pain_out_of_proportion","https://en.wikipedia.org/wiki/Fever","https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-CDC2016-3","https://en.wikipedia.org/wiki/Bacteria","https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Paz2014-4","https://en.wikipedia.org/wiki/Risk_factor","https://en.wikipedia.org/wiki/Immunodeficiency","https://en.wikipedia.org/wiki/Diabetes","https://en.wikipedia.org/wiki/Cancer","https://en.wikipedia.org/wiki/Obesity","https://en.wikipedia.org/wiki/Alcoholism","https://en.wikipedia.org/wiki/Intravenous_drug_use","https://en.wikipedia.org/wiki/Peripheral_vascular_disease","https://en.wikipedia.org/wiki/Diagnostic_method","https://en.wikipedia.org/wiki/Medical_imaging","https://en.wikipedia.org/wiki/Wound_care","https://en.wikipedia.org/wiki/Handwashing","https://en.wikipedia.org/wiki/Debridement","https://en.wikipedia.org/wiki/Antibiotic","https://en.wikipedia.org/wiki/Infection","https://en.wikipedia.org/wiki/Soft_tissue","https://en.wikipedia.org/wiki/Limb_(anatomy)","https://en.wikipedia.org/wiki/Perineum","https://en.wikipedia.org/wiki/Burn","https://en.wikipedia.org/wiki/Methicillin-resistant_Staphylococcus_aureus","https://en.wikipedia.org/wiki/Penicillin_G","https://en.wikipedia.org/wiki/Clindamycin","https://en.wikipedia.org/wiki/Vancomycin","https://en.wikipedia.org/wiki/Gentamicin","https://en.wikipedia.org/wiki/Hippocrates","https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-5","https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=1","https://en.wikipedia.org/wiki/File:Beginning_of_Necrotizing_Fasciitis_01.jpg","https://en.wikipedia.org/wiki/Cellulitis","https://en.wikipedia.org/wiki/Abscess","https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-Trent_2002-6","https://en.wikipedia.org/wiki/Bulla_(dermatology)","https://en.wikipedia.org/wiki/Ecchymosis","https://en.wikipedia.org/wiki/Thrombosis","https://en.wikipedia.org/wiki/Shock_(circulatory)","https://en.wikipedia.org/wiki/Fournier_gangrene","https://en.wikipedia.org/wiki/Corticosteroid","https://en.wikipedia.org/wiki/Radiotherapy","https://en.wikipedia.org/wiki/Chemotherapy","https://en.wikipedia.org/wiki/HIV/AIDS","https://en.wikipedia.org/wiki/Bone_marrow","https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=2","https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=3","https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-7","https://en.wikipedia.org/wiki/Genital","https://en.wikipedia.org/wiki/Fistula","https://en.wikipedia.org/wiki/Urinary_tract_infection","https://en.wikipedia.org/wiki/Bartholin_gland","https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=4","https://en.wikipedia.org/wiki/Gram-positive","https://en.wikipedia.org/wiki/Staphylococcus_aureus","https://en.wikipedia.org/wiki/Streptococcus_pyogenes","https://en.wikipedia.org/wiki/Enterococci","https://en.wikipedia.org/wiki/Gram-negative","https://en.wikipedia.org/wiki/Escherichia_coli","https://en.wikipedia.org/wiki/Pseudomonas_aeruginosa","https://en.wikipedia.org/wiki/Bacteroides","https://en.wikipedia.org/wiki/Clostridium","https://en.wikipedia.org/wiki/Clostridium_perfringens","https://en.wikipedia.org/wiki/Gas_gangrene","https://en.wikipedia.org/wiki/Clostridium_septicum","https://en.wikipedia.org/wiki/Clostridium_sordellii","https://en.wikipedia.org/wiki/Leukocyte_extravasation","https://en.wikipedia.org/wiki/Phagocyte","https://en.wikipedia.org/wiki/Haemolysis","https://en.wikipedia.org/wiki/Heroin","https://en.wikipedia.org/wiki/Serous_fluid","https://en.wikipedia.org/wiki/Group_A_streptococcal_infection","https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-SaraniStrong2009-8","https://en.wikipedia.org/wiki/Toxic_shock_syndrome","https://en.wikipedia.org/wiki/M_protein_(Streptococcus)","https://en.wikipedia.org/wiki/Superantigen","https://en.wikipedia.org/wiki/Vibrio_vulnificus","https://en.wikipedia.org/wiki/Seawater","https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=5","https://en.wikipedia.org/wiki/File:Pnecrotisingfasc.png","https://upload.wikimedia.org/wikipedia/commons/2/2a/UOTW_58_-_Ultrasound_of_the_Week_1.webm","https://en.wikipedia.org/wiki/File:UOTW_58_-_Ultrasound_of_the_Week_1.webm","https://en.wikipedia.org/wiki/Necrotizing_fasciitis#cite_note-9","https://en.wikipedia.org/wiki/File:Necrotizing_fasciitis_-_intermed_mag.jpg","https://en.wikipedia.org/wiki/Micrograph","https://en.wikipedia.org/wiki/Fascia","https://en.wikipedia.org/wiki/H%26E_stain","https://en.wikipedia.org/w/index.php?title=Necrotizing_fasciitis&action=edit&section=6","https://en.wikipedia.org/wiki/Subcutaneous_tissue","https://en.wikipedia.org/wiki/Computed_tomography","https://en.wikipedia.org/wiki/Magnetic_resonance_imaging","https://en.wikipedia.org/wiki/Contrast_medium"],"wordCount":"3601","dataFormat":"text","duplicateGroupId":"34207220583","media":{"audio":[],"images":[{"url":"https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Knee_Disarticulation_Amputation.jpg/90px-Knee_Disarticulation_Amputation.jpg"},{"url":"https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/UOTW_58_-_Ultrasound_of_the_Week_1.webm/220px--UOTW_58_-_Ultrasound_of_the_Week_1.webm.jpg"},{"url":"https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Beginning_of_Necrotizing_Fasciitis_01.jpg/220px-Beginning_of_Necrotizing_Fasciitis_01.jpg"},{"url":"https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Necrotizing_fasciitis_left_leg_debridement.JPEG/120px-Necrotizing_fasciitis_left_leg_debridement.JPEG"},{"url":"https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Post_surgical_debridement_and_skin_grafting..jpg/90px-Post_surgical_debridement_and_skin_grafting..jpg"},{"url":"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Necrotizing_fasciitis_left_leg.JPEG/300px-Necrotizing_fasciitis_left_leg.JPEG"},{"url":"https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Pnecrotisingfasc.png/220px-Pnecrotisingfasc.png"},{"url":"https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Necrotizing_fasciitis_-_intermed_mag.jpg/220px-Necrotizing_fasciitis_-_intermed_mag.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Cyberculture news","group":"Internet"},{"name":"Web 2.0 news","group":"Internet"},{"name":"Online content news","group":"Internet"}],"companies":[{"name":"Medical Imaging Corp","symbol":"MEDD","exchange":"PINX","isin":"US58458L1089","titleCount":0,"contentCount":3,"primary":true},{"name":"Medical Imaging Corp","symbol":"6637","exchange":"ROCO","isin":"TW0006637002","titleCount":0,"contentCount":3,"primary":true}],"author":{"name":"Martha Leah Nangalama","publishingPlatform":{}},"licenses":[],"source":{"name":"Martha Leah Nangalama","homeUrl":"http://nangalama.blogspot.com/","location":{"country":"South Africa","countryCode":"ZA","region":"Africa","subregion":"Southern Africa"},"feed":{"id":"620031664","name":"Martha Leah Nangalama","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","tags":["IFTTT","Twitter","Uganda","World News","YouTube","Politics","Business","Videos","Education","Museveni","Crime","Kenya","NRM Thugs","Entertainment","Library of Congress","South Sudan","DR Congo","Rwanda","Facebook","Tanzania","Health and Fitness","Human Rights","Opinion","News","Trump","Africa","Sports","Corr"],"language":"English","dataFormat":"text","rank":{"autoRank":"6","autoRankOrder":"65826","inboundLinkCount":"4"},"inWhiteList":"true","autoTopics":[]}},"es_id":86993771}