{"sequenceId":"845363905825","id":"34207167610","language":"English","title":"After Janus, should unions abandon exclusive representation?","content":"Getty/Phillip Nelson    This article originally appeared in In These Times     The Supreme Court is set to issue a ruling on Janus v. AFSCME, which could have far-reaching consequences for the future of public-sector unions in the United States. The case has sparked a wide-ranging debate within the labor movement about how to deal with the “free-rider problem” of union members who benefit from collective bargaining agreements but opt-out of paying dues. We asked three labor experts to discuss what’s at stake in the case and how they each think unions should respond.    Kate Bronfenbrenner is director of labor education research at Cornell University, Chris Brooks is a staff writer and organizer with Labor Notes and Shaun Richman is a former organizing director at the American Federation of Teachers.    Chris Brooks: The way I see it, right-to-work presents two interlocking problems for unions . The first is that unions are legally required to represent all workers in a bargaining unit that the union has been certified to represent, and in open shops the Duty of Fair Representation (DFR) requires unions to expend resources on non-members who are covered by that contract. This is commonly known as the free rider problem and it gets a lot of attention, for good reason.    The second problem is that open shops also undermine solidarity by pitting workers who pay their fair share to support the union against those who do not. This is the divide-and-conquer problem.    So the free rider problem is institutional: the union has to expend all these resources fighting on behalf of workers who are not members and do not pay dues. And the divide-and-conquer problem is interpersonal: when workers do not all support the union this results in union and non-union members developing adversarial attitudes toward each other which undermines the ability for collective action.    If you believe that the source of a union’s strength is its ability to unite workers in common fights to better their conditions on the job and in the community, then the divide-and-conquer problem is a real impediment to union power. Yet, the free rider problem gets far more attention from union leaders and activists than the divide-and-conquer problem. This is especially true in the discussion around whether unions should ditch exclusive representation and pursue a members-only form of unionism.    In my opinion, most arguments in support of kicking out free riders actually reinforces the employers' logic — turning union membership into a personal choice and unions themselves into competing vehicles for individualized services rather than vehicles for broad class struggle. So by focusing on the free rider problem to the exclusion of the divide-and-conquer problem, unions run the danger of turning inward and representing a smaller and smaller number of workers rather than seeking to constantly expand their base in larger fights on behalf of all workers in an industry.    Shaun Richman : I had an article published in The Washington Post and I admit it was too cute by half partly because I was trying to amplify what I think was actually the strongest argument that AFSCME is making in the case itself, which is that the agency fee has historically been traded for the no strike clause and if you strike that there is the potential for quite a bit of chaos . So I wanted to put a little bit of fear to whoever might potentially have the ear of Chief Justice Roberts, as crazy as that may sound. But I also wanted to plant the seed of thinking for a few union rebels out there. If the Janus decision comes down as many of us fear then the proper response is to create chaos.    If the entire public sector goes right to work, unions will never look the same. So, then, the project of the left should be “what do we want them to look like?” and “what will drive the bosses craziest?” I've written about this before and Chris has responded  at In These Times. There are three things that I am suggesting will happen — two of which, and I think Chris agrees, are sort of inevitable and not particularly desirable. The third part is not inevitable and depends a lot on what we do as activists.    If we lose the agency fee, some unions will seek to go members-only in order to avoid the free rider problem, and that's a lousy motivation. I'm not encouraging that, but I think it's also inevitable. Once you have unions representing these workers over here but not those workers over there, it's also inevitable that you wind up with competitor unions vying for the unrepresented . And the first competitor unions are going to be conservative. These already exist. They're all over the South and they compete against the American Federation of Teachers (AFT) and National Education Association (NEA) in many districts and they offer bare bones benefits and they promote themselves on “we're not going to support candidates who are in favor of abortions and we'll represent you if you have tenure issues.” That's also bad but also inevitable.    The third step, which is not inevitable but we need to consider in this moment, is at what point do new opposition groups break away from the existing formal union?  When do we just break the exclusive model and compete for members and workplace leadership? Can we get to a point where on the shop floor level you've got organizations vying for workers' dues money and loyalty based on who can take on the boss in a better fight or who can win a better deal on the basis of we're going to be less confrontational (which, I think, there are a lot of workers whom that appeals to as much as I don't like that idea)? But the chaos of the employer not being able to make one deal with one union that settles everything for three or five years — that's just the sort of chaos that the boss class deserves for having pursued this whole Friedrichs and now Janus strategy.    Kate Bronfenbrenner : I have a different perspective that has to do with having looked at this issue over a longer period of time and also having witnessed the UK labor movement wrestle with exclusive representation when their labor law changed. First, I believe there is a third thing that right to work does that is missing from your analysis. Right to work gives employers another point to intimidate, coerce, and threaten employees about being part of the union, all of which employers find much more difficult to do in a union or an agency shop.    My research suggests that employers will act the same way now they do in the process of workers becoming members as they do during an organizing drive . The historical trade-off for unions was that the price of exclusive representation was Duty of Fair Representation (DFR) and unions saw DFR as a burden.    Those of us who were progressives saw that Duty of Fair Representation was the best thing that ever happened to unions because DFR said that unions had to represent women, people of color, the LGBT community, and you couldn't discriminate against part time versus full time. Historically it was used to force the old guard had to give up domination of unions and to fight for for union democracy because the simplest basis of DFR is the concept of good faith. If used effectively it would be the thing that could break the hold of the mob, or the old guard, or just white men. So you have to remember when you give up exclusive representation you could lose DFR. I can tell you that women and people of color are not going to want to give it up. And I think the fact that the two of you didn't think of that is probably because you have not been using that in your roles, but it is central to those who are fighting if you are dealing with members who are fighting discrimination in your union, the whole DFR exclusive representation is absolutely critical.    Brooks : Kate, am I wrong that the actual court case establishing the DFR in exclusive representation comes out of the Railway Act, where a local was refusing to represent Black workers?    Bronfenbrenner : Historically, but it kept being reinforced over and over again in cases involving most collective bargaining laws. It's been reinforced over and over again that the trade-off for exclusive representation that the DFR is tied with exclusive representation.    Richman : Yeah, it was the entire thrust of the NAACP workplace strategy before the 1960’s—that the labor law could be a civil rights act as long as we could win DFR. Herbert Hill wrote a great book about it (\" Black Labor and the American Legal System \"). I would also recommend Sophia Z. Lee's \" The Workplace Constitution ,\" which explores that history and makes a compelling argument for returning to a strategy of trying to establish constitutional rights in the workplace through the labor act.    Bronfenbrenner : Right. So union workers had protection for LGBTQ workers under DFR long before any other workers did because you could not discriminate on the basis of any class under duty of fair representation. Now whether workers knew that, whether their unions would represent them, is another matter but if you were a union worker or a worker who knew about it, this was where you fought it. So that was very important.    And the third thing that I wanted to say that related to this was that there is a long history in the public sector of independent unions, of company unions, acting as if exclusive representation didn't exist, where there would only be one member and employers would recognize the “union” establishing a contract bar so no other union could come in.    In the 1980s and 1990s, public sector unions assumed that they were winning decertification elections rather than the independent unions and discovered that they weren't. Soon enough they realized that the problem was that they weren't doing a good enough job of representing their members. Workers were not voting for the company unions, which were little more than law firms or insurance companies. They were voting against the poor representation.    The prevalence of these independents is a long running problem that existed before and after exclusive representation, and it exists when there are agency fees and when there are not. Poor enforcement by the NLRB and the difficulty of tracking down these front groups that are not really unions is a much bigger issue that comes out of a divided public sector, and exclusive representation has nothing to do with it.    Brooks: I think right-wing groups are trying to capitalize on the history of company unions and fragmentation in the public sector. The State Policy Network (SPN) has a nationally coordinated strategy that builds on right-to-work laws to further bust unions. One of the tactics their member organizations, which exist in all fifty states, are pursuing is so-called “workers' choice” legislation. This legislation allows unions to maintain a limited form of exclusivity, but with no duty of fair representation. Unions must still win a certification election to be the sole organization bargaining with the employer, but workers can opt out of the union and seek their own private contract with the boss outside of the collective bargaining agreement.    Requiring a certification election for collective bargaining also saves employers from having a situation where multiple unions can simultaneously pursue separate bargaining agreements for the same group of workers, a legal can of worms that corporations don’t want to open. SPN affiliates tout this legislation as a solution to the free rider problem for unions, since they have no duty to represent non-members, but it also incentivizes employers to bribe and cajole individual workers away from the union.    Employers could offer bonuses to workers if they drop union membership and call it “merit pay.” I don’t think that corporate advocacy groups like the SPN would be promoting this legislation unless they believed it would further weaken unions and fragment the labor movement.    The SPN is also actively organizing these massive opt-out campaigns, where they encourage workers to “give themselves a raise” by dropping union membership. They even have a nationally coordinated week of action called National Employee Freedom Week that eighty organizations participate in. In fact, the SPN think tanks work hand-in-glove with a host of independent education associations — which are basically company unions, purporting to represent teachers while advancing the privatization agenda. In Georgia, Mississippi, Missouri and Texas, these independent education associations claim to be larger than the AFT and NEA affiliates.    So in those places where unions are really strong, there is a high likelihood that we will see an increase in company unions that are working closely with State Policy Network affiliates to further divide workers on the job.    Richman : Chris, what you're describing are things that are mostly going to happen anyway, if we lose Janus. That SPN opt-out campaign is going to happen . The legislation you describe is not inevitable. I agree we dig a hole for ourselves if the only reason we want to “ kick out the scabs ” is so we don't have to represent them in grievances. Because that lays the groundwork for making a union-busting bill seem like a reasonable compromise.    If we lose Janus , unions will never look the same. It's at moments like this when we have to critically evaluate everything. What do we like about unions and our current workers' rights regime? What don't we like and what opportunities has this created for us to at least challenge that?    For me, the opportunity is to think about having multiple competitive unions on the shop floor. I don't think of this as a model that will lead to multiple contracts . It might lead to no contracts. Everything that I've written on this subject so far has been with the assumption that ULP protections against discrimination remain in place so that the boss can't give one group of workers a better deal because they picked one union over another (or no union at all). If a boss makes a deal with any group of workers or imposes new terms because a union got bargained to impasse, everybody gets the same thing.    Under a competitive multiple union model, I think no strike clauses become basically unenforceable. And these no strike clauses have become really deadly for unions in ways we don't want to acknowledge . Currently, the workers who should be the most emboldened at work, because they're protected by a union, have a contract that radically restricts their ability to protest. It's not just strikes. It curtails the ability to do slow down actions, and malicious compliance, and it forces the union rep to have to rush down to the job and tell their members, y ou have to stop doing this . And they end up feeling bitter toward the union leadership as much — if not more — than the boss for the conditions that were agitating them still being in place. And then their \"my union did nothing for me\" stories carry over to non-union shops. Every organizer has heard them.    We need to bring back the strike weapon . And that's far easier said than done. But it's really hard to do when you're severely restricted in your ability for empowered workers to set an example for unorganized workers in taking action and winning.    And, Kate, I have considered the DFR. I can't imagine a world of multiple competitive unions in a workplace where there wouldn't be at least one union that says we're going to be the anti-racist union, we're going to be the feminist union, and we're the union for you . Without DFR, you’re right, there's no legal guarantees. But someone steps into the vacuum and my hope is that at least creates the potential for militancy when militancy is called for in the workplace. With all the other messiness.    There's going to be plenty of yellow unions and the boss is going to bring back employee representation programs and company unions and all of that. But that mess is exactly what they deserve. They've forgotten that exclusive representation is the model that they wanted — we didn’t, necessarily — in the 1940s and 1950s.    Bronfenbrenner : I wouldn't be ready to throw out DFR. I think that there is too little democracy, and too much discrimination in the labor movement. At this time, we already have right to work in most of the public sector and most of the public sector doesn't allow strikes, but workers still strike. We see that workers are willing to strike even if they are not allowed to strike, as evidenced by all these teachers, and we have to remember the strike statistics in this country only report strikes that are over 1,000 workers and most workplaces are under 1,000. We have a lot more strikes than are reported.    The labor movement is not going to strike more just because you get rid of no strike clauses. Teamsters had the ability to strike as the last step of their grievance procedure for decades and they never went on strike. I think what is more important is the question of what is going to change the culture and politics of the labor movement. I don't think changing the right to strike is going to do it.    What is going to make unions actually fight back even on something like fighting on Janus? They're not even getting in the streets on Janus , so what makes you think they're actually going to strike on issues in the workplace? We need to think about why workers and unions are so hesitant to strike. I do not believe that chaos necessarily is going to happen. I think employers are much more prepared for this. I think what will happen is that the unions that have been effective and have been working with their members and educating their members and involving their members will be fighting back and the ones that have been sitting back and not doing anything will continue to sit back and not do anything and some will die.    The problem with getting rid of exclusive representation is that some unions are going to think “aha this is what I'm going to do, this is an easy way out,” the same way people used to think \"oh it's easier to organize in health care, oh it's easier to organize in the public sector, so rather than organize in my industry, which is hard, I'm going to go try health care or the public sector.” But they found that \"why can't I win organizing teachers the same way that AFT does\" or \"why can't I win organizing in health care the same way SEIU is doing\" and they discovered that it's not quite as easy as it looks.    Brooks: Yeah, I think Kate's point is really important: in a right-to-work setting, the employer anti-union campaign never ends. The boss is constantly trying to convince and cajole workers into dropping union membership. And employer anti-union campaigns are really effective, which is why unions don't win them very often.    If the Supreme Court rules against unions in Janus, anti-union campaigns are only going to gain strength. So, my fear, Shaun, is that you are being overly romantic. I just don't think left-wing unions are going to suddenly emerge and step into the void left by business-as-usual unionism. If that was the case, then why hasn't that already happened with the 90 percent of workers that don't have any union at all?    Richman : The structure is a trap, and exclusive representation is part of that. I don't think we have a crisis of leadership. I want to turn to the private sector because most of the potential hope in abandoning exclusive representation is in the private sector. Look at the UAW and their struggles at Volkswagen and at Nissan , which Chris is intimately familiar with. I think all three of us could find fault in their organizing strategy and tactics. Kate, I think you have more grounds than anyone in the country to be frustrated because you've scientifically proven what it takes to win and most unions have ignored that research for decades! But a third of the workers at Nissan want to have a union. To do so, they have to win an exclusive representation election where the entire power structure of the community comes down on their heads arguing keep the UAW out of the South .    If they had eked out an election win and managed to win a contract a year down the line, at the end of the day they get the obligation of having to represent everyone and probably the one-third of the workers who wanted the union all along are the only ones that join. That’s insane. Charles Morris threw out this theory a decade ago, in \" The Blue Eagle at Work ,\" about how the NLRA was not intended to have these winner-take-all exclusive representation elections. The point of the NLRA was merely to say to employers anywhere there's a group of workers that say hey we're a union you must bargain with them in good faith. He argues that pathway is still open to unions. To the best of my knowledge a few unions politely asked the NLRB for their opinion on that a couple of times rather than all of us demanding that should be a valid pathway for union representation.    If you can win that exclusive representation election, you should win it, and you should also be saddled with the burdens of DFR. But why can't, and why shouldn't, the UAW file a petition at every auto factory in the country right now and say we have members here and you need to bargain with us over their working conditions ? And why shouldn't other unions jump into the fray and claim to represent their portion of the workers and drive those non-union companies nuts with a bunch of unions placing demands on them, and organizing to take action?    I think the work that Organization United for Respect (OUR) is doing at Wal-Mart is a good example of that. They by no means have a majority of the workers at Wal-Mart. They are in a few strategic locations. They are a nuisance to the company. They just won a right that workers are allowed to wear union buttons on the shop floor. Wal-Mart has given workers raises in response to their agitation. I'm not suggesting that that model is perfect or what we should all be doing, but I am saying that this should be an avenue open to us. And it only becomes open to us if we're willing to experiment more with abandoning exclusive representation where it doesn't work for us.    I would argue that in 90% of private sector workplaces where winning these elections is not possible it's not working for us currently.    Bronfenbrenner : The comprehensive campaign-organizing model should be part of every organizing effort. Workers are protected under the NLRA when they engage in concerted activity and, as I say in all my organizing research, the union should be acting like a union from the beginning of the campaign. Unions should also be organizing around workplace problems and going to the employer and engaging in actions during the organizing campaign. I've been saying for 30 years that you don't wait to start acting like a union until you win. But there is serious pushback against that element of my model from many organizers.    Unions are very hesitant to start taking on the employer before they win the majority. But there are unions that do that. It's not just OUR. It’s Warehouse Workers United, SEIU 32BJ, RWDSU, Communications Workers, the Teamsters. All have run campaigns where they begin taking on the employer before the union has been recognized or certified. The unions that have been doing comprehensive campaigns are doing it in bargaining and it's being done in organizing by the unions who are winning in organizing. So they're not waiting until they win.    Richman : Thirty or forty years into people getting really serious about organizing as a science and as a craft, the fact that most unions still haven’t embraced an organizing model. . .    Bronfenbrenner : People have been serious about organizing as a craft from the beginning. It's just that no one wrote very good books about what they did. The IWW and the UAW organizers, and the textile organizers, they were organizing using the same strategies that are being done now. No one wrote good books about what they did.    Richman : Sure, that's fair. But the fact that unions are not following an organizing model that’s informed by your research and other unions' best practices suggests it's not a matter of culture but the legal framework that we find ourselves trapped in. Most of the pressure on a union leader is to bring back good contracts for the members you currently represent and keep winning re-election. So that puts more resources into grievance handling and bargaining and it leads to the cost cutting in organizing campaigns.    Bronfenbrenner : I disagree. For the last three decades servicing and education budgets have been cut while huge amounts of the labor movement’s financial and staff resources have been shifted into labor law reform. And I can tell you because I'm part of the debate they don't want to have about what they they need to do to change to organize . But most either think they are doing everything they can, or it is too hard to do anything different. It is the law that is the problem.    Either way the shared understanding is that unions should put resources into politics and in getting labor law reform because trying to do comprehensive organizing campaigns we’re asking them to do is “too difficult.” But they're not putting resources into grievance handling anymore. They are putting it into politics and  labor law reform.    Richman : The approach to labor law reform has been too much about trying to preserve the system. The opportunity of the moment is to think beyond the boundaries of the workplace. Enterprise level bargaining has been killing us since the 1970s . As long as union membership is tied to whether or not some group of workers voted to form a union sometime in the past within the four walls of your workplace, that just incentivizes the offshoring and contracting out that's really what has decimated the labor movement.    Humpty Dumpty is sitting on the wall and if Neil Gorsuch and John Roberts kick him off I am not particularly interested in being one of the king's horses and men trying to put him together again. At that point the system is fundamentally broken and we need new demands about what kind of system we want and new strategies about how we exploit the brokenness of the system to make them regret what they have done.    Exclusive representation — combined with agency fee and DFR — worked for a long time. But if you knock one piece out, it all falls apart. We shouldn't be pining for bygone days. We need to be thinking forward about what opportunities this creates. I hope that some people get inspired to try something as crazy as the IWW saying fuck it, we're going to organize in different workplaces and agitate for work slowdowns and try to gain a few members in a few places we don't care about expenditures of resources and dues. We're going to create some chaos.    Brooks: I share Kate's concerns, I believe that many unions have devolved into highly legalistic organizations. So the solutions they are pursuing to our current problems are highly technical and legal in nature, which means that lobbying and electing Democrats often becomes their top priority. Laws are important, but unions should spend far more time and resources on organizing comprehensive campaigns that build support among large majorities of workers, winning them over to a plan for collective action that can change conditions on the job and in the community.    Instead of this kind of organizing, what we've seen over the past few decades is the increasing confinement of class struggle to smaller and smaller segments of workers. Few unions these days aim to represent all workers in an industry. How many unions are engaged in pattern bargaining and setting contract standards across an industry or openly organizing toward a master agreement? To your point, Shaun, unions have become limited to firm-level representation. Or even just a bargaining unit within a firm, since many do not even try to organize everyone who works for the same employer.    Members-only unionism just continues this trend as unions move to represent an even smaller fraction of workers, not as a stepping stone to building a majority, but as a strategy to get out of providing services to workers who don’t pay dues. Ultimately, I believe this is a capitulation to the employers’ right-to-work framework and a retreat from the kind of broad-based organizing that the labor left has been historically committed to.    Bronfenbrenner :  We can no longer talk about the workplace solely through a U.S. framework. Ownership structures are so large, diffuse, and complex that what we should be doing is organizing and bargaining and building relationships between workers across the entire corporation world-wide , company-wide, and industry-wide. That requires getting workers to understand that they need to build power to take on whomever the decision-makers in the company are. It is not the boss that they see once a year at the annual holiday party. It is whoever has the money and really makes the decisions in the ultimate parent company. And that requires building alliances locally, nationally, and internationally, and building a much broader labor movement.    It also means understanding that the person who doesn't pay union dues in their shop is not the problem. The problem for workers is that now what they have is the chamber of commerce fighting against their right to bargain and the state at all levels is interfering with economic and union rights. Their boss is now some investor somewhere who has decided to buy and sell their company and their jobs who does not care what they make or whether they stay open or not.    You have to figure out what they care about because that is what gives unions  leverage. That's why workers in America have to get to know workers in Mexico and workers in Europe, those kinds of relationships, that is what the labor movement needs to spend their energy on. That's what I'm going to spend my energy on. The U.S. labor movement cannot afford to be picking petty fights between workers who are paying dues and workers who aren't paying dues because they need each other.    Richman: The structure is a trap partly by forcing unions to focus on individual bargaining units, individual workplaces and somehow winning them one-by-one. What we should be doing is not retreating from our bargaining units, but claiming to represent the willing workers in every company in every industry. I'm trying to inspire anyone who is out there reading this to think about an opportunity to spread out wider — in a much more bare bones, scrappier way — but one that puts the union idea in many more workplaces. To get the word out now, rather than we'll get to you after we somehow win Nissan or Volkswagen . Because that's not working.    Bronfenbrenner : But you're not going to get labor law changed unless you have power.  It takes political power to get labor law changed. You can't get political power until you organize a lot. You're asking for a labor law change. The point is that focusing on labor law is backwards. We only get labor law reform after we do a great deal of organizing. First you have to organize and build power.    During the whole Employee Free Choice Act (EFCA) fight everyone stopped organizing and spent all their energy on EFCA. That's the danger of labor law reform.    Top Trending  Check out the major news stories of the day","contentWithMarkup":"<body> <p>\n                        <img width=\"620\"\n                            height=\"412\"\n                            src=\"https://media.salon.com/2018/03/supreme-court-620x412.jpg\"\n                            alt=\"Getty/Phillip Nelson\" />\n                        <p><em>Getty/Phillip Nelson</em></p>\n                    </p> This article originally appeared in <a href=\"http://www.inthesetimes.com/\" target=\"_blank\">In These Times</a></br>\n\n<a href=\"http://http://inthesetimes.com\"><img class=\"\" style=\"margin: 0 10px 0 0;\" src=\"https://media.salon.com/2018/01/17ITTLogo_SQ.jpg\" alt=\"InTheseTimes\" width=\"152\" height=\"152\" align=\"left\" /></a> <p>The Supreme Court is set to issue a ruling on Janus v. AFSCME, which could have far-reaching consequences for the future of public-sector unions in the United States. The case has sparked a wide-ranging debate within the labor movement about how to deal with the “free-rider problem” of union members who benefit from collective bargaining agreements but opt-out of paying dues. We asked three labor experts to discuss what’s at stake in the case and how they each think unions should respond.</p> <p>Kate Bronfenbrenner is director of labor education research at Cornell University, Chris Brooks is a staff writer and organizer with Labor Notes and Shaun Richman is a former organizing director at the American Federation of Teachers.</p> <p><strong>Chris Brooks:</strong> The way I see it, right-to-work presents <a href=\"http://newlaborforum.cuny.edu/2017/08/24/the-cure-worse-than-the-disease/\" target=\"_blank\">two interlocking problems for unions</a>. The first is that unions are legally required to represent all workers in a bargaining unit that the union has been certified to represent, and in open shops the Duty of Fair Representation (DFR) requires unions to expend resources on non-members who are covered by that contract. This is commonly known as the <a href=\"https://onlabor.org/janus-amicus-economists-law-professors/\" target=\"_blank\">free rider problem</a> and it gets a lot of attention, for good reason.</p> <p>The second problem is that open shops also undermine solidarity by pitting workers who pay their fair share to support the union against those who do not. This is the divide-and-conquer problem.</p> <p>So the free rider problem is institutional: the union has to expend all these resources fighting on behalf of workers who are not members and do not pay dues. And the divide-and-conquer problem is interpersonal: when workers do not all support the union this results in union and non-union members developing adversarial attitudes toward each other which undermines the ability for collective action.</p> <p>If you believe that the source of a union’s strength is its ability to unite workers in common fights to better their conditions on the job and in the community, then the divide-and-conquer problem is a real impediment to union power. Yet, the free rider problem gets far more attention from union leaders and activists than the divide-and-conquer problem. This is especially true in the discussion around whether unions should ditch exclusive representation and pursue a members-only form of unionism.</p> <p>In my opinion, most arguments in support of kicking out free riders actually reinforces the employers' logic — turning union membership into a personal choice and unions themselves into competing vehicles for individualized services rather than vehicles for broad class struggle. So by focusing on the free rider problem to the exclusion of the divide-and-conquer problem, unions run the danger of turning inward and representing a smaller and smaller number of workers rather than seeking to constantly expand their base in larger fights on behalf of all workers in an industry.</p> <p><strong>Shaun Richman</strong>: I had an article published in <a href=\"https://www.washingtonpost.com/news/posteverything/wp/2018/03/01/if-the-supreme-court-rules-against-unions-conservatives-wont-like-what-happens-next/?utm_term=.dbc5d3b4c1f6\" target=\"_blank\">The Washington Post</a> and I admit it was too cute by half partly because I was trying to amplify what I think was actually the strongest argument that AFSCME is making in the case itself, which is that the agency fee has historically been traded for the no strike clause and if you strike that there is the potential for <a href=\"https://theintercept.com/2018/02/25/conservatives-public-sector-unions-janus/\" target=\"_blank\">quite a bit of chaos</a>. So I wanted to put a little bit of fear to whoever might potentially have the ear of Chief Justice Roberts, as crazy as that may sound. But I also wanted to plant the seed of thinking for a few union rebels out there. If the Janus decision comes down as many of us fear then the proper response is to create chaos.</p> <p>If the entire public sector goes right to work, unions will never look the same. So, then, the project of the left should be “what do we want them to look like?” and “what will drive the bosses craziest?” I've <a href=\"http://inthesetimes.com/working/entry/19075/the_legal_argument_that_could_overturn_right_to_work_laws_around_the_countr\" target=\"_blank\">written about this</a> before and <a href=\"http://inthesetimes.com/working/entry/20791/members-only-union-labor-right-to-work\" target=\"_blank\">Chris has responded</a> at In These Times. There are three things that I am suggesting will happen — two of which, and I think Chris agrees, are sort of inevitable and not particularly desirable. The third part is <em>not</em> inevitable and depends a lot on what we do as activists.</p> <p>If we lose the agency fee, some unions will seek to go members-only in order to avoid the free rider problem, and that's a lousy motivation. I'm not encouraging that, but I think it's also inevitable. Once you have unions representing <em>these</em> workers over here but not <em>those</em> workers over there, it's also <a href=\"http://inthesetimes.com/working/entry/18562/members-only-minority-unions\" target=\"_blank\">inevitable that you wind up with competitor unions vying for the unrepresented</a>. And the first competitor unions are going to be conservative. These already exist. They're all over the South and they compete against the American Federation of Teachers (AFT) and National Education Association (NEA) in many districts and they offer bare bones benefits and they promote themselves on “we're not going to support candidates who are in favor of abortions and we'll represent you if you have tenure issues.” That's <a href=\"http://newlaborforum.cuny.edu/2017/08/24/the-cure-worse-than-the-disease/\" target=\"_blank\">also bad</a> but also inevitable.</p> <p>The third step, which is not inevitable but we need to consider in this moment, is at what point do new opposition groups break away from the existing formal union?  When do we just break the exclusive model and compete for members and workplace leadership? Can we get to a point where on the shop floor level you've got organizations vying for workers' dues money and loyalty based on who can take on the boss in a better fight or who can win a better deal on the basis of <em>we're going to be less confrontational</em> (which, I think, there are a lot of workers whom that appeals to as much as I don't like that idea)? But the chaos of the employer not being able to make one deal with one union that settles everything for three or five years — that's just the sort of chaos that the boss class deserves for having pursued this whole Friedrichs and now Janus strategy.</p> <p><strong>Kate Bronfenbrenner</strong>: I have a different perspective that has to do with having looked at this issue over a longer period of time and also having witnessed the UK labor movement wrestle with exclusive representation when their labor law changed. First, I believe there is a third thing that right to work does that is missing from your analysis. Right to work gives employers another point to intimidate, coerce, and threaten employees about being part of the union, all of which employers find much more difficult to do in a union or an agency shop.</p> <p>My research suggests that employers will act the same way now they do in the process of workers becoming members as they <a href=\"https://www.epi.org/publication/bp235/\" target=\"_blank\">do during an organizing drive</a>. The historical trade-off for unions was that the price of exclusive representation was Duty of Fair Representation (DFR) and unions saw DFR as a burden.</p> <p>Those of us who were progressives saw that Duty of Fair Representation was the best thing that ever happened to unions because DFR said that unions had to represent women, people of color, the LGBT community, and you couldn't discriminate against part time versus full time. Historically it was used to force the old guard had to give up domination of unions and to fight for for union democracy because the simplest basis of DFR is the concept of good faith. If used effectively it would be the thing that could break the hold of the mob, or the old guard, or just white men. So you have to remember when you give up exclusive representation you could lose DFR. I can tell you that women and people of color are not going to want to give it up. And I think the fact that the two of you didn't think of that is probably because you have not been using that in your roles, but it is central to those who are fighting if you are dealing with members who are fighting discrimination in your union, the whole DFR exclusive representation is absolutely critical.</p> <p><strong>Brooks</strong>: Kate, am I wrong that the <a href=\"https://www.law.cornell.edu/supremecourt/text/323/192\" target=\"_blank\">actual court case</a> establishing the DFR in exclusive representation comes out of the Railway Act, where a local was refusing to represent Black workers?</p> <p><strong>Bronfenbrenner</strong>: Historically, but it kept being reinforced over and over again in cases involving most collective bargaining laws. It's been reinforced over and over again that the trade-off for exclusive representation that the DFR is tied with exclusive representation.</p> <p><strong>Richman</strong>: Yeah, it was the entire thrust of the NAACP workplace strategy before the 1960’s—that the labor law could be a civil rights act as long as we could win DFR. <a href=\"https://en.wikipedia.org/wiki/Herbert_Hill_(labor_director)\" target=\"_blank\">Herbert Hill</a> wrote a great book about it (\"<a href=\"https://uwpress.wisc.edu/books/1288.htm\" target=\"_blank\">Black Labor and the American Legal System</a>\"). I would also recommend Sophia Z. Lee's \"<a href=\"https://scholarship.law.upenn.edu/cgi/viewcontent.cgi?article=2503&context=faculty_scholarship\" target=\"_blank\">The Workplace Constitution</a>,\" which explores that history and makes a compelling argument for returning to a strategy of trying to establish constitutional rights in the workplace through the labor act.</p> <p><strong>Bronfenbrenner</strong>: Right. So union workers had protection for LGBTQ workers under DFR long before any other workers did because you could not discriminate on the basis of any class under duty of fair representation. Now whether workers knew that, whether their unions would represent them, is another matter but if you were a union worker or a worker who knew about it, this was where you fought it. So that was very important.</p> <p>And the third thing that I wanted to say that related to this was that there is a long history in the public sector of independent unions, of company unions, acting as if exclusive representation didn't exist, where there would only be one member and employers would recognize the “union” establishing a contract bar so no other union could come in.</p> <p>In the 1980s and 1990s, public sector unions assumed that they were winning decertification elections rather than the independent unions and discovered that they weren't. Soon enough they realized that the problem was that they weren't doing a good enough job of representing their members. Workers were not voting <em>for</em> the company unions, which were little more than law firms or insurance companies. They were voting <em>against</em> the poor representation.</p> <p>The prevalence of these independents is a long running problem that existed before and after exclusive representation, and it exists when there are agency fees and when there are not. Poor enforcement by the NLRB and the difficulty of tracking down these front groups that are not really unions is a much bigger issue that comes out of a divided public sector, and exclusive representation has nothing to do with it.</p> <p><strong>Brooks: </strong>I think right-wing groups are trying to capitalize on the history of company unions and fragmentation in the public sector. The State Policy Network (SPN) has a <a href=\"http://www.documentcloud.org/documents/3984714-Spntoolkit.html#document/p1\" target=\"_blank\">nationally coordinated strategy</a> that builds on right-to-work laws to further bust unions. One of the tactics their member organizations, which exist in all fifty states, are pursuing is so-called <a href=\"https://www.mackinac.org/22762\" target=\"_blank\">“workers' choice”</a> legislation. This legislation allows unions to maintain a limited form of exclusivity, but with no duty of fair representation. Unions must still win a certification election to be the sole organization bargaining with the employer, but workers can opt out of the union and seek their own private contract with the boss outside of the collective bargaining agreement.</p> <p>Requiring a certification election for collective bargaining also saves employers from having a situation where multiple unions can simultaneously pursue separate bargaining agreements for the same group of workers, a legal can of worms that corporations don’t want to open. SPN affiliates tout this legislation as a solution to the free rider problem for unions, since they have no duty to represent non-members, but it also incentivizes employers to bribe and cajole individual workers away from the union.</p> <p>Employers could offer bonuses to workers if they drop union membership and call it “merit pay.” I don’t think that corporate advocacy groups like the SPN would be promoting this legislation unless they believed it would further weaken unions and fragment the labor movement.</p> <p>The SPN is also actively organizing these massive opt-out campaigns, where they encourage workers to “give themselves a raise” by dropping union membership. They even have a nationally coordinated week of action called <a href=\"http://employeefreedomweek.com/\" target=\"_blank\">National Employee Freedom Week</a> that eighty organizations participate in. In fact, the SPN think tanks work hand-in-glove with a host of independent education associations — which are basically company unions, purporting to represent teachers while advancing the privatization agenda. In Georgia, Mississippi, Missouri and Texas, these independent education associations claim to be larger than the AFT and NEA affiliates.</p> <p>So in those places where unions are really strong, there is a high likelihood that we will see an increase in company unions that are working closely with State Policy Network affiliates to further divide workers on the job.</p> <p><strong>Richman</strong>: Chris, what you're describing are things that are mostly going to happen anyway, if we lose Janus. That SPN opt-out campaign is <a href=\"http://inthesetimes.com/working/entry/20525/right-wing-plot-unions-labor-ALEC\" target=\"_blank\"><em>going</em></a><a href=\"http://inthesetimes.com/working/entry/20525/right-wing-plot-unions-labor-ALEC\" target=\"_blank\"> to happen</a>. The legislation you describe is <em>not</em> inevitable. I agree we dig a hole for ourselves if the only reason we want to “<a href=\"http://inthesetimes.com/working/entry/18682/friedrichs-v-california-teachers-association-scotus-heather-whitney\" target=\"_blank\">kick out the scabs</a>” is so we don't have to represent them in grievances. Because that lays the groundwork for making a union-busting bill seem like a reasonable compromise.</p> <p>If we lose <em>Janus</em>, unions will never look the same. It's at moments like this when we have to critically evaluate everything. What do we like about unions and our current workers' rights regime? <a href=\"http://inthesetimes.com/working/entry/19859/to_gain_power_we_must_stop_following_the_rules\" target=\"_blank\">What don't we like and what opportunities has this created for us to at least challenge that?</a></p> <p>For me, the opportunity is to think about having multiple competitive unions on the shop floor. <a href=\"http://www.shaunrichman.org/?p=836\" target=\"_blank\">I don't think of this as a model that will lead to multiple contracts</a>. It might lead to no contracts. Everything that I've written on this subject so far has been with the <a href=\"http://www.shaunrichman.org/?p=836\" target=\"_blank\">assumption that ULP protections against discrimination</a> remain in place so that the boss can't give one group of workers a better deal because they picked one union over another (or no union at all). If a boss makes a deal with any group of workers or imposes new terms because a union got bargained to impasse, everybody gets the same thing.</p> <p>Under a competitive multiple union model, I think no strike clauses become basically unenforceable. And these no strike clauses have become really deadly for unions in ways <a href=\"http://labornotes.org/blogs/2011/12/no-strike-clauses-hold-back-unions\" target=\"_blank\">we don't want to acknowledge</a>. Currently, the workers who should be the most emboldened at work, because they're protected by a union, have a contract that radically restricts their ability to protest. It's not just strikes. It curtails the ability to do slow down actions, and malicious compliance, and it forces the union rep to have to rush down to the job and tell their members, y<em>ou have to stop doing this</em>. And they end up feeling bitter toward the union leadership as much — if not more — than the boss for the conditions that were agitating them still being in place. And then their \"my union did nothing for me\" stories carry over to non-union shops. Every organizer has heard them.</p> <p>We need to <a href=\"http://inthesetimes.com/working/entry/18762/as_attacks_on_unions_continue_bringing_back_the_strike_may_be_our_only_hope\" target=\"_blank\">bring back the strike weapon</a>. And that's far easier said than done. But it's really hard to do when you're severely restricted in your ability for empowered workers to set an example for unorganized workers in taking action and winning.</p> <p>And, Kate, I <em>have</em> considered the DFR. I can't imagine a world of multiple competitive unions in a workplace where there wouldn't be at least one union that says <em>we're going to be the anti-racist union, we're going to be the feminist union, and we're the union for you</em>. Without DFR, you’re right, there's no legal guarantees. But someone steps into the vacuum and my hope is that at least creates the potential for militancy when militancy is called for in the workplace. With all the other messiness.</p> <p>There's going to be plenty of yellow unions and the boss is going to bring back employee representation programs and company unions and all of that. But that mess is exactly what they deserve. They've forgotten that exclusive representation is the model that <em>they</em> wanted — we didn’t, necessarily — in the 1940s and 1950s.</p> <p><strong>Bronfenbrenner</strong>: I wouldn't be ready to throw out DFR. I think that there is too little democracy, and too much discrimination in the labor movement. At this time, we already have right to work in most of the public sector and most of the public sector doesn't allow strikes, but workers still strike. We see that workers are willing to strike even if they are not allowed to strike, as evidenced by all these teachers, and we have to remember the strike statistics in this country only report strikes that are over 1,000 workers and most workplaces are under 1,000. We have a lot more strikes than are reported.</p> <p>The labor movement is not going to strike more just because you get rid of no strike clauses. Teamsters had the ability to strike as the last step of their grievance procedure for decades and they never went on strike. I think what is more important is the question of what is going to change the culture and politics of the labor movement. I don't think changing the right to strike is going to do it.</p> <p>What is going to make unions actually fight back even on something like fighting on Janus? They're not even getting in the streets on <em>Janus</em>, so what makes you think they're actually going to strike on issues in the workplace? We need to think about why workers and unions are so hesitant to strike. I do not believe that chaos necessarily is going to happen. I think employers are much more prepared for this. I think what will happen is that the unions that have been effective and have been working with their members and educating their members and involving their members will be fighting back and the ones that have been sitting back and not doing anything will continue to sit back and not do anything and some will die.</p> <p>The problem with getting rid of exclusive representation is that some unions are going to think “aha this is what I'm going to do, this is an easy way out,” the same way people used to think \"oh it's easier to organize in health care, oh it's easier to organize in the public sector, so rather than organize in my industry, which is hard, I'm going to go try health care or the public sector.” But they found that \"why can't I win organizing teachers the same way that AFT does\" or \"why can't I win organizing in health care the same way SEIU is doing\" and they discovered that it's not quite as easy as it looks.</p> <p><strong>Brooks:</strong> Yeah, I think Kate's point is really important: in a right-to-work setting, the employer anti-union campaign never ends. The boss is constantly trying to convince and cajole workers into dropping union membership. And employer anti-union campaigns are really effective, which is why unions don't win them very often.</p> <p>If the Supreme Court rules against unions in Janus, anti-union campaigns are only going to gain strength. So, my fear, Shaun, is that you are being overly romantic. I just don't think left-wing unions are going to suddenly emerge and step into the void left by business-as-usual unionism. If that was the case, then why hasn't that already happened with the 90 percent of workers that don't have any union at all?</p> <p><strong>Richman</strong>: The structure is a trap, and exclusive representation is part of that. I don't think we have a crisis of leadership. I want to turn to the private sector because most of the potential hope in abandoning exclusive representation is in the private sector. Look at the UAW and their struggles at <a href=\"http://inthesetimes.com/working/entry/19898/the_volkswagen_defeat_wasnt_inevitable_and_labor_can_still_win_in_the_south\" target=\"_blank\">Volkswagen</a> and at <a href=\"http://www.labornotes.org/2017/08/why-did-nissan-workers-vote-no\" target=\"_blank\">Nissan</a>, which Chris is intimately familiar with. I think all three of us could find fault in their organizing strategy and tactics. Kate, I think you have more grounds than anyone in the country to be frustrated because you've <a href=\"https://digitalcommons.ilr.cornell.edu/cgi/viewcontent.cgi?article=1157&context=workingpapers\" target=\"_blank\">scientifically proven</a> what it takes to win and most unions have ignored that research for decades! But a third of the workers at Nissan want to have a union. To do so, they have to win an exclusive representation election where the entire power structure of the community comes down on their heads arguing <em>keep the UAW out of the South</em>.</p> <p>If they had eked out an election win and managed to win a contract a year down the line, at the end of the day they get the obligation of having to represent everyone and probably the one-third of the workers who wanted the union all along are the only ones that join. That’s insane. Charles Morris threw out this theory a decade ago, in \"<a href=\"http://www.cornellpress.cornell.edu/book/?GCOI=80140100774460\" target=\"_blank\">The Blue Eagle at Work</a>,\" about how the NLRA was not intended to have these <a href=\"http://prospect.org/article/labor-crossroads-defense-members-only-unionism\" target=\"_blank\">winner-take-all exclusive representation</a> elections. The point of the NLRA was merely to say to employers anywhere there's a group of workers that say <em>hey we're a union</em> you must bargain with them in good faith. He argues that pathway is still open to unions. To the best of my knowledge a <a href=\"http://www.post-gazette.com/business/businessnews/2005/09/04/Union-tries-very-old-new-tactic-to-organize-Dick-s-Sporting-Goods-workers/stories/200509040221\" target=\"_blank\">few</a> unions <a href=\"https://www.nytimes.com/2007/08/15/us/15labor.html\" target=\"_blank\">politely asked the NLRB</a> for their opinion on that a couple of times rather than <em>all</em> of us <em>demanding</em> that should be a valid pathway for union representation.</p> <p>If you can win that exclusive representation election, you should win it, and you should also be saddled with the burdens of DFR. But why can't, and why shouldn't, the UAW file a petition at every auto factory in the country right now and say <em>we have members here and you need to bargain with us over their working conditions</em>? And why shouldn't other unions jump into the fray and claim to represent their portion of the workers and drive those non-union companies nuts with a bunch of unions placing demands on them, and organizing to take action?</p> <p>I think the work that <a href=\"https://www.united4respect.org/\" target=\"_blank\">Organization United for Respect</a> (OUR) is doing at Wal-Mart is a good example of that. They by no means have a majority of the workers at Wal-Mart. They are in a few strategic locations. They are a nuisance to the company. They <a href=\"https://www.bloomberg.com/news/articles/2018-05-11/walmart-settles-dispute-with-labor-activists-over-worker-protest\" target=\"_blank\">just won</a> a right that workers are allowed to wear union buttons on the shop floor. Wal-Mart has given workers raises in response to their agitation. I'm not suggesting that that model is perfect or what we should <em>all</em> be doing, but I am saying that this should be an avenue open to us. And it only becomes open to us if we're willing to experiment more with abandoning exclusive representation where it doesn't work for us.</p> <p>I would argue that in 90% of private sector workplaces where winning these elections is not possible it's not working for us currently.</p> <p><strong>Bronfenbrenner</strong>: The comprehensive campaign-organizing model should be part of every organizing effort. Workers are protected under the NLRA when they engage in concerted activity and, as I say in all my organizing research, the union should be acting like a union from the beginning of the campaign. Unions should also be organizing around workplace problems and going to the employer and engaging in actions during the organizing campaign. I've been saying for 30 years that you don't wait to start acting like a union until you win. But there is serious pushback against that element of my model from many organizers.</p> <p>Unions are very hesitant to start taking on the employer before they win the majority. But there are unions that do that. It's not just OUR. It’s Warehouse Workers United, SEIU 32BJ, RWDSU, Communications Workers, the Teamsters. All have run campaigns where they begin taking on the employer before the union has been recognized or certified. The unions that have been doing comprehensive campaigns are doing it in bargaining and it's being done in organizing by the unions who are winning in organizing. So they're not waiting until they win.</p> <p><strong>Richman</strong>: Thirty or forty years into people getting really serious about organizing as a science and as a craft, the fact that most unions still haven’t embraced an organizing model. . .</p> <p><strong>Bronfenbrenner</strong>: People have been serious about organizing as a craft from the beginning. It's just that no one wrote very good books about what they did. The IWW and the UAW organizers, and the textile organizers, they were organizing using the same strategies that are being done now. No one wrote good books about what they did.</p> <p><strong>Richman</strong>: Sure, that's fair. But the fact that unions are not following an organizing model that’s informed by <a href=\"https://www.researchgate.net/publication/37154851_Changing_to_Organize_A_National_Assessment_of_Union_Organizing_Strategies\" target=\"_blank\">your research</a> and other unions' best practices suggests it's not a matter of culture but the legal framework that we find ourselves trapped in. Most of the pressure on a union leader is to <a href=\"http://newlaborforum.cuny.edu/2016/10/01/on-the-contrary-labor-wars/\" target=\"_blank\">bring back good contracts</a> for the members you currently represent and keep winning re-election. So that puts more resources into grievance handling and bargaining and it leads to the cost cutting in organizing campaigns.</p> <p><strong>Bronfenbrenner</strong>: I disagree. For the last three decades servicing and education budgets have been cut while huge amounts of the labor movement’s financial and staff resources have been shifted into labor law reform. And I can tell you because I'm part of the debate they don't want to have about what they they need to do to <em><a href=\"https://digitalcommons.ilr.cornell.edu/articles/556/\" target=\"_blank\">change to organize</a></em>. But most either think they are doing everything they can, or it is too hard to do anything different. It is the law that is the problem.</p> <p>Either way the shared understanding is that unions should put resources into politics and in getting labor law reform because trying to do comprehensive organizing campaigns we’re asking them to do is “too difficult.” But they're not putting resources into grievance handling anymore. They are putting it into politics and  labor law reform.</p> <p><strong>Richman</strong>: The approach to labor law reform has been too much about trying to preserve the system. The opportunity of the moment is to think beyond the boundaries of the workplace. Enterprise level bargaining has been <a href=\"http://inthesetimes.com/working/entry/20728/open-shops-right-to-work-union-busting-organizing-labor-movement\" target=\"_blank\">killing us since the 1970s</a>. As long as union membership is tied to whether or not some group of workers voted to form a union sometime in the past within the four walls of your workplace, that just incentivizes the offshoring and contracting out that's really what has decimated the labor movement.</p> <p>Humpty Dumpty is sitting on the wall and if Neil Gorsuch and John Roberts kick him off I am not particularly interested in being one of the king's horses and men trying to put him together again. At that point the system is fundamentally broken and we need new demands about what kind of system we want and new strategies about how we exploit the brokenness of the system to make them regret what they have done.</p> <p>Exclusive representation — combined with agency fee and DFR — worked for a long time. But if you knock one piece out, it all falls apart. We shouldn't be pining for bygone days. We need to be thinking forward about what opportunities this creates. I hope that some people get inspired to try something as crazy as the <a href=\"https://www.iww.org/category/campaigns/current-campaigns/food-retail-workers-organizing/jimmy-johns\" target=\"_blank\">IWW</a> saying<em> fuck it, we're going to organize in different workplaces and agitate for work slowdowns and try to gain a few members in a few places we don't care about expenditures of resources and dues. We're going to create some chaos.</em></p> <p><strong>Brooks:</strong> I share Kate's concerns, I believe that many unions have devolved into highly legalistic organizations. So the solutions they are pursuing to our current problems are highly technical and legal in nature, which means that lobbying and electing Democrats often becomes their top priority. Laws are important, but unions should spend far more time and resources on organizing comprehensive campaigns that build support among large majorities of workers, winning them over to a plan for collective action that can change conditions on the job and in the community.</p> <p>Instead of this kind of organizing, what we've seen over the past few decades is the increasing confinement of class struggle to smaller and smaller segments of workers. Few unions these days aim to represent all workers in an industry. How many unions are engaged in <a href=\"http://labornotes.org/2010/02/pattern-retreat-decline-pattern-bargaining\" target=\"_blank\">pattern bargaining</a> and setting contract standards across an industry or openly organizing toward a master agreement? To your point, Shaun, unions have become limited to firm-level representation. Or even just a bargaining unit within a firm, since many do not even try to organize everyone who works for the same employer.</p> <p>Members-only unionism just continues this trend as unions move to represent an even smaller fraction of workers, not as a stepping stone to building a majority, but as a strategy to get out of providing services to workers who don’t pay dues. Ultimately, I believe this is a capitulation to the employers’ right-to-work framework and a retreat from the kind of broad-based organizing that the labor left has been historically committed to.</p> <p><strong>Bronfenbrenner</strong>:  We can no longer talk about the workplace solely through a U.S. framework. Ownership structures are so large, diffuse, and complex that what we <a href=\"https://www.researchgate.net/publication/254583013_Global_Unions_Challenging_Transnational_Capital_Through_Cross-Border_Campaigns\" target=\"_blank\">should be doing is organizing and bargaining and building relationships between workers across the entire corporation world-wide</a>, company-wide, and industry-wide. That requires getting workers to understand that they need to build power to take on whomever the decision-makers in the company are. It is not the boss that they see once a year at the annual holiday party. It is whoever has the money and really makes the decisions in the ultimate parent company. And that requires building alliances locally, nationally, and internationally, and building a much broader labor movement.</p> <p>It also means understanding that the person who doesn't pay union dues in their shop is not the problem. The problem for workers is that now what they have is the chamber of commerce fighting against their right to bargain and the state at all levels is interfering with economic and union rights. Their boss is now some investor somewhere who has decided to buy and sell their company and their jobs who does not care what they make or whether they stay open or not.</p> <p>You have to figure out what they care about because that is what gives unions  leverage. That's why workers in America have to get to know workers in Mexico and workers in Europe, those kinds of relationships, that is what the labor movement needs to spend their energy on. <em>That's what I'm going to spend my energy on.</em> The U.S. labor movement cannot afford to be picking petty fights between workers who are paying dues and workers who aren't paying dues because they need each other.</p> <p><strong>Richman:</strong> The structure is a trap partly by forcing unions to focus on individual bargaining units, individual workplaces and somehow winning them one-by-one. What we should be doing is not retreating from our bargaining units, but claiming to represent the willing workers in <em>every</em> company in <em>every</em> industry. I'm trying to inspire anyone who is out there reading this to think about an opportunity to spread out wider — in a much more bare bones, scrappier way — but one that puts the union idea in many more workplaces. To get the word out now, rather than <em>we'll get to you after we somehow win Nissan or Volkswagen</em>. Because that's not working.</p> <p><strong>Bronfenbrenner</strong>: But you're not going to get labor law changed unless you have power.  It takes political power to get labor law changed. You can't get political power until you organize a lot. You're asking for a labor law change. The point is that focusing on labor law is backwards. We only get labor law reform after we do a great deal of organizing. First you have to organize and build power.</p> <p>During the whole Employee Free Choice Act (EFCA) fight <a href=\"https://theintercept.com/2018/01/21/labor-movement-us-unions/\" target=\"_blank\">everyone stopped organizing and spent all their energy</a> on EFCA. That's the danger of labor law reform.</p> <div class=\"jw-header\">\n<h3>Top Trending</h3>\n<h4>Check out the major news stories of the day</h4>\n</div> <p><script src=\"http://jw.salon.com/players/lICIK5Fp-r6Pl0rxU.js\"></script></p> </body>","tags":["The Economy &amp; Innovation","All Salon","In These Times","Janus v. AFSCME","Labor","Unions"],"publishedDate":"2018-06-02T21:29:57Z","harvestDate":"2018-06-02T21:38:29Z","estimatedPublishedDate":"2018-06-02T21:29:57Z","url":"http://ct.moreover.com/?a=34207167610&p=1u0&v=1&x=7cHKY0391of4I5zTvWXi4g","originalUrl":"https://www.salon.com/2018/06/02/after-janus-should-unions-abandon-exclusive-representation_partner/","commentsUrl":"https://www.salon.com/2018/06/02/after-janus-should-unions-abandon-exclusive-representation_partner/#comments","outboundUrls":["http://www.inthesetimes.com/","http://http://inthesetimes.com","http://newlaborforum.cuny.edu/2017/08/24/the-cure-worse-than-the-disease/","https://onlabor.org/janus-amicus-economists-law-professors/","https://www.washingtonpost.com/news/posteverything/wp/2018/03/01/if-the-supreme-court-rules-against-unions-conservatives-wont-like-what-happens-next/?utm_term=.dbc5d3b4c1f6","https://theintercept.com/2018/02/25/conservatives-public-sector-unions-janus/","http://inthesetimes.com/working/entry/19075/the_legal_argument_that_could_overturn_right_to_work_laws_around_the_countr","http://inthesetimes.com/working/entry/20791/members-only-union-labor-right-to-work","http://inthesetimes.com/working/entry/18562/members-only-minority-unions","https://www.epi.org/publication/bp235/","https://www.law.cornell.edu/supremecourt/text/323/192","https://en.wikipedia.org/wiki/Herbert_Hill_(labor_director)","https://uwpress.wisc.edu/books/1288.htm","https://scholarship.law.upenn.edu/cgi/viewcontent.cgi?article=2503&context=faculty_scholarship","http://www.documentcloud.org/documents/3984714-Spntoolkit.html#document/p1","https://www.mackinac.org/22762","http://employeefreedomweek.com/","http://inthesetimes.com/working/entry/20525/right-wing-plot-unions-labor-ALEC","http://inthesetimes.com/working/entry/18682/friedrichs-v-california-teachers-association-scotus-heather-whitney","http://inthesetimes.com/working/entry/19859/to_gain_power_we_must_stop_following_the_rules","http://www.shaunrichman.org/?p=836","http://labornotes.org/blogs/2011/12/no-strike-clauses-hold-back-unions","http://inthesetimes.com/working/entry/18762/as_attacks_on_unions_continue_bringing_back_the_strike_may_be_our_only_hope","http://inthesetimes.com/working/entry/19898/the_volkswagen_defeat_wasnt_inevitable_and_labor_can_still_win_in_the_south","http://www.labornotes.org/2017/08/why-did-nissan-workers-vote-no","https://digitalcommons.ilr.cornell.edu/cgi/viewcontent.cgi?article=1157&context=workingpapers","http://www.cornellpress.cornell.edu/book/?GCOI=80140100774460","http://prospect.org/article/labor-crossroads-defense-members-only-unionism","http://www.post-gazette.com/business/businessnews/2005/09/04/Union-tries-very-old-new-tactic-to-organize-Dick-s-Sporting-Goods-workers/stories/200509040221","https://www.nytimes.com/2007/08/15/us/15labor.html","https://www.united4respect.org/","https://www.bloomberg.com/news/articles/2018-05-11/walmart-settles-dispute-with-labor-activists-over-worker-protest","https://www.researchgate.net/publication/37154851_Changing_to_Organize_A_National_Assessment_of_Union_Organizing_Strategies","http://newlaborforum.cuny.edu/2016/10/01/on-the-contrary-labor-wars/","https://digitalcommons.ilr.cornell.edu/articles/556/","http://inthesetimes.com/working/entry/20728/open-shops-right-to-work-union-busting-organizing-labor-movement","https://www.iww.org/category/campaigns/current-campaigns/food-retail-workers-organizing/jimmy-johns","http://labornotes.org/2010/02/pattern-retreat-decline-pattern-bargaining","https://www.researchgate.net/publication/254583013_Global_Unions_Challenging_Transnational_Capital_Through_Cross-Border_Campaigns","https://theintercept.com/2018/01/21/labor-movement-us-unions/"],"wordCount":"5357","dataFormat":"text","duplicateGroupId":"34146810279","media":{"audio":[],"images":[{"url":"https://media.salon.com/2018/03/supreme-court-620x412.jpg"},{"url":"https://media.salon.com/2018/01/17ITTLogo_SQ.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Fund management news","group":"Finance"},{"name":"Trade union news","group":"Society"},{"name":"Public sector news","group":"Society"}],"companies":[],"author":{"name":"Shaun Richman","publishingPlatform":{}},"licenses":[],"source":{"name":"Salon > all_salon","homeUrl":"https://www.salon.com/","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"2493","name":"Salon > all_salon","mediaType":"Blog","publishingPlatform":"WordPress","generator":"http://wordpress.org/?v=3.2.1","description":"In-depth news, politics, business, technology & culture > all_salon","tags":[],"copyright":"Copyright 2011, Salon.com","language":"English","dataFormat":"text","rank":{"autoRank":"1","autoRankOrder":"350","inboundLinkCount":"13322"},"inWhiteList":"true","autoTopics":["ugc financial feeds","ugc health feeds","ugc law feeds"]}},"es_id":86992258}