{"sequenceId":"845361946595","id":"34207103149","language":"English","title":"El Macero: Excellent hospitality, impossible course","content":"For years, I’ve wanted to play golf at El Macero Country Club. Sorry, that should actually read, “for four years, I’ve wanted to play golf at El Macero Country Club.” Because ever since I took up this incredibly frustrating game where you get to pay a lot of money to spend five hours in artificial nature and basically be terrible at everything you do, I’ve fallen in love with it. It’s not a stretch to say that I grew up around El Macero — the Baria’s, who I feel like are part of my family and who helped raise me, live near the green on the 13th-rated No. 8. Two more of my adolescent friends lived just a few houses down, and as a child I was once berated for taking a sand wedge to the practice putting green. To be fair, though, we were up to the dress code. But two weeks ago, I was finally granted the opportunity to play on this prestigious course, thanks to the kind invitation from El Macero general manager Rusty Seymour, who invited me to take part in the club’s media day that commemorated its 57th year in business. The setting was impossibly pristine, with free dining provided by the excellent kitchen at the country club and personalized bag tags delivered, along with a pair of balls (as if I could make it through the whole round with only two balls). And my playing partners were equally amazing — each group was chaperoned by a member of the club, and mine happened to be El Macero president Cynthia Cory, who would pair with me along with 96.9 The Eagle’s Doug Thomas and Rick Surlow, who runs a Bay Area-based golf magazine. There was only one problem: I suck at golf. Soon-to-be-graduated Davis High golf phenom Marie Dean told me recently that she was disappointed when she shot a 90 on the links at El Macero, a score I would dream of. A few weeks ago, I wrote about taking a golf lesson from El Macero native Tyler Raber, who has a chance of qualifying for his second-ever U.S. Open this year. Raber’s tips were invaluable, and I’m truly a better golfer because of them. I still shot a 146. After I sent my scorecard to my friend, Billy Baria, whose dad, Murry, is a member, Murry replied, “He has nowhere to go but down!” (Thanks, Murry, truly. Your positive outlook on life is an inspiration to me.) (And while we’re here, shout out to Laura, who has been like a second mother to me for 23 years.) Thomas, an avid golfer, fared much better than me, but still came in with a 102, making several references to wanting a chainsaw in order to chop down the trees that kept finding themselves in the way of him. Cory, an absolute delight of a human being who didn’t mind my general terribleness, came in with a 103 on her home course despite hitting the ball straight down the middle almost every time off of the tee. And Surlow, who was perhaps the most patient and encouraging person I’ve ever played golf with, led the pack with a 93. But if you had asked me what his score was during his round, I could have sworn it was a 73 with the way he approached the game in a professional manner and never seemed to get too up or too down regardless of the circumstance. There were exactly zero birdies among our foursome. At the post-round banquet, I heard people laughing about how they had “shot a radio station,” meaning a score above whatever the lowest frequency you can toggle your radio to. I’m an okay athlete. I’ve never been able to pick up something and not be immediately decent at it — that is until I started playing golf. And El Macero is by far the hardest course I’ve ever played. I think right now at the artist formerly known as “Muni,” I would probably shoot around a 95. However, I can now truly understand the challenges of an unforgiving golf course, and with the copious amount of trees and insane distance, El Macero is certainly that. I don’t know how much I need to practice before I play it again, but what I’ll remember most about the day is the amazing hospitality that Seymour and the Country Club staff provided, as well as the amazing patience and great attitudes of my playing partners. After all, it’s not often that you can literally shoot over double par and have a fun day. That’s exactly what I had at El Macero. — Evan Ream’s column publishes Sundays. Reach him at [email protected] or follow him on Twitter @EvanReam Related ShareTweet","contentWithMarkup":"For years, I’ve wanted to play golf at El Macero Country Club. Sorry, that should actually read, “for four years, I’ve wanted to play golf at El Macero Country Club.” Because ever since I took up this incredibly frustrating game where you get to pay a lot of money to spend five hours in artificial […]","tags":["Sports","B1"],"publishedDate":"2018-06-02T21:12:52Z","harvestDate":"2018-06-02T21:22:24Z","estimatedPublishedDate":"2018-06-02T21:12:52Z","url":"http://ct.moreover.com/?a=34207103149&p=1u0&v=1&x=ylpBcExKVx8918AC_SAjCw","originalUrl":"https://www.davisenterprise.com/sports/el-macero-excellent-hospitality-impossible-course/","commentsUrl":"https://www.davisenterprise.com/sports/el-macero-excellent-hospitality-impossible-course/#respond","outboundUrls":["https://www.facebook.com/sharer.php?u=https%3A%2F%2Fwww.davisenterprise.com%2Fsports%2Fel-macero-excellent-hospitality-impossible-course%2F","https://twitter.com/intent/tweet?text=El%20Macero%3A%20Excellent%20hospitality%2C%20impossible%20course&url=https://www.davisenterprise.com/sports/el-macero-excellent-hospitality-impossible-course/&via=alldenews"],"wordCount":"780","dataFormat":"text","duplicateGroupId":"34207103149","media":{"audio":[],"images":[{"url":"https://www.davisenterprise.com/files/2018/06/EvanReam2W.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Evan Ream","publishingPlatform":{}},"licenses":[],"source":{"name":"Davis Enterprise","homeUrl":"https://www.davisenterprise.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"182090640","name":"Davis Enterprise","mediaType":"Blog","publishingPlatform":"WordPress","generator":"https://wordpress.org/?v=4.9","description":"Yolo County, California","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"4","autoRankOrder":"11247","inboundLinkCount":"74"},"inWhiteList":"true","autoTopics":[],"editorialTopics":["Sports","Consumer"]}},"es_id":86990019}