{"sequenceId":"845363518461","id":"34207154237","language":"English","title":"The joys of eating kebabs","content":"Kebabs have not only dominated the kitchens of nawabs and ordinary folk, over time, they also became a popular idiom for the trial of a lover. There are many verses comparing a lover’s heart to a kebab. kiya kaamil hame’n ik umr mein soz-e-mohabbat nehuye ham aatish-e-gham se kebab aahista aahistaI was whole, after burning in love for a lifetime,The fire of love, it grilled my heart like a kebab on slow fire— Wahshat Raza Ali Kalkatvi So what exactly are kebabs and how did they travel to India? Since the discovery of fire, whole animals or chunks of meat were cooked on open fire. At some point in time, early men and women learnt to pierce pieces of meat with wooden sticks to prevent getting burnt — thus, grilled food was invented. The popular seekh kebab originated in Central Asia and comes from the Turkish word shish kebab, which literally means “skewer” and “roast meat”. Shami kebab. [Photo and recipe by Rana Safvi] © Shami kebab. [Photo and recipe by Rana Safvi] There is a legend that Turkish soldiers would grill meat in open fields using their swords as skewers in their camps at night during their invasion of Anatolia. Though they did not invent the shish kebab as Homer’s Odyssey refers to meat cooked on skewers in an open fire. For the Central Asian nomad, cooking was not a luxury but a necessity. They would travel with meat pieces and mince, marinated in different spices to tenderise and flavour the meat and cook it in the evening when they camped. Since a lot of meat would be game unusual smells were also taken care of in the marinating process. Mongol soldiers, too, carried on this practice keeping marinated meat in their saddlebags and cooking it easily and in quick time on fire, once they camped for the night. Since they travelled and conquered vast swathes of land, the shish kebab too travelled with them. This practical dish gave rise to exotic kebabs of many kinds. Dum pukt kebab. © Daily O kebabs came to India with the Delhi Sultans and were refined under the Nawabs of Awadh in Lucknow’s kitchens. The 15th century Nimatnama of the Sultans of Mandu or The Sultan’s Book of delight containing recipes from the reign of Ghiyath Shah mentions many recipes for kebabs. In a fish seekh kebab recipe, cooked fish mince is mixed with coarsely ground coriander and roasted fennel seeds. To this, we add potherbs and ebony fruit. The kebab is then wrapped in cotton and skewered. A mixture of camphor, musk and rosewater with ghee is rubbed on the skewered mince every hour. The recipe says, serve it when it’s red. The proud Kakori kebab. © Daily O The Sultan’s recipe sounds quite mysterious for I have no idea how this worked as cotton would have got burnt on the skewers. However, as there is also no mention of coals, it is possible that the cooked mince was just lightly rubbed with the mixture and the cotton removed before serving the kebabs. The book Awadh Symphony by Aslam Mahmood gives a detailed description of kebabs. He mentions a Persian book Sheeshagaran Vaghairah Wa Bayan-I Aalat-I Aanha (the Illustrated book about makers of Glassware etc and a description of their tools) by Ghulam Yahya — translated by Mehr Afshan Farooqi as Crafting Traditions: Documenting Trades and Crafts in Early 19th century India — which mentions many types of kebabs. These are Dumpukht kebab — a small goat, skinned and with offal etc removed, stuffed with curd and spices, cooked over a slow fire in a copper vessel; fish kebab; kofta, pasanda (slivers of marinated meat cooked on charcoal fire); shami kebab; gilani kebab (served in a gravy of clotted cream); galawat ke kebab (raw marinated mince tenderised with green papaya paste and then fried); chicken kebab and shahpasand kebab (with egg white and spices added to it). The shami kebab is said to have been invented for a Nawab sahib of Awadh by a Syrian (Shaam in Arabic) cook because the toothless nawab sahib found it difficult to chew meat. The humble Shami kebab. © Daily O Kofta was probably invented by a frugal soul who could not bear to see the wastage of meat pieces too small to be put on skewers. The word kofta originates from the Persian word kufta, meaning to beat or to grind. There is an extremely elaborate version of kofta called Nargisi Kofta where a special kebab mix is wrapped around a boiled egg and fried. The kofta is then cut carefully in half and because the white and yolk of the egg resemble the narcissus flower, it is called nargisi kofta. (Nargis is the Urdu name for narcissus flower.) The Kakori kebab is said to have been invented by the rakabdar (chief chef) of the Nawab of Kakori, who had been taunted by a British officer over the rough texture of a seekh kebab. So, this kebab is made from a special cut from the leg of mutton and khoya added to it make it soft. Most kebabs are very time consuming but the shami variety is simple and its paste can be made in bulk and frozen. In the month of Ramzan, shaami kebabs are a very popular item on the table at the time of iftar (when the fast is broken at sunset). Here’s a simple recipe that I learnt as a child and use even now. Shami kebabs Ingredients For boiling 1. 1/2 kg mutton mince (Make sure you get mince without fat. Wash the mince and let it stay in a strainer so that all the excess water can drain off). 2. 1/2 cup chana dal. 3. 1/2 onion (medium size) chopped. 4. 1/2 ” ginger stick. 5. 1 onion chopped. 6. 1 badi elaichi (seeds only). 7. 3 pieces laung (cloves). 8. 1/2 tsp peppercorns. 9. ½ tsp cummin seeds. 10. 2 tez patta (bay leaves). 11. Whole red chilli (to taste). 12. Salt to taste. To be added to the mince paste before grinding 1. ½ a onion sliced finely and fried. 2. 1 tsp grated dessicated coconut, lightly roasted on a dry frying pan. Method Put in all the ingredients, and bring them to boil with one-fourth cup of water. Cook it for 10 minutes in the pressure cooker. Once done, let it cool. If there is some water left , open-cook it till dry. (If the paste is not thick enough, the kebabs will break.) Grind to a paste in food processor. Add finely chopped onions, green coriander and green chillies to the mix. I add ½ tsp chopped mint in summers as it gives it a fresh flavour. Make kebab-shaped cutlets out of the mix and shallow fry. The trick is to fry the kebabs on very slow heat and to add only dashes of oil at a time. With excess oil, the kebabs break. Press down with a slotted spoon so that the kebab is evenly fried on all sides. Take the ready kebabs out on a round flat dish and garnish with onion rings and mint leaves. Serve them with chapatti or parantha and green chutney. Green Chutney 1 I cup chopped green coriander leaves. ½ tsp garlic paste. Few green chillies as per taste. Salt to taste. ½ tsp lemon juice. Grind into a fine paste the first four ingredients. When ready pour lemon juice and mix well. Green Chutney 2 This is a summer special. 1 cup chopped mint leaves. 1 tbsp grated raw mango. Few green chillies as per taste. Salt to taste. Grind everything to a fine paste, and savour it with kebabs.","contentWithMarkup":"<img align=\"left\" src=\"http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAy83uq.img?h=100&w=100&m=6&q=60&o=f&l=f\" />","tags":[],"harvestDate":"2018-06-02T21:35:04Z","estimatedPublishedDate":"2018-06-02T21:35:04Z","url":"http://ct.moreover.com/?a=34207154237&p=1u0&v=1&x=Ohxn9NwHo_NYEwf5RhE-JA","originalUrl":"https://www.msn.com/en-in/lifestyle/lifestylegeneral/the-joys-of-eating-kebabs/ar-AAxFS36?srcref=rss","outboundUrls":[],"wordCount":"1240","dataFormat":"text","duplicateGroupId":"34202559801","media":{"audio":[],"images":[{"url":"http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAy83uq.img?h=100&w=100&m=6&q=60&o=f&l=f"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"publishingPlatform":{}},"licenses":[],"source":{"name":"Style, Beauty & Fashion News, Horoscope, Relationship News | MSN India","homeUrl":"http://www.msn.com/en-in/lifestyle/","location":{"country":"India","countryCode":"IN","region":"Asia","subregion":"Southern Asia"},"feed":{"id":"182236815","name":"Style, Beauty & Fashion News, Horoscope, Relationship News | MSN India","mediaType":"Blog","description":"Get the latest beauty and fashion trends, horoscopes, relationship advice, smart living tips and more.","tags":[],"copyright":"MSN India","language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":["ugc food feeds","ugc sport feeds","ugc recreation feeds","ugc arts feeds","ugc health feeds"],"editorialTopics":["Lifestyle","Consumer"]}},"es_id":86991770}