{"sequenceId":"845365859023","id":"34207225242","language":"English","title":"The Right Side","content":"I've officially been on the East Coast for 4 days, and have learned a few things since arriving on Tuesday:   1. 'Networking lunches' are similar to 'working lunches' except you have to learn how to politely (and carefully) eat food while meeting people for the first time  2. Fred Meyer stores do NOT exist  3. Humidity is indeed a THING  4. When using the escalator, stay on the right side unless you want to get clobbered by the people RUNNING to make the Metro  DC is iconic, beautiful and warm, and every day I wake up I am reminded of the historical significance and injustices that formed the foundation of this country, and everyday I begin to discover a bit more about myself.  In many ways, the themes identified in the items above reflect specific part of my childhood:   \tInnocence: Unaware of societal norms (such as social class, food security, family priviledge ) \tUnderstanding: Perfect people and things do NOT exist \tExperience: Environmental changes occur knowingly and unknowingly \tOpportunity: Change is indeed a THING  Historical trauma played an powerful role in my childhood. It influenced my social development, formed my current triggers, and played a role in my biological mothers parenting skills. She too experienced trauma, and raised us in the way that was modeled for her.  Change was presented to me when I met my forever family. Grace, mercy and compassion were presented to me in ways I hadn't yet seen before. I had someone who believed in me and spoke eloquently into my life, and helped bring my dreams to fruition. For the first time in my life I was experiencing positive change that was leading me to the right path, and in many ways didn't know that that meant.  17 years later,  and I am just beginning to understand.  Change is even more than learning to stand on the right side of the escalator. It's something experienced by everyone, and in many ways, it is hard.  And in this feat, I know that I am not alone.  Many times over the course of our lifetimes opportunities have been presented to us, and we are expected to change. But what if we don't make the right decision? What if the decision we choose doesn't turn out right?  What if being right didn't define us, and opportunities were just another way to experience growth?  Change is hard. Yet, hard doesn't equal bad.      Here's a few more beautiful pictures for your viewing pleasure :)","contentWithMarkup":"I've officially been on the East Coast for 4 days, and have learned a few things since arriving on Tuesday:\n\n<img class=\"  wp-image-234 alignleft\" src=\"https://schoolingmythoughts.files.wordpress.com/2018/06/34104790_2259203577428767_3914464173173506048_o.jpg\" alt=\"34104790_2259203577428767_3914464173173506048_o\" width=\"321\" height=\"428\" /> 1. 'Networking lunches' are similar to 'working lunches' except you have to learn how to politely (and carefully) eat food while meeting people for the first time\n\n2. Fred Meyer stores do NOT exist\n\n3. Humidity is indeed a THING\n\n4. When using the escalator, stay on the right side unless you want to get clobbered by the people RUNNING to make the Metro\n\nDC is iconic, beautiful and warm, and every day I wake up I am reminded of the historical significance and injustices that formed the foundation of this country, and everyday I begin to discover a bit more about myself.\n\nIn many ways, the themes identified in the items above reflect specific part of my childhood: <img class=\"  wp-image-236 alignright\" src=\"https://schoolingmythoughts.files.wordpress.com/2018/06/img_0880.jpg\" alt=\"IMG_0880\" width=\"219\" height=\"501\" />\n<ol>\n\t<li>Innocence: Unaware of societal norms\n(such as social class, food security, family priviledge )</li>\n\t<li>Understanding: Perfect people and things do NOT exist</li>\n\t<li>Experience: Environmental changes occur knowingly and unknowingly</li>\n\t<li>Opportunity: Change is indeed a THING</li>\n</ol>\nHistorical trauma played an powerful role in my childhood. It influenced my social development, formed my current triggers, and played a role in my biological mothers parenting skills. She too experienced trauma, and raised us in the way that was modeled for her.\n\nChange was presented to me when I met my forever family. Grace, mercy and compassion were presented to me in ways I hadn't yet seen before. I had someone who believed in me and spoke eloquently into my life, and helped bring my dreams to fruition. For the first time in my life I was experiencing positive change that was leading me to the right path, and in many ways didn't know that that meant.\n\n17 years later,  and I am just beginning to understand.\n\nChange is even more than learning to stand on the right side of the escalator. It's something experienced by everyone, and in many ways, it is hard.\n\nAnd in this feat, I know that I am not alone.  Many times over the course of our lifetimes opportunities have been presented to us, and we are expected to change.\nBut what if we don't make the right decision? What if the decision we choose doesn't turn out right?\n\nWhat if being right didn't define us, and opportunities were just another way to experience growth?\n\n<strong>Change is hard. Yet, hard doesn't equal bad.  </strong>\n\n \n<p style=\"text-align:center;\">Here's a few more beautiful pictures for your viewing pleasure :)</p>\n<img class=\"  wp-image-237 aligncenter\" src=\"https://schoolingmythoughts.files.wordpress.com/2018/06/34032608_2257282880954170_6157288085030699008_o.jpg\" alt=\"34032608_2257282880954170_6157288085030699008_o\" width=\"467\" height=\"623\" /><img class=\" size-full wp-image-238 aligncenter\" src=\"https://schoolingmythoughts.files.wordpress.com/2018/06/img_1855.jpg\" alt=\"IMG_1855\" width=\"480\" height=\"640\" /><img class=\" size-full wp-image-239 aligncenter\" src=\"https://schoolingmythoughts.files.wordpress.com/2018/06/img_1896.jpg\" alt=\"IMG_1896\" width=\"480\" height=\"640\" />","tags":[],"publishedDate":"2018-06-02T21:52:00Z","harvestDate":"2018-06-02T21:52:04Z","estimatedPublishedDate":"2018-06-02T21:52:00Z","url":"http://ct.moreover.com/?a=34207225242&p=1u0&v=1&x=kbIrmGVuVFQp8Oke1Juvog","originalUrl":"https://schoolingmythoughts.wordpress.com/2018/06/02/the-right-side/","outboundUrls":[],"wordCount":"406","dataFormat":"text","duplicateGroupId":"34207225242","media":{"audio":[],"images":[{"url":"https://schoolingmythoughts.files.wordpress.com/2018/06/img_1896.jpg"},{"url":"https://schoolingmythoughts.files.wordpress.com/2018/06/img_1855.jpg"},{"url":"https://schoolingmythoughts.files.wordpress.com/2018/06/img_0880.jpg"},{"url":"https://schoolingmythoughts.files.wordpress.com/2018/06/34104790_2259203577428767_3914464173173506048_o.jpg"},{"url":"https://schoolingmythoughts.files.wordpress.com/2018/06/34032608_2257282880954170_6157288085030699008_o.jpg"}],"video":[],"logo":[]},"publishingPlatform":{"itemId":"233"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"ixoyefreakamber","publishingPlatform":{"userId":"95457402"}},"licenses":[],"source":{"name":"Amber's Capstone Portfolio","homeUrl":"https://schoolingmythoughts.wordpress.com","location":{},"feed":{"id":"559255539","name":"Amber's Capstone Portfolio","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"100316230","generator":"http://wordpress.com/","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"9","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86993862}