{"sequenceId":"845362304407","id":"34207114468","language":"English","title":"2018 Trip 4: Arizona: May 30","content":"Page, Arizona. Wednesday May 30     Chris and I were the good ones, getting up at 4:15 A.M. to view a Grand Canyon sunrise. Frankly, we should have stayed in bed. It was alright, but not dramatic. Too many clouds and not much red and orange to make the sunrise stand out. Still, we were proud of ourselves for getting up and walking to the Trail View Overlook for the sunrise.      Trail View Overlook is on the Hermits Rest rim trail. Cars are not allowed there most of the year; you either walk or take the shuttle. Hermit’s Rest juts out into the canyon so it is a good trail to use for sunrise viewing. Trail View is named because you can look down onto Bright Angel Trail, the trail taken by mules and most people hiking on the trail. Readers of the blog have read that I have vertigo now so walking along that trail is just not something on my agenda. Even at 5 AM we saw people beginning the hike.  It usually takes twice as long to hike back up as it does to go down. You can choose just to walk a short portion, no pressure to do it all.    The four of us had breakfast and left a little before ten on our drive to Page, AZ. We stopped at two other overlooks on the way out. The view can change from stopping point to stopping point. Views of the Colorado River are infrequent; it is a mile down and the canyon is 10 to 12 miles wide here. The canyon twists and turns and canyon walls and lesser eroded walls block your view. During the 24 hours we were here, and including sunrise and sunset, I did not find the canyon as colorful as is frequently portrayed in paintings and photographs. Outstanding and awe-inspiring, yes.   On the drive to Page we stopped at McAllister’s Deli at Cameron. This interchange in the middle of nowhere has been improved with a roundabout and new restaurants and gas stations. Our destination was to reach Ken’s Tours at Lower Antelope Canyon by 2 PM. There are tours for Upper and Lower Antelope Canyon. Both are located on Navajo reservation land and the guides are Navajo. We prefer the Lower Antelope tours since: a. You do not have to ride an open air Jeep on dusty roads to reach the canyon; b. The walk through the canyon is one-way, you do not have to jostle and deal with people coming at you in order to take your photos.   The tour takes an hour to an hour and a half. The canyon is formed by rushing waters after the monsoon season (July and August) rains erode away the sandstone. It is called a slot canyon, it is wider at the bottom and narrower at the top. As you walk through, watching for low overhangs and protruding walls, you are amazed by the wavy designs and formations observable all around you. There are also metal stairs that must be dealt with as you enter and a few times through the canyon.   Chris and I had been here once before, it was the first time for Deb and Rebecca. My words are poor efforts to describe the effect, I will allow pictures to paint the view for you.    Dinner was at Bonkers, a local restaurant with very good food. All of us were pleased, with the meal and the chocolate desserts.              Ed and Chris.   June 1","contentWithMarkup":"Page, Arizona. Wednesday May 30\n\n\n\n\nChris and I were the good ones, getting up at 4:15 A.M. to view a Grand Canyon sunrise. Frankly, we should have stayed in bed. It was alright, but not dramatic. Too many clouds and not much red and orange to make the sunrise stand out. Still, we were proud of ourselves for getting up and walking to the Trail View Overlook for the sunrise.\n\n\n\n\n\nTrail View Overlook is on the Hermits Rest rim trail. Cars are not allowed there most of the year; you either walk or take the shuttle. Hermit’s Rest juts out into the canyon so it is a good trail to use for sunrise viewing. Trail View is named because you can look down onto Bright Angel Trail, the trail taken by mules and most people hiking on the trail. Readers of the blog have read that I have vertigo now so walking along that trail is just not something on my agenda. Even at 5 AM we saw people beginning the hike.  It usually takes twice as long to hike back up as it does to go down. You can choose just to walk a short portion, no pressure to do it all.\n\n\n\nThe four of us had breakfast and left a little before ten on our drive to Page, AZ. We stopped at two other overlooks on the way out. The view can change from stopping point to stopping point. Views of the Colorado River are infrequent; it is a mile down and the canyon is 10 to 12 miles wide here. The canyon twists and turns and canyon walls and lesser eroded walls block your view. During the 24 hours we were here, and including sunrise and sunset, I did not find the canyon as colorful as is frequently portrayed in paintings and photographs. Outstanding and awe-inspiring, yes. \n\nOn the drive to Page we stopped at McAllister’s Deli at Cameron. This interchange in the middle of nowhere has been improved with a roundabout and new restaurants and gas stations. Our destination was to reach Ken’s Tours at Lower Antelope Canyon by 2 PM. There are tours for Upper and Lower Antelope Canyon. Both are located on Navajo reservation land and the guides are Navajo. We prefer the Lower Antelope tours since: a. You do not have to ride an open air Jeep on dusty roads to reach the canyon; b. The walk through the canyon is one-way, you do not have to jostle and deal with people coming at you in order to take your photos. \n\nThe tour takes an hour to an hour and a half. The canyon is formed by rushing waters after the monsoon season (July and August) rains erode away the sandstone. It is called a slot canyon, it is wider at the bottom and narrower at the top. As you walk through, watching for low overhangs and protruding walls, you are amazed by the wavy designs and formations observable all around you. There are also metal stairs that must be dealt with as you enter and a few times through the canyon. \n\nChris and I had been here once before, it was the first time for Deb and Rebecca. My words are poor efforts to describe the effect, I will allow pictures to paint the view for you. \n \nDinner was at Bonkers, a local restaurant with very good food. All of us were pleased, with the meal and the chocolate desserts.\n\n\n\n\n\n\n\n\n\n<img src=\"https://ckeh.files.wordpress.com/2018/06/6919a5cf-00e2-481b-b758-910ea8f77878.jpeg?w=690\" alt=\"\" width=\"690\" height=\"518\" class=\"aligncenter size-large wp-image-9036\" />\n\n\n\nEd and Chris.   June 1","tags":["road trip","travel","Grand Canyon","Ken's Lower Antelope Tours","Lower Antelope Canyon"],"publishedDate":"2018-06-02T21:24:57Z","harvestDate":"2018-06-02T21:25:03Z","estimatedPublishedDate":"2018-06-02T21:24:57Z","url":"http://ct.moreover.com/?a=34207114468&p=1u0&v=1&x=fBUIlFFx67qmiAe3IRo7kw","originalUrl":"https://ckeh.wordpress.com/2018/06/02/2018-trip-4-arizona-may-30/","outboundUrls":[],"wordCount":"575","dataFormat":"text","duplicateGroupId":"34207114468","media":{"audio":[],"images":[{"url":"https://ckeh.files.wordpress.com/2018/06/6919a5cf-00e2-481b-b758-910ea8f77878.jpeg?w=690"}],"video":[],"logo":[]},"publishingPlatform":{"itemId":"9018"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Ed Heimel and Chris Klejbuk, MN travel bloggers","publishingPlatform":{"userId":"42367403"}},"licenses":[],"source":{"name":"Chris and Ed travel adventure","homeUrl":"https://ckeh.wordpress.com","location":{},"feed":{"id":"320258874","name":"Chris and Ed travel adventure","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"42950545","generator":"http://wordpress.com/","description":"Follow us as we explore the USA and Canada. Trips began in 2013. 2013 through 2017 trips are now in archives. See sidebar.   2018 trips begin with short trip Jan.7 with a later trip in January to Boston. Longer trips to KY-Tn begin mid-March with a trip t","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":["ugc food feeds","ugc recreation feeds"]}},"es_id":86990489}