{"sequenceId":"845362053057","id":"34207105964","language":"English","title":"Bluff The Listener","content":"Listen Listening... / Originally published on June 2, 2018 10:46 am Copyright 2018 NPR. To see more, visit http://www.npr.org/. BILL KURTIS: From NPR and WBEZ Chicago, this is WAIT WAIT...DON'T TELL ME, the NPR news quiz. I'm Bill Kurtis. And here is your host at the Chase Bank Auditorium in Chicago, Peter Segal. PETER SAGAL, HOST: Thank you, Bill. So... (APPLAUSE) SAGAL: Thank you, everybody. So for all the years we've been doing this show, people have told us how much their kids love us. We find this flattering and a little alarming. (LAUGHTER) SAGAL: Where are the parents? (LAUGHTER) KURTIS: Where are the parents? SAGAL: So just a few months ago, after years of requests, we did a special show just for kids and their families at the Athenaeum Theatre here in Chicago. For our Bluff game, we invited kids to collaborate with our three panelists to come up with their stories. And we asked the whole audience to pick the real one. Then we invited Neil Patrick Harris, who started his career as a kid, to be our guest for Not My Job. So here is Wait Wait Jr. (SOUNDBITE OF ARCHIVED BROADCAST) SAGAL: What is the topic? KURTIS: It's a new world record. SAGAL: Amazing, astounding, astonishing, spectacular, stupendous, extraordinary world records are set all the time. Why, I just broke the world record for most unnecessary words in a single sentence. Now this week, we read about someone else achieving a very surprising world record, one we didn't even know existed. Our panelists and their junior writing assistants are going to tell you all about it. Pick the one you think is telling the truth - is the true story. And that junior will win our prize, the voice of their choice on their voicemail. You guys ready to play? (APPLAUSE) SAGAL: All right. Let's have our first junior partner. Welcome, please, Jack (ph), who worked with Paula. (APPLAUSE) SAGAL: Hey, Jack. I don't want to get in your way. Please proceed. JACK: The U.S. Postal Service held a mail delivery Olympics last month to determine who could service the most mailboxes in one hour. They drove their regular routes. And after 60 minutes, the trucks were shut down remotely by Olympic officials. Ten-year USPS veteran mail carrier Jake Jonah (ph) was the champion. He beat former champion Lawrence Jefferson (ph), who lost the title because paparazzi kept getting in his way. (LAUGHTER) JACK: Mr. Jonas successfully opened 4,017 mailboxes in the time limit. Quote... PAULA POUNDSTONE: \"Of course, Jonah serviced more mailboxes than I did...\" JACK: Said Mr. Jefferson in aggrievance. He had already filed with the mail delivery Olympics committee. POUNDSTONE: \"His route is in New York City. Mine's in Nebraska.\" (LAUGHTER) JACK: Some of the other events in mail delivery Olympics include mail sorting, mail stamping and outrunning crazy pugs. (APPLAUSE) SAGAL: A record set in mailboxes serviced by postal agents. OK, your next story of a new world record. Please welcome Ava (ph). Ava, come on out. Ava... (APPLAUSE) MO ROCCA: Yes, yes. SAGAL: Ava, who is 11, worked with... ROCCA: Yes. SAGAL: ...Mo Rocca. Go ahead, Ava. AVA: Last month in South Bend, Ind., a world record was broken. The world's biggest Dog Fashion Show took place at Potawatomi Park with a total of 602 dogs attending - yes, attending, not modeling. Their owners were happy to dress up in dog-themed designer clothing. Mei Ling (ph), a Chicago bank executive by day, had never modeled before. I was a little nervous to model the first ever avant-garde dogbone dress for my twin schnauzers, Molly (ph) and Heidi (ph), she said. I hope they were impressed. Molly's reaction... ROCCA: (Imitating dog). AVA: Roughly translates to - I was surprised my owner could look so delectable. I wanted to run up there and lick her. (LAUGHTER) AVA: Heidi's review? ROCCA: (Imitating dog). AVA: Roughly translates to - meh, I only came for the free poop bags. (LAUGHTER) AVA: Haute dog couture designer Wythe Anderson (ph) bluntly assessed the good and the bad from the show. The good, of course, he said, the avant-garde dogbone dress had that sit-and-stay flair. Let's just say the dogs weren't the only ones drooling over that. (LAUGHTER) AVA: The bad - the bias cut dog bed skirt was ridiculously uninspired, he said - a complete snooze. While the show was mostly a success, it ended in chaos when an owner, going by the name Pauly Poundsteen (ph)... (LAUGHTER) AVA: ...Went down the runway dressed up as a cat. Don't blame me, she said. It's called a catwalk for a reason. (APPLAUSE) SAGAL: The world's biggest dog-inspired fashion show. And your last story of an incredible achievement in setting a world record - please welcome Dhara and his sister Mila. Come on out, Dhara and Mila. (APPLAUSE) SAGAL: Now Dhara and Mila worked on their story with Maz Jobrani because A - he was the last one left. And also, he's their father. (LAUGHTER) SAGAL: Dhara and Mila, have you ever been on stage with your father before? MILA JOBRANI: Yeah. DHARA JOBRANI: Yeah, a lot of times. SAGAL: A lot of times? POUNDSTONE: Really? (LAUGHTER) MAZ JOBRANI: No, I do standup. So they always come up at the end. SAGAL: Oh, I see. JOBRANI: Yeah, not always. SAGAL: When he does standup, does he ever let you tell any jokes? DHARA: One time. MILA: Yeah. SAGAL: Was it a good joke? No. DHARA: No, not really. (LAUGHTER) SAGAL: He didn't give you the good material. JOBRANI: No, no. No, I'll tell you one time when Dhara was 6 months old... SAGAL: Yeah. JOBRANI: ...I was doing this event when there's a lot of really young kids. So my material was not really translating. So I was trying to tell whatever joke I could. And I had Dhara strapped in a Babybjorn. And I'm telling my jokes. And I'm - it's lukewarm. And then suddenly, the crowd just laughs. And I go, well, that was weird. It wasn't set up, wasn't a joke. What happened? And I looked down and he had puked. (LAUGHTER) JOBRANI: And it got the biggest laugh... SAGAL: Yeah. JOBRANI: ...Of the day. SAGAL: Yeah. JOBRANI: So yeah, he's... SAGAL: Everybody's a critic, I guess, right? JOBRANI: Yeah. (LAUGHTER) SAGAL: OK. So here - everybody, here is your last story of a world record. Dhara, Mila, Maz, go ahead. JOBRANI: OK. Anyone who's ever stumbled barefoot on a few tiny blocks of Legos knows that it can be one of the most painful sensations known to man. So when Russell Cassevah (ph) of Chesapeake, Va., decided to break the world record of longest barefoot walk over loose Legos, the foot doctor examining him before wondered aloud if Cassava would be better off seeing a psychiatrist. Turns out, Cassava, who broke the record by walking barefoot over 120 feet of Lego bricks wasn't crazy after all. He was inspired to break the record to raise donations for a charity in England named Fairy Bricks, who had 2,000 Lego sets stolen from their truck as they were being delivered to sick children in hospitals last November. ROCCA: OK. First of all, who's going around stealing Legos headed to sick children in hospitals? Has Darth Vader decided to build his next death star out of Legos? (LAUGHTER) DHARA: Secondly, there's only less painful ways to raise awareness for a charity. How about banging your head on a wall until people donate? (LAUGHTER) JOBRANI: Cassava filmed his record-breaking walk and posted it on YouTube. At the end, he could be seen crying. But the verdict is out if they're tears of joy for breaking the record or tears of pain for breaking his feet. When reached for comment, a 7-year-old girl who saw the video said... MILA: That dude needs a foot massage. (LAUGHTER) JOBRANI: And a 9-year-old boy who saw the video said... DHARA: Why would he put it on YouTube? As if the poor man hasn't suffered enough, now he's got to read YouTube comments. (LAUGHTER) JOBRANI: And somewhere in India, a guru, who walks on hot coals and broken glass, is thinking, Americans - so spoiled. They walk on their own toys. (LAUGHTER) SAGAL: All right. (APPLAUSE) SAGAL: So we're going to review your choices. First, from Jack and Paula, that was a story of a world record set in mail delivery during a competition for mail delivery. Then from Ava and Mo, the biggest ever dog-inspired fashion show in which people dressed up... POUNDSTONE: (Laughter). SAGAL: ...In dog-inspired fashions. And finally, from Maz and his two kids, the story of a guy who broke the world record for walking on Lego barefoot. Here we go. First, who thinks that Jack and Paula were telling the truth? (APPLAUSE) SAGAL: All right, all right. I hear that. Who thinks that Mo and Ava were telling the truth? (APPLAUSE) SAGAL: Don't distort the results, Mo. (LAUGHTER) SAGAL: And finally, who thinks that Maz, Dhara and Mila are telling the truth? (CHEERING) SAGAL: Yeah. All right. That seemed pretty obvious that the choice was Maz, Dhara and Mila, OK? I think everybody agrees that was the choice, right? (APPLAUSE) SAGAL: OK. Well, to bring everybody the truth - this is great - we actually got in touch with the person who set the record. RUSSELL CASSEVAH: I actually had walked across 120 feet of Lego barefoot. (APPLAUSE) SAGAL: That was Russell Cassevah, the man who walked across 120 feet of Lego in his bare feet, setting a record and never wanting to see a Lego again. Congratulations to Maz, Dhara and Mila for telling the truth. (APPLAUSE) SAGAL: But let's hear it for Ava and Mo and Jack and Paula for coming up with (unintelligible). Good job, guys. (APPLAUSE) Transcript provided by NPR, Copyright NPR. TweetShareGoogle+Email","contentWithMarkup":"Copyright 2018 NPR. To see more, visit BILL KURTIS: From NPR and WBEZ Chicago, this is WAIT WAIT...DON'T TELL ME, the NPR news quiz. I'm Bill Kurtis. And here is your host at the Chase Bank Auditorium in Chicago, Peter Segal. PETER SAGAL, HOST: Thank you, Bill. So... (APPLAUSE) SAGAL: Thank you,...<div class=\"feedflare\">\n<a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=8w8b1Mw74rE:eQ_h6YCgazs:I9og5sOYxJI\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?d=I9og5sOYxJI\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=8w8b1Mw74rE:eQ_h6YCgazs:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?d=qj6IDK7rITs\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=8w8b1Mw74rE:eQ_h6YCgazs:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?i=8w8b1Mw74rE:eQ_h6YCgazs:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=8w8b1Mw74rE:eQ_h6YCgazs:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?d=yIl2AUoC8zA\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/GPBNewsFeed/~4/8w8b1Mw74rE\" height=\"1\" width=\"1\" alt=\"\"/>","tags":[],"publishedDate":"2018-06-02T12:49:00Z","harvestDate":"2018-06-02T21:22:57Z","estimatedPublishedDate":"2018-06-02T12:49:00Z","url":"http://ct.moreover.com/?a=34207105964&p=1u0&v=1&x=baZG00GnY6UAx7v-xODMDg","originalUrl":"http://gpbnews.org/post/bluff-listener-6","outboundUrls":["https://ondemand.npr.org/npr-mp4/npr/waitwait/2018/06/20180602_waitwait_02.mp4?orgId=1&d=558&p=35&story=615975708&ft=nprml&f=615975708","http://twitter.com/intent/tweet?url=http%3A%2F%2Fwww.tinyurl.com%2Fyb722ph3&text=Bluff%20The%20Listener","http://facebook.com/sharer.php?u=http%3A%2F%2Fwww.tinyurl.com%2Fyb722ph3&t=Bluff%20The%20Listener","https://plus.google.com/share?url=http%3A%2F%2Fwww.tinyurl.com%2Fyb722ph3","http://www.npr.org/","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=8w8b1Mw74rE:eQ_h6YCgazs:I9og5sOYxJI","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=8w8b1Mw74rE:eQ_h6YCgazs:qj6IDK7rITs","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=8w8b1Mw74rE:eQ_h6YCgazs:F7zBnMyn0Lo","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=8w8b1Mw74rE:eQ_h6YCgazs:yIl2AUoC8zA"],"wordCount":"1620","dataFormat":"text","duplicateGroupId":"34196717784","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"Chesapeake","symbol":"CPKB","exchange":"PINX","isin":"US1651311037","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"editor","publishingPlatform":{}},"licenses":[],"source":{"name":"GPB News Feed","homeUrl":"http://gpbnews.org","location":{},"feed":{"id":"186192773","name":"GPB News Feed","mediaType":"Blog","publishingPlatform":"NPR","generator":"NPR Digital Services RSS Generator 0.94","description":"Georgia Public Broadcasting gives you the latest statewide news, features, sights and sounds, all through our redesigned website at http://www.gpb.org/news!","tags":["News & Politics"],"imageUrl":"http://www.npr.org/images/stations/redesign/wjsp_fm.gif","copyright":"℗ & © 2010 Georgia Public Broadcasting","language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"27391","inboundLinkCount":"19"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990144}