{"sequenceId":"845362054118","id":"34207105976","language":"English","title":"Anthony Horowitz On 'The Word Is Murder'","content":"Listen Listening... / Copyright 2018 NPR. To see more, visit http://www.npr.org/. SCOTT SIMON, HOST: Anthony Horowitz has a lot of blood on his hands. He created several television series, including \"Foyle's War,\" which dispatched a lot of people, and has written \"Magpie Murders,\" \"Trigger Mortis\" and other best-selling crime novels. His new novel opens with a widowed socialite named Diana Cowper, who makes arrangements for her own funeral, when the time comes. Her time comes just a few hours later. Diana Cowper is found choked to death with a scarlet curtain cord in her own home. The novelist himself becomes a character when an aging misfit of a rummy ex-London cop named Hawthorne approaches Horowitz, the novelist, to chronicle how Hawthorne, the gumshoe, can crack the Cowper case and regain respectability. Well, is there anything more important to a Briton than that? \"The Word Is Murder\" is Anthony Horowitz's new novel. He joins us from London. Thanks so much for being with us. ANTHONY HOROWITZ: It's a pleasure. Thank you. And what a wonderful way to describe my book. I so enjoyed that. SIMON: Oh, thank - well, I enjoyed the book. Now do we interview you as Horowitz, the novelist who created Hawthorne, or Horowitz, the novelist who is in this novel? HOROWITZ: I think you'll probably have more luck if you go for the novelist. SIMON: OK. So is it fun to make yourself a character? HOROWITZ: It was certainly very interesting. I mean, when I was approached by one of my editors to do a new series of murder mysteries, and I hope this is the first of many, I was looking for a way to sort of turn the whole formula - the format upside down. And by putting myself into the book, I suddenly realized that everything I wrote would be different, that my view of the landscape would be different, that I would have no knowledge of what was happening, when, of course, normally, the author knows everything. SIMON: Is it irresistible to give yourself some of the best lines? HOROWITZ: I had to be very careful, actually, to make sure that I was not the center of attention in this book. I am Watson, not Holmes. I'm merely the narrator, and it is Hawthorne who is the hero. And he, I'm afraid, definitely gets the best lines. SIMON: At the same time, Hawthorne can be a difficult guy to like, can't he? HOROWITZ: Well, that's one of the sort of fun aspects of writing it, which is the hero's a character that I suppose I've created. And yet, at the same time, I just don't get on with him. He has some views which I find very distasteful. He's not the easiest of men. That said, I think in the book, there is a growing warmth between us. I think it would be impossible to read a book in which the hero did not have some sort of likability. And one of the things that it provokes is a desire in me, the narrator, to try and find out more about him, the detective, which will lead to an investigation that will continue through the series. SIMON: Let me ask you about Diana Cowper. As it turns out, without giving anything away, she has a dark incident in her past, doesn't she? HOROWITZ: Yes, that's right. This is a classic whodunit sort of trope, whereby the main character, who seems blameless in the first few chapters, has got a dark secret lurking in the past, which may or may not have something to do with her demise. SIMON: And she sends a text message, as it turns out, shortly before her death that would encourage you to look in that direction. Would that be fair to say? HOROWITZ: (Laughter) Yeah. That's right. I love Agatha Christie. And this is really sort of an Agatha Christie-style murder mystery in many, many respects. But I have things that Christie did not. I have modern technology, and so the books are going to be full of things like text messages, emails. I have an idea for a murder that is based on a selfie that somebody takes. So using modern technology in an old-fashioned format gives me a smile. SIMON: I've heard interviews with you, Mr. Horowitz, in which you say that writing saved you. HOROWITZ: Yes, it is absolutely true. I mean, I had a very unusual upbringing as a child. My parents are very wealthy, and I never say that I had an unhappy childhood. I don't like to hear those words come out of my mouth with the knowledge that there are many, many children in the world who have childhood that is much, much less privileged than mine ever was. But nonetheless, I had wealthy parents who sent me to a particularly horrible boarding school in North London. Talk to many men in this country - my country - of this sort of experience - their education between the age of 8 and 13, and you'll find the same stories of abuse - physical, mental, sexual - all these things. Though a lot of those, fortunately, never came my way. But - and what saved me was, aged about 10, first discovering the library and books, and realizing that a book is a door that can open and take you into a fantastic different world. And then, finally, it was here that I had a facility for telling stories. At that age - same age - 10, I was telling stories to the other children in the dormitory. We used to sleep, each of us in the same room - all 10 of us, whatever. And telling stories to a lot of frightened kids helped them escape, too. And it was then that I discovered that despite what my teachers had told me, which was that I was fundamentally useless, that I did have a talent. I had a skill. And I determined at that age that I would pursue it all my life, and that is what I've always done. SIMON: And, if I may, there was kind of a family scandal that hit you when you were a young man, wasn't there? HOROWITZ: My father was connected with politicians and quite powerful businessmen. And what happened was that he died bankrupt, having put his money into a bank without telling my mother which bank it was. So she went from being a wealthy, socialite wife to being a bankrupt widow, you know, in a minute. And that changed the trajectory of all of our lives. SIMON: I wonder if that put, in your mind, a determination to kind of get to the bottom of things in your stories. HOROWITZ: Well, my mother spent an awful lot of time looking for this money. And I remember that she found my father's notebooks full of code words and strange hieroglyphics and symbols and this and that and names of things, and went to Switzerland many, many times trying to find it because she was being pursued by a large number of companies to whom my father had owed money. So it was a very traumatic time for her. But that's one mystery and one investigation that has never touched me. I didn't want to know anything about it at the time. I was too traumatized by the events anyway. And I would say one other thing, as I talk about my father, which I find myself - which I think I need to say is that he also did have a wonderful love of books. I still own the library that he had. And my love of Anthony Trollope and Charles Dickens and Jane Austen as well all came from him, so I wouldn't want to give the impression that he was simply a man who was motivated by money. SIMON: I don't get a chance to ask this question of many people. How many people do you think you've killed? HOROWITZ: (Laughter), Well, it says on the back of my books I've probably killed more people than anyone alive. And all of these are, of course, fictitious. But if you then add in all my children's books, the Alex Rider books, the James Bond books, the murder mysteries, \"Foyle's War,\" even, it's a very, very high body count, I'm afraid. SIMON: So do you drift to sleep thinking of ways to dispatch of people? HOROWITZ: Broadly speaking, I'm more interested in clues, relationships and puzzles and riddles and pulling the wool over people's eyes and in revealing things in a way that will make the reader smile. So the actual murder method itself is sometimes less significant. SIMON: Why are villains often more fascinating to us than heroes? And is that part of what afflicts the human condition? HOROWITZ: Evil does have an attractive quality. I think doing something bad, being mean, breaking the law has a strange visceral appeal. Maybe it's something to do with liberty - the fact that being bad sets us free because we're not obeying rules, we're breaking them. I don't know. I mean, in my life, I try to do good, but I'm often tempted by bad. And it's certainly true that when I'm writing a book, the villain is the one that I enjoy creating most. SIMON: Anthony Horowitz - his novel \"The Word Is Murder\" - thanks so much for being with us. HOROWITZ: I've really enjoyed it. Thank you. (SOUNDBITE OF MUSIC) Transcript provided by NPR, Copyright NPR. TweetShareGoogle+Email","contentWithMarkup":"Copyright 2018 NPR. To see more, visit SCOTT SIMON, HOST: Anthony Horowitz has a lot of blood on his hands. He created several television series, including \"Foyle's War,\" which dispatched a lot of people, and has written \"Magpie Murders,\" \"Trigger Mortis\" and other best-selling crime novels. His...<div class=\"feedflare\">\n<a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=LvzN9EMoBXM:BTOFV-lmP6o:I9og5sOYxJI\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?d=I9og5sOYxJI\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=LvzN9EMoBXM:BTOFV-lmP6o:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?d=qj6IDK7rITs\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=LvzN9EMoBXM:BTOFV-lmP6o:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?i=LvzN9EMoBXM:BTOFV-lmP6o:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=LvzN9EMoBXM:BTOFV-lmP6o:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?d=yIl2AUoC8zA\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/GPBNewsFeed/~4/LvzN9EMoBXM\" height=\"1\" width=\"1\" alt=\"\"/>","tags":[],"publishedDate":"2018-06-02T12:28:00Z","harvestDate":"2018-06-02T21:22:58Z","estimatedPublishedDate":"2018-06-02T12:28:00Z","url":"http://ct.moreover.com/?a=34207105976&p=1u0&v=1&x=ceEnXT0ZJ1yy6Iyt0C275Q","originalUrl":"http://gpbnews.org/post/anthony-horowitz-word-murder","outboundUrls":["https://ondemand.npr.org/npr-mp4/npr/wesat/2018/06/20180602_wesat_book-_the_word_is_murder.mp4?orgId=1&topicId=1033&d=437&p=7&story=616392736&ft=nprml&f=616392736","http://twitter.com/intent/tweet?url=http%3A%2F%2Fwww.tinyurl.com%2Fy98x95jh&text=Anthony%20Horowitz%20On%20%27The%20Word%20Is%20Murder%27","http://facebook.com/sharer.php?u=http%3A%2F%2Fwww.tinyurl.com%2Fy98x95jh&t=Anthony%20Horowitz%20On%20%27The%20Word%20Is%20Murder%27","https://plus.google.com/share?url=http%3A%2F%2Fwww.tinyurl.com%2Fy98x95jh","http://www.npr.org/","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=LvzN9EMoBXM:BTOFV-lmP6o:I9og5sOYxJI","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=LvzN9EMoBXM:BTOFV-lmP6o:qj6IDK7rITs","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=LvzN9EMoBXM:BTOFV-lmP6o:F7zBnMyn0Lo","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=LvzN9EMoBXM:BTOFV-lmP6o:yIl2AUoC8zA"],"wordCount":"1575","dataFormat":"text","duplicateGroupId":"34200750444","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Crime and punishment news","group":"Society"}],"companies":[{"name":"Modern Technology Corp","symbol":"MODC","exchange":"PINX","isin":"US6076973071","titleCount":0,"contentCount":2,"primary":true}],"author":{"name":"editor","publishingPlatform":{}},"licenses":[],"source":{"name":"GPB News Feed","homeUrl":"http://gpbnews.org","location":{},"feed":{"id":"186192773","name":"GPB News Feed","mediaType":"Blog","publishingPlatform":"NPR","generator":"NPR Digital Services RSS Generator 0.94","description":"Georgia Public Broadcasting gives you the latest statewide news, features, sights and sounds, all through our redesigned website at http://www.gpb.org/news!","tags":["News & Politics"],"imageUrl":"http://www.npr.org/images/stations/redesign/wjsp_fm.gif","copyright":"℗ & © 2010 Georgia Public Broadcasting","language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"27391","inboundLinkCount":"19"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990150}