{"sequenceId":"845366345448","id":"34207239808","language":"English","title":"Like a Bridge Over...","content":"\"Can you show me what it feels like to want to hold more?\"  Her simple question cut through my inability to articulate this recently growing feeling: the human experience is limiting for all I want to hold.  Though we don't get a choice on our form, lately I've earnestly wondered if I should have been something else.  Maybe a tree, a color, a sound...anything more expansive, closer to timeless.  I rose from my chair in my bodyworker's office.  I listened for a moment.  A picture flitted across my mind of a rope bridge, strung between two cliffs.  Before I had time to question it, I backed up to the bookcase, bent at the waist, and rested my arms over her massage table a few feet away.  It didn't just feel good, it felt right.  I could have stopped there, but some vague anxiety propelled me to the vertical plane again.  I attempted to make more container like shapes with my body, things with angles and storage space.  Not only was it not as satisfying, but my feet, ankles, and calves continued to roll out into roundness.  Before I could make a conscious decision to surrender, I had already folded back into a bridge.  I let my spine drop, I exhaled, and after a moment, I stood.  The rest of our session continued along other paths, but this question has stuck with me: what is the difference between holding and bridging?  And have I been trying to be a holder when I actually want to be a bridge?  After all, there are similarities.  Bridges and various holding vehicles are both forms of transport.  As such, they both bear weight, and they both free up the transported to be involved in other activities.  Neither means of transport changes the actual landscape.  In other words, you're not automatically safer in a car than on a bridge.  Beyond that, I could think of only differences.  You are in contact with more of the air and the view when crossing a bridge on foot.  Thus, you can't artificially change the temperature with an air conditioner or heater, and you can't dampen or change the sound unless you yourself stop singing, praying, talking.  There's a sturdiness, an integrity to your senses, as they report what's around you.  In short, that which is, reaches you more quickly.  As you access your experience directly, you have no choice but to depend on yourself more.  Your body registers the sway and adjusts your walk accordingly.  Your hands are no longer steering an unfeeling machine or sitting in your lap.  As they hold the ropes, they are measuring the tension, the pulse between two worlds.  And there are no external rules to dictate your speed.  You can go slow, fast, or get out of the way for as long as you want while others pass you.  This makes crossing a bridge infinitely scarier.  The sun could burn you, the bugs could bite you, the waters could wash you away.  And if you fall?  There is time to consider what went wrong, unlike the instant ending of a car crash.  Scarier still?  You bear much more of the responsibility for the fall off of a bridge.  There are no airbags or manufacturers to blame, no institutions who should have protected you.  It may start to feel like a lonely metaphor, but what if we widened the bridge?  What if we put dozens of bridges next to each other--zigzag, crisscross, loops?  Last summer I went through the zip line course at Mt. Hermon.  I was struck by the level of support offered by strangers as I got ready to cross each chasm on my own, as well as the sounds of others unseen, racing through trees and over bridges all around me.  Can we direct our own experience, but still be in community?  What would it be like to travel my life this way?  What would it be like to give this gift to others?  As always, I have more questions than answers.  But after three years conscious movement practice I know this: when you change the way you move, the answers are less important.  There is a call, and then there is endless, endless exploration.","contentWithMarkup":"\"Can you show me what it feels like to want to hold more?\"\n\nHer simple question cut through my inability to articulate this recently growing feeling: the human experience is limiting for all I want to hold.  Though we don't get a choice on our form, lately I've earnestly wondered if I should have been something else.  Maybe a tree, a color, a sound...anything more expansive, closer to timeless.\n\nI rose from my chair in my bodyworker's office.  I listened for a moment.  A picture flitted across my mind of a rope bridge, strung between two cliffs.  Before I had time to question it, I backed up to the bookcase, bent at the waist, and rested my arms over her massage table a few feet away.\n\nIt didn't just feel good, it felt <em>right</em>.  I could have stopped there, but some vague anxiety propelled me to the vertical plane again.  I attempted to make more container like shapes with my body, things with angles and storage space.  Not only was it not as satisfying, but my feet, ankles, and calves continued to roll out into roundness.  Before I could make a conscious decision to surrender, I had already folded back into a bridge.  I let my spine drop, I exhaled, and after a moment, I stood.\n\nThe rest of our session continued along other paths, but this question has stuck with me: what is the difference between holding and bridging?  And have I been trying to be a holder when I actually want to be a bridge?\n\nAfter all, there are similarities.  Bridges and various holding vehicles are both forms of transport.  As such, they both bear weight, and they both free up the transported to be involved in other activities.  Neither means of transport changes the actual landscape.  In other words, you're not automatically safer in a car than on a bridge.\n\nBeyond that, I could think of only differences.\n\nYou are in contact with more of the air and the view when crossing a bridge on foot.  Thus, you can't artificially change the temperature with an air conditioner or heater, and you can't dampen or change the sound unless you yourself stop singing, praying, talking.  There's a sturdiness, an integrity to your senses, as they report what's around you.  In short, that which is, reaches you more quickly.\n\nAs you access your experience directly, you have no choice but to depend on yourself more.  Your body registers the sway and adjusts your walk accordingly.  Your hands are no longer steering an unfeeling machine or sitting in your lap.  As they hold the ropes, they are measuring the tension, the pulse between two worlds.  And there are no external rules to dictate your speed.  You can go slow, fast, or get out of the way for as long as you want while others pass you.\n\nThis makes crossing a bridge infinitely scarier.  The sun could burn you, the bugs could bite you, the waters could wash you away.  And if you fall?  There is time to consider what went wrong, unlike the instant ending of a car crash.  Scarier still?  You bear much more of the responsibility for the fall off of a bridge.  There are no airbags or manufacturers to blame, no institutions who should have protected you.\n\nIt may start to feel like a lonely metaphor, but what if we widened the bridge?  What if we put dozens of bridges next to each other--zigzag, crisscross, loops?  Last summer I went through the zip line course at Mt. Hermon.  I was struck by the level of support offered by strangers as I got ready to cross each chasm on my own, as well as the sounds of others unseen, racing through trees and over bridges all around me.\n\nCan we direct our own experience, but still be in community?\n\nWhat would it be like to travel my life this way?\n\nWhat would it be like to give this gift to others?\n\nAs always, I have more questions than answers.  But after three years conscious movement practice I know this: when you change the way you move, the answers are less important.  There is a call, and then there is endless, endless exploration.","tags":["bridge","embodiment","holding","spine"],"publishedDate":"2018-06-02T21:55:53Z","harvestDate":"2018-06-02T21:55:58Z","estimatedPublishedDate":"2018-06-02T21:55:53Z","url":"http://ct.moreover.com/?a=34207239808&p=1u0&v=1&x=ssju89xH9IH01w7YU3faLA","originalUrl":"https://chelseadelaney79.wordpress.com/2018/06/02/like-a-bridge-over/","outboundUrls":[],"wordCount":"704","dataFormat":"text","duplicateGroupId":"34207239808","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"3318"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"chelseadelaney79","publishingPlatform":{"userId":"94692674"}},"licenses":[],"source":{"name":"It's Time","homeUrl":"https://chelseadelaney79.wordpress.com","location":{},"feed":{"id":"557215143","name":"It's Time","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"99452585","generator":"http://wordpress.com/","description":"Learning transitions, entertaining 'what ifs', defining now for myself...","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"9","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994285}