{"sequenceId":"845365554584","id":"34207218918","language":"English","title":"Report: Klay Thompson receiving around-the-clock treatment to play in Game 2","content":"Report: Klay Thompson receiving around-the-clock treatment to play in Game 2 Originally posted on Larry Brown Sports  |  By Grey Papke  |  Last updated 6/2/18 Tweet Thompson's ankle is the most important body part in Oakland right now. Kyle Terada-USA TODAY Sports Klay Thompson’s ankle situation is significant enough that he’s in a fight to play in Game 2 of the NBA Finals, according to a report. Shams Charania of Yahoo Sports reported Saturday that Thompson is dealing with a high ankle sprain and significant bruising stemming from a Game 1 collision with Cleveland’s J.R. Smith, and is being treated constantly to get through Game 2. Sources: Warriors star Klay Thompson is dealing with high left ankle sprain and significant bruising, receiving treatment around clock with plan to play in Game 2 of Finals. — Shams Charania (@ShamsCharania) June 2, 2018 The injury looked quite severe live, and Thompson was later diagnosed with a lateral leg contusion and returned to the game. Things appear to be more serious than initially reported. It sounds like Thompson will play, but he may not be pain-free and doesn’t appear likely to be 100 percent. Cavaliers News Delivered to your inbox You'll also receive Yardbarker's daily Top 10, featuring the best sports stories from around the web. Customize your newsletter to get articles on your favorite sports and teams. And the best part? It's free! By clicking \"Sign Me Up\", you have read and agreed to the Yardbarker Privacy Policy and Terms of Service. You can opt out at any time. For more information, please see our Privacy Policy. This article first appeared on Larry Brown Sports and was syndicated with permission. PLAYERS: J.R. Smith,  Tristan Thompson TEAMS: Cleveland Cavaliers MORE FROM YARDBARKER LeBron James says Game 1 loss was one of the toughest of his career Tyronn Lue won't be fined for critical comments Watch Draymond Green taunt LeBron James at end of game Report: Klay Thompson receiving around-the-clock treatment to play in Game 2 WATCH: Klay Thompson leaves Game 1 of NBA Finals with apparent knee injury NBA releases official two-minute report following Game 1 Andre Iguodala still considered day-to-day by Warriors, is improving Andre Iguodala doubtful for Game 2 of NBA Finals Ranking NFL head coaches heading into the 2018 season Report: Clay Matthews likely has broken nose after softball accident Watch: Clay Matthews hit in face by line drive during charity softball game LIKE WHAT YOU SEE? GET THE DAILY NEWSLETTER: WATCH: NFL explains use of helmet rule in new video WATCH: Clay Matthews takes liner off face in charity softball game Packers RB Aaron Jones sees his act of kindness go viral Ha-Ha Clinton-Dix skips Packers OTAs Former NBA player Matt Barnes gets sick Tupac tattoo Mariners use Smash Mouth song to troll fans into making their All-Star votes Mariners option Gordon Beckham to Triple-A Sports & Politics Intersect: POTUS trumped players in anthem policy decision Red Sox place Dustin Pedroia on 10-day DL AL MVP the year you were born Red Sox place Mookie Betts on 10-day DL Hanley Ramirez officially released by Red Sox Terrell Owens pitches his services to the 49ers MORE STORIES >> Sports & Politics Intersect: POTUS trumped players in anthem policy decision Minnesota Congressman vows to boycott NFL over ‘idiotic kneeling ban’ Rudy Giuliani has odd take on Yankees fans booing him at game Idaho AD has leave extended as probe into sexual assault handling continues The 'Man of steal' quiz Famous and obscure MLB records that could fall in 2018 22 MLB records that will never be broken in our lifetimes Best MLB player of all time drafted from every state Major League Baseball's 3,000-hit club Best first-round MLB Draft picks by slot First-round 2018 MLB Mock Draft Best first overall MLB Draft picks ever Athletes from other sports drafted by MLB teams Best MLB player of all time drafted from every state Best late-round steals in MLB Draft history Cities that have infamously lost franchises Top 10 MLB prospects who could make an impact in June Cardinals unlikely to put innings limit on Alex Reyes Dodgers promote highly-touted prospect Dennis Santana First-round 2018 MLB Mock Draft Best late-round steals in MLB Draft history The 'Who's your Vladdy?' quiz Three Up, Three Down: The MLB hot/cold report Mariners acquire Denard Span, Alex Colome in trade with Rays Rudy Giuliani has odd take on Yankees fans booing him at game Top 10 MLB prospects who could make an impact in June June entertainment planner: 'Jurassic World,' 'Sense8' and Kanye bring the summer heat The 20 movies you shouldn't sleep on this summer Five emerging artists to catch at Governors Ball 2018 Potential summer anthems for 2018 The Steelers should swallow their pride and pay Le'Veon Bell New Le'Veon Bell rap song sends strong message to Steelers Report: Bell seeking $17 million a year from Steelers Antonio Brown’s advice to RB: ‘Show up’ Steelers reportedly not expecting Bell to show until September No, veterans missing OTAs is not a big deal First-round 2018 NBA Mock Draft 2018 NBA Draft lottery prospect tiers Suns may target Doncic with No. 1 pick 10 sleepers to keep an eye on in the 2018 NBA Draft Ranking the No. 2 overall NBA Draft picks in the lottery era Will Germany's issues between the pipes prevent them from World Cup glory? 20 key questions entering the 2018 World Cup First-round 2018 MLB Mock Draft Best first overall MLB Draft picks ever Best late-round steals in MLB Draft history NBA Finals Preview: Can LeBron James beat the Warriors? LeBron has blunt take on idea Cavs vs. Warriors IV is bad for NBA Tyronn Lue still unsure of Kevin Love’s status for Game 1 Andre Iguodala ruled out for Game 1 Greatest games of the Warriors-Cavaliers showdowns in NBA Finals The 'Throne for a loop' quiz MORE STORIES >> Cavaliers News Delivered to your inbox You'll also receive Yardbarker's daily Top 10, featuring the best sports stories from around the web. Customize your newsletter to get articles on your favorite sports and teams. And the best part? It's free! By clicking \"Sign Me Up\", you have read and agreed to the Yardbarker Privacy Policy and Terms of Service. You can opt out at any time. For more information, please see our Privacy Policy. Follow us on Twitter Follow @Yardbarker BEST OF YARDBARKER Sports & Politics Intersect: POTUS trumped players in anthem policy decision Tweet Best first-round MLB Draft picks by slot Tweet Cities that have infamously lost franchises Tweet The 'Man of steal' quiz Tweet Three Up, Three Down: The MLB hot/cold report Tweet The 'King vs. Goliath' quiz Tweet NBA Finals Preview: Can LeBron James beat the Warriors? Tweet Top 10 MLB prospects who could make an impact in June Tweet The 'Hello, old friend' quiz Tweet June entertainment planner: 'Jurassic World,' 'Sense8' and Kanye bring the summer heat Tweet MORE BEST OF YARDBARKER >>","contentWithMarkup":"Klay Thompson’s ankle situation is significant enough that he’s in a fight to play in Game 2 of the NBA Finals, according to a report.Shams Charania of Yahoo Sports reported Saturday that Thompson is dealing with a high ankle sprain and significant bruising stemming from a Game 1 collision with Cleveland’s J.R. Smith, and is being treated constantly to get through Game 2. The injury looked quite severe live, and Thompson was later diagnosed with a lateral leg contusion and returned to the game. Things appear to be more serious than initially reported. It sounds like Thompson will play, but he may not be pain-free and doesn’t appear likely to be 100 percent.","tags":[],"publishedDate":"2018-06-02T20:20:03Z","harvestDate":"2018-06-02T21:50:53Z","estimatedPublishedDate":"2018-06-02T20:20:03Z","url":"http://ct.moreover.com/?a=34207218918&p=1u0&v=1&x=mf_b9Zc26p7wYVXkxoYFGA","originalUrl":"https://www.yardbarker.com/nba/articles/report_klay_thompson_receiving_around_the_clock_treatment_to_play_in_game_2/s1_127_26549282","outboundUrls":["http://larrybrownsports.com/basketball/klay-thompson-around-the-clock-treatment/447073","http://larrybrownsports.com/","http://twitter.com/share?count=horizontal&via=yardbarker","https://twitter.com/ShamsCharania/status/1003000662274146304?ref_src=twsrc%5Etfw","http://larrybrownsports.com/basketball/watch-klay-thompson-leaves-game-after-collision-with-jr-smith/446821","http://twitter.com/Yardbarker","https://twitter.com/share"],"wordCount":"1107","dataFormat":"text","duplicateGroupId":"34206734999","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"Altaba Inc","symbol":"AABA","exchange":"MEX","isin":"US0213461017","titleCount":0,"contentCount":1,"primary":true},{"name":"Altaba Inc","symbol":"AABA","exchange":"BUE","isin":"ARDEUT111051","titleCount":0,"contentCount":1,"primary":true},{"name":"Altaba Inc","symbol":"AABA","exchange":"NAS","isin":"US0213461017","titleCount":0,"contentCount":1,"primary":true},{"name":"Altaba Inc","symbol":"ALA","exchange":"BER","isin":"US0213461017","titleCount":0,"contentCount":1,"primary":true},{"name":"Altaba Inc","symbol":"ALA","exchange":"MUN","isin":"US0213461017","titleCount":0,"contentCount":1,"primary":true},{"name":"Altaba Inc","symbol":"ALA","exchange":"ETR","isin":"US0213461017","titleCount":0,"contentCount":1,"primary":true},{"name":"Altaba Inc","symbol":"ALA","exchange":"HAN","isin":"US0213461017","titleCount":0,"contentCount":1,"primary":true},{"name":"Altaba Inc","symbol":"AABA","exchange":"SWX","isin":"US0213461017","titleCount":0,"contentCount":1,"primary":true},{"name":"Altaba Inc","symbol":"ALA","exchange":"DUS","isin":"US0213461017","titleCount":0,"contentCount":1,"primary":true},{"name":"Altaba Inc","symbol":"ALA","exchange":"STU","isin":"US0213461017","titleCount":0,"contentCount":1,"primary":true},{"name":"Altaba Inc","symbol":"ALA","exchange":"HAM","isin":"US0213461017","titleCount":0,"contentCount":1,"primary":true},{"name":"Altaba Inc","symbol":"ALA","exchange":"FRA","isin":"US0213461017","titleCount":0,"contentCount":1,"primary":true},{"name":"Altaba Inc","symbol":"AABA","exchange":"LIM","isin":"US0213461017","titleCount":0,"contentCount":1,"primary":true},{"name":"Altaba Inc","symbol":"AABA","exchange":"SGO","isin":"US0213461017","titleCount":0,"contentCount":1,"primary":true},{"name":"Altaba Inc","symbol":"ATBA","exchange":"WBO","isin":"US0213461017","titleCount":0,"contentCount":1,"primary":true},{"name":"Altaba Inc","symbol":"AABA","exchange":"MIL","isin":"US0213461017","titleCount":0,"contentCount":1,"primary":true},{"name":"No.1 Co Ltd","symbol":"3562","exchange":"TKS","isin":"JP3653590004","titleCount":0,"contentCount":1,"primary":true}],"author":{"publishingPlatform":{}},"licenses":[],"source":{"name":"Yardbarker: Rumors and Gossip","homeUrl":"http://www.yardbarker.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"327833350","name":"Yardbarker: Rumors and Gossip","mediaType":"Blog","description":"Recent rumors and gossip","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"40009","inboundLinkCount":"10"},"inWhiteList":"true","autoTopics":["ugc management feeds","ugc sport feeds"],"editorialTopics":["Basketball","Sports","Consumer"]}},"es_id":86993744}