{"sequenceId":"845367341725","id":"34207263891","language":"English","title":"How Cowboys offense both turned predictable in 2017, switched it up","content":"Each new season brings a certain level of change, whether it’s the usual churning of the roster or a transition in the coaching staff. For teams with prolific offenses however, continuity becomes key.  There’s less of a reason to make changes just for change sake.  That was the case for Dallas after the 2016 season. They finished the year fifth in points scored with 421. Given the presumed development of quarterback Dak Prescott and continued proficiency of Ezekiel Elliott and the offensive line, making a significant change to the scheme wasn’t needed nor expected.  This was best illustrated by two fact. Fact one, virtually every offensive coaching post remained unaltered. Fact two, the Cowboys’ 2017 draft focused primarily on the defense. Only two of nine picks were offensive players, the first selected in the fourth round.  Again, continuity was key after a high-powered offensive performance in 2016.  But with continuity comes the potential for staleness and predictability. The danger in a lack of evolution is three-fold. Opposing defenses can  catch up, issues with availability can derail plans and player development isn’t always as smooth a climb as anticipated.  Earlier this offseason, Cowboys Wire revealed 10 tendencies of Dallas’ 2017 offense. Comparing those tendencies to the team’s more successful 2016 campaign highlighted three aspects of the Cowboys’ scheme where they were more predictable in Year 2 of the Prescott era. Cowboys NEVER passed from run formations inside FG range From inside the opponent’s 35-yard line in a formation that had three tight ends together on the line of scrimmage, Dallas ran 100 percent of the time in 2017. This was also the case when they were in a straight I-formation or offset I-formation.  These are the primary run formations. If they showed run, they ran.      This represented a 15 percent increase from 2016.  That year, the Cowboys ran the ball from a triple tight end formation 83.3 percent of the time, and 85.2 percent from an I-formation. Their run percentage inside field goal range from triple tight end sets was slightly less than it was outside field goal range.  There was a 12 percent increase in runs from I-formations from outside the 35-yard line to inside of it. In 2017, that difference was 25 percent.  In 2016, all passes inside scoring range from an I-formation were play-action passes, mostly bootlegs. Even though the sample size from this scenario was quite small (four), they scored two touchdowns, 50 percent of those plays. Could a slight variance in one’s run-heavy tendency have resulted in such an efficient scoring rate? Offense NEVER passed from run formations at end of halves In 2017, regardless of score or field position, the Cowboys ran 100 percent of the time when using 12, 13, 21, 22, or 6 OL personnel groupings with three minutes or less remaining in a half.  Even if they were behind by a touchdown or more, they always ran the ball from run-heavy personnel. That’s a 19 percent increase from the previous year.  In Prescott’s rookie year, the team ran 81 percent of the time in end-of-half situations while in multiple tight end or multiple running back personnel groupings. In 3x1 w/ TE as X-Iso, TUNNEL VISION on No.2, No. 3 WRs      Last year, the No. 2 and No. 3 receivers on the trips side were targeted 75 percent of the time inside field goal range.  Outside of the 35-yard line, that target rate dropped to 40 percent. For whatever reason, the offense appeared to lock onto those receivers in that part of the field.  Defensive coordinators key in on things like this.  Whereas in 2016, the target percentage was consistent regardless of field position. The No. 2 and No. 3 receivers were thrown to half the time when the offense aligned in a 3x1 set with the tight end as the X-iso receiver (1.2 times per game).  Everything wasn't all bad when it came to being predictable, however. Follow the jump to see two ways the offense kept defenses off balance.  [lawrence-newsletter]","contentWithMarkup":"Each new season brings a certain level of change, whether it’s the usual churning of the roster or a transition in the coaching staff. For teams with prolific offenses however, continuity becomes key.\n\nThere’s less of a reason to make changes just for change sake.\n\nThat was the case for Dallas after the 2016 season. They finished the year fifth in points scored with 421. Given the presumed development of quarterback Dak Prescott and continued proficiency of Ezekiel Elliott and the offensive line, making a significant change to the scheme wasn’t needed nor expected.\n\nThis was best illustrated by two fact. Fact one, virtually every offensive coaching post remained unaltered. Fact two, the Cowboys’ 2017 draft focused primarily on the defense. Only two of nine picks were offensive players, the first selected in the fourth round.\n\nAgain, continuity was key after a high-powered offensive performance in 2016.\n\nBut with continuity comes the potential for staleness and predictability. The danger in a lack of evolution is three-fold. Opposing defenses can  catch up, issues with availability can derail plans and player development isn’t always as smooth a climb as anticipated.\n\nEarlier this offseason, Cowboys Wire revealed <a href=\"https://cowboyswire.usatoday.com/2018/02/26/tipping-the-pitch-10-revealing-stat-tendencies-of-cowboys-offense/4/\" target=\"_blank\" rel=\"noopener\">10 tendencies of Dallas’ 2017 offense</a>. Comparing those tendencies to the team’s more successful 2016 campaign highlighted three aspects of the Cowboys’ scheme where they were more predictable in Year 2 of the Prescott era.\n<h1><strong>Cowboys NEVER passed from run formations inside FG range</strong></h1>\nFrom inside the opponent’s 35-yard line in a formation that had three tight ends together on the line of scrimmage, Dallas ran 100 percent of the time in 2017. This was also the case when they were in a straight I-formation or offset I-formation.\n\nThese are the primary run formations. If they showed run, they ran.\n\n\n\n\n\nThis represented a 15 percent increase from 2016.\n\nThat year, the Cowboys ran the ball from a triple tight end formation 83.3 percent of the time, and 85.2 percent from an I-formation. Their run percentage inside field goal range from triple tight end sets was slightly less than it was outside field goal range.\n\nThere was a 12 percent increase in runs from I-formations from outside the 35-yard line to inside of it. In 2017, that difference was 25 percent.\n\nIn 2016, all passes inside scoring range from an I-formation were play-action passes, mostly bootlegs. Even though the sample size from this scenario was quite small (four), they scored two touchdowns, 50 percent of those plays. Could a slight variance in one’s run-heavy tendency have resulted in such an efficient scoring rate?\n<h1><strong>Offense NEVER passed from run formations at end of halves</strong></h1>\nIn 2017, regardless of score or field position, the Cowboys ran 100 percent of the time when using 12, 13, 21, 22, or 6 OL personnel groupings with three minutes or less remaining in a half.\n\nEven if they were behind by a touchdown or more, they always ran the ball from run-heavy personnel. That’s a 19 percent increase from the previous year.\n\nIn Prescott’s rookie year, the team ran 81 percent of the time in end-of-half situations while in multiple tight end or multiple running back personnel groupings.\n<h1>In 3x1 w/ TE as X-Iso, TUNNEL VISION on No.2, No. 3 WRs</h1>\n \n\n\n\nLast year, the No. 2 and No. 3 receivers on the trips side were targeted 75 percent of the time inside field goal range.\n\nOutside of the 35-yard line, that target rate dropped to 40 percent. For whatever reason, the offense appeared to lock onto those receivers in that part of the field.\n\nDefensive coordinators key in on things like this.\n\nWhereas in 2016, the target percentage was consistent regardless of field position. The No. 2 and No. 3 receivers were thrown to half the time when the offense aligned in a 3x1 set with the tight end as the X-iso receiver (1.2 times per game).\n\nEverything wasn't all bad when it came to being predictable, however. Follow the jump to see two ways the offense kept defenses off balance.\n\n[lawrence-newsletter]","tags":["2016 NFL Season","2017 Season","2018 Season","Advanced Stats","Dak Prescott","Jason Garrett","2018 season","comparison between 2016 2017 offenses","Dallas Cowboys","Ezekiel Elliott","offensive tendencies","play diagrams","predictable","scott linehan","Tavon Austin"],"publishedDate":"2018-06-02T22:00:20Z","harvestDate":"2018-06-02T22:00:27Z","estimatedPublishedDate":"2018-06-02T22:00:20Z","url":"http://ct.moreover.com/?a=34207263891&p=1u0&v=1&x=kpw-TNv5Nee2r03v0STYQQ","originalUrl":"http://cowboyswire.usatoday.com/2018/06/02/dallas-cowboys-offensive-tendencies-predictable-comparison-between-2016-2017-offenses-play-diagrams/","outboundUrls":[],"wordCount":"632","dataFormat":"text","duplicateGroupId":"34207263891","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"603771"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Allan Uy","publishingPlatform":{"userId":"125520209"}},"licenses":[],"source":{"name":"Cowboys Wire","homeUrl":"http://cowboyswire.usatoday.com","location":{},"feed":{"id":"577822081","name":"Cowboys Wire","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"105974723","generator":"http://wordpress.com/","description":"Get the latest Cowboys news, schedule, photos and rumors from Cowboys Wire, the best Cowboys blog available","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"2","autoRankOrder":"2752","inboundLinkCount":"604"},"inWhiteList":"true","autoTopics":["ugc sport feeds"]}},"es_id":86994855}