{"sequenceId":"845366372027","id":"34207240630","language":"English","title":"Snapdragon 710 tipped for mid-range Pixel, but it gets murky from there","content":"Android Snapdragon 710 tipped for mid-range Pixel, but it gets murky from there by Jules WangJune 2, 2018 4:53 pm ContentsFull ArticleRatingComments Advertisement It’s nearly summer on the calendar, but months-old rumors about a completely new Google Pixel phone are heating back up. It was earlier indicated that Google was working with three codenames for phones this year: “albacore,” “blueline” and “crosshatch.” While we have figured that the premium-level Pixel 3 and Pixel 3 XL would amount to two of those projects, the third had been a mystery until whispers of a mid-range Pixel device started flowing. This device had been tipped for developing markets and a summer timeline. Now, we’re learning from longtime leaks reporter Roland Quandt of WinFuture that Google’s future plans in the sub-premium space are a bit more spread out than we first thought. Off to Taiwan for @computex_taipei today, but here’s a tidbit for ya: Google is working on a “mobile” device based on the Snapdragon 710 currently scheduled for launch in the 1st half of 2019. Sounds like this might be the (or one of them) upcoming mid-range Pixel phone. — Roland Quandt (@rquandt) June 2, 2018 The Xiaomi Mi 8 SE launched last week as the first device to feature the new Snapdragon 710 processor from Qualcomm. It sounds like we have a ways to go before Google can implement the new chip into its unique ways or at a desired price point — no clues to the real reasons at this point — but the 2019 deadline for this device is just a tad disappointing to hear. No I do not know if there is one planned for this year. No I do not know any specifics in this device, only the CPU. Hardware dev work in this only just started about a month ago. — Roland Quandt (@rquandt) June 2, 2018 However, with the word that development track only began in the last month or so, we highly doubt that this device will have been the welterweight Pixel 3 that we were tipped off to — at least, that’s what we hope. We’ve yet to assign a fate to that bucket of worms, so stay tuned. Pocketnow has been here since 2000. All these years we have had one mission: to offer timely, quality, and unbiased content; to create value, educate, and bridge the gap between people and technology. All these years we have never put up a paywall, and we never will. Our content always was, and always will be free. The revenue we earn comes from Ads, but with the decline in Ad Revenue we increasingly need our readers to fund us. If everyone who reads and enjoys our content helps fund and support it, our future will be much more secure. I want to support Pocketnow Share This Post Advertisement likethis What's your reaction? Love It 0% Like It 0% Want It 0% Had It 0% Hated It 0% ViaXDA-Developers Posted In Android, Phones, Tablets Tags components, Google, mid-range, News, Pixel 3, Pixel 3 XL, qualcomm, Rumors, Snapdragon 710 components, Google, mid-range, News, Pixel 3, Pixel 3 XL, qualcomm, Rumors, Snapdragon 710 About The AuthorJules Wang Jules Wang is News Editor for Pocketnow and one of the hosts of the Pocketnow Weekly Podcast. He came onto the team in 2014 as an intern editing and producing videos and the podcast while he was studying journalism at Emerson College. He graduated the year after and entered into his current position at Pocketnow, full-time.","contentWithMarkup":"<p>Because this phone may not be a Pixel lite. It could be a tablet. It could be a portable refrigerator. All we (think we) know is the silicon coming into play.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://pocketnow.com/2018/06/02/snapdragon-710-tipped-for-mid-range-pixel-but-it-gets-murky-from-there\">Snapdragon 710 tipped for mid-range Pixel, but it gets murky from there</a> appeared first on <a rel=\"nofollow\" href=\"http://pocketnow.com\">Pocketnow</a>.</p>\n<img src=\"http://feeds.feedburner.com/~r/pocketnow/~4/HiIB7XEVBJw\" height=\"1\" width=\"1\" alt=\"\"/>","tags":["Android","Phones","Tablets","components","Google","mid-range","News","Pixel 3","Pixel 3 XL","qualcomm","Rumors","Snapdragon 710","google","news","pixel-3","pixel-3-xl","rumors","snapdragon-710"],"publishedDate":"2018-06-02T20:53:54Z","harvestDate":"2018-06-02T21:56:15Z","estimatedPublishedDate":"2018-06-02T20:53:54Z","url":"http://ct.moreover.com/?a=34207240630&p=1u0&v=1&x=PzerydiLV3M0EBKA3Mtx7g","originalUrl":"http://pocketnow.com/2018/06/02/snapdragon-710-tipped-for-mid-range-pixel-but-it-gets-murky-from-there","commentsUrl":"http://pocketnow.com/2018/06/02/snapdragon-710-tipped-for-mid-range-pixel-but-it-gets-murky-from-there#comments","outboundUrls":["https://twitter.com/computex_taipei?ref_src=twsrc%5Etfw","https://twitter.com/rquandt/status/1002864782846906368?ref_src=twsrc%5Etfw","https://twitter.com/rquandt/status/1002876038769266688?ref_src=twsrc%5Etfw","https://www.xda-developers.com/google-pixel-qualcomm-snapdragon-710-2019/","http://twitter.com/@PointJules","http://instagram.com/https://www.instagram.com/juicefarcicles/"],"wordCount":"550","dataFormat":"text","duplicateGroupId":"34207240630","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Jules Wang","publishingPlatform":{}},"licenses":[],"source":{"name":"Pocketnow","homeUrl":"http://pocketnow.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"125600333","name":"Pocketnow","mediaType":"Blog","publishingPlatform":"WordPress","generator":"WordPress https://wordpress.org/","description":"Smartphone, Tablet, and Wearable Reviews, Videos, Editorials and News","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"2","autoRankOrder":"1439","inboundLinkCount":"1388"},"inWhiteList":"true","autoTopics":["ugc technology feeds","ugc media feeds","ugc financial feeds"]}},"es_id":86994320}