{"sequenceId":"845367354037","id":"34207264233","language":"English","title":"I'm Back - Sort Of","content":"Okay, I’m back. Well, I am sort of back. If I miss some days, it’s because I am not up to writing on some days, and just plain not up to anything on some days. There’s nothing I like less that someone that has to talk about all their ailments and problems, so I will dispense with most of the bad stuff. Sure, I have an incurable cancer, but everyone dies of something, it’s just a matter of time. Then, there’s the possibility that I may just defy the docs and outlive everybody. If I ramble more than usual, just be aware that I now have \"chemo - brain.\" That means that I don’t think just right. Truth is I never have though like everyone else does anyway. But, I will try to point out some things that I think you might find useful. First is that when you have an appointment with the chemotherapy treatment people, they are not in a hurry. When I was told that my long treatment would last six hours, I believed them. It took over eight hours. I have now worked out a plan to cut that time down by going to the treatment center the day before to have blood drawn which takes about five minutes. That cuts out two hours of waiting time. Other things that jump out to me today, include that I am told that I must exercise. Then they give me a big dose of drugs that take away any strength I ever had. The only thing I can exercise is to walk from my desk to the coffee pot. Their instructions say I am not supposed to have coffee, but they serve it during treatment so I figure I can drink it at home too. Then they want me to take prevention drugs to eliminate problems like nausea. Well I am lucky enough to have that, but the prevention drugs, make me even weaker than the chemotherapy. That means I get less coffee because it is too far to walk to get it. Maybe, they know this and that’s why they want me to take the pills. There are so many do’s and don’ts it takes a private secretary to write them all down or carry a recording device. My financial controller is in charge of remembering what I am supposed to do. But, then she has always done that. That makes it an easy job for her. Did you know that house cleaning is exercise? Running a vacuum, mopping the tile, dusting furniture, carrying out the trash, and stuff like that are supposed to be \"really\" good exercise. Some parts of this whole process sound familiar. On those items, I’m sticking with my long time practice not doing some exercises. PMO ©2018","contentWithMarkup":"Okay, I’m back.  Well, I am sort of back.  If I miss some days, it’s because I am not up to writing on some days, and just plain not up to anything on some days.<br /> <br />There’s nothing I like less that someone that has to talk about all their ailments and problems, so I will dispense with most of the bad stuff.  Sure, I have an incurable cancer, but everyone dies of something, it’s just a matter of  time.  Then, there’s the possibility that I may just defy the docs and outlive everybody.<br /> <br />If I ramble more than usual, just be aware that I now have \"chemo - brain.\"  That means that I don’t think just right.  Truth is I never have though like everyone else does anyway.  But, I will try to point out some things that I think you might find useful.<br /> <br />First is that when you have an appointment with the chemotherapy treatment people, they are not in a hurry.  When I was told that my long treatment would last six hours, I believed them.  It took over eight hours.  I have now worked out a plan to cut that time down by going to the treatment center the day before to have blood drawn which takes about five minutes.  That cuts out two hours of waiting time.<br /> <br />Other things that jump out to me today, include that I am told that I must exercise.  Then they give me a big dose of drugs that take away any strength I ever had.  The only thing I can exercise is to walk from my desk to the coffee pot.  Their instructions say I am not supposed to have coffee, but they serve it during treatment so I figure I can drink it at home too.<br /> <br />Then they want me to take prevention drugs to eliminate problems like nausea.  Well I am lucky enough to have that, but the prevention drugs, make me even weaker than the chemotherapy.  That means I get less coffee because it is too far to walk to get it.  Maybe, they know this and that’s why they want me to take the pills.<br /> <br />There are so many do’s and don’ts it takes a private secretary to write them all down or carry a recording device.  My financial controller is in charge of remembering what I am supposed to do.  But, then she has always done that.  That makes it an easy job for her.<br /> <br />Did you know that house cleaning is exercise?  Running a vacuum, mopping the tile, dusting furniture, carrying out the trash, and stuff like that are supposed to be \"really\" good exercise.<br /> <br />Some parts of this whole process sound familiar.<br /> <br />On those items, I’m sticking with my long time practice not doing some exercises. <br /> <br />PMO<br />©2018","tags":[],"publishedDate":"2018-06-02T19:45:51Z","harvestDate":"2018-06-02T22:00:31Z","estimatedPublishedDate":"2018-06-02T19:45:51Z","url":"http://ct.moreover.com/?a=34207264233&p=1u0&v=1&x=lPRzXu79rIMVKcHWRMFzAQ","originalUrl":"http://randomramblingsfromagrumpyoldman.blogspot.com/2018/06/im-back-sort-of.html","commentsUrl":"http://www.blogger.com/comment.g?blogID=829643311017220106&postID=1918507944064042386&isPopup=true","outboundUrls":[],"wordCount":"463","dataFormat":"text","duplicateGroupId":"34207264233","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"grumpyoldman","publishingPlatform":{}},"licenses":[],"source":{"name":"Random Ramblings from a Grumpy Old Man","homeUrl":"http://randomramblingsfromagrumpyoldman.blogspot.com/","location":{},"feed":{"id":"183754271","name":"Random Ramblings from a Grumpy Old Man","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"Want to know why old men are so grumpy?  They don't like to be annoyed!  What annoys them?  Everything!","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994874}