{"sequenceId":"845362154888","id":"34207109846","language":"English","title":"How to Speak More Powerfully","content":"The human voice, the instrument that we all play is the most powerful sound in the world. It’s the only one that can start a war or love by saying something. Many people might have the experience that when they speak, people don’t listen to them. So, how can we speak powerfully to make change in the world?  But before I share what we should do to have a powerful speak, I’d like to share to you that there are a number of habits that we need to move away from. It’s resumed as seven deadly sins of speaking. Those are pretty large habits that we can all fall into.  First, gossip. Speaking ill of somebody who’s not present. It’s not a nice habit and we know perfectly well the person gossiping, five minutes later will be gossiping about us. Then second is judging. We know people who are like this in conversation and it’s very hard to listen to somebody if you know that you’re being judged, also found wanting at the same time.  Third is negativity. It’s hard to listen, when somebody is that negative. Next, fourth is complaining. Fifth is excuses. Some people have a blame-thrower. They just pass it on to everybody else and don’t take responsibility for their actions, and again it’s hard to listen to somebody who is being like that.  Sixth is penultimate or lying. It also means embroidery and exaggeration. The exaggeration sometimes becomes lying and we don’t want to listen to people we know are lying to us. Then seventh is dogmatism. The confusion of facts with opinions. When those two things get conflated, you’re listening into the wind. You know, somebody is bombarding you with their opinions as if they were true. It’s difficult to listen to that.  After we successfully avoid those seven deadly sins of speaking, there are four really powerful cornerstones or foundations, that we can stand on if we want our speech to be powerful and to make change in the world. It’s resumed in a word of “HAIL”.  H is honesty. Being true in what you say, being straight and clear.  A is authenticity, just being yourself. It’s standing in your own truth. I is integrity. Being your word actually doing what you say and being somebody people can trust. Last L is love. It doesn’t mean romantic love but it’s mean wishing people for well.  This writing was inspired by Julian Treasure (Sound Consultant) on his speaking at TEDGlobal, June 2013.","contentWithMarkup":"The human voice, the instrument that we all play is the most powerful sound in the world. It’s the only one that can start a war or love by saying something. Many people might have the experience that when they speak, people don’t listen to them. So, how can we speak powerfully to make change in the world?\n\nBut before I share what we should do to have a powerful speak, I’d like to share to you that there are a number of habits that we need to move away from. It’s resumed as seven deadly sins of speaking. Those are pretty large habits that we can all fall into.\n\nFirst, gossip. Speaking ill of somebody who’s not present. It’s not a nice habit and we know perfectly well the person gossiping, five minutes later will be gossiping about us. Then second is judging. We know people who are like this in conversation and it’s very hard to listen to somebody if you know that you’re being judged, also found wanting at the same time.\n\nThird is negativity. It’s hard to listen, when somebody is that negative. Next, fourth is complaining. Fifth is excuses. Some people have a blame-thrower. They just pass it on to everybody else and don’t take responsibility for their actions, and again it’s hard to listen to somebody who is being like that.\n\nSixth is penultimate or lying. It also means embroidery and exaggeration. The exaggeration sometimes becomes lying and we don’t want to listen to people we know are lying to us. Then seventh is dogmatism. The confusion of facts with opinions. When those two things get conflated, you’re listening into the wind. You know, somebody is bombarding you with their opinions as if they were true. It’s difficult to listen to that.\n\nAfter we successfully avoid those seven deadly sins of speaking, there are four really powerful cornerstones or foundations, that we can stand on if we want our speech to be powerful and to make change in the world. It’s resumed in a word of “HAIL”.\n\nH is honesty. Being true in what you say, being straight and clear.  A is authenticity, just being yourself. It’s standing in your own truth. I is integrity. Being your word actually doing what you say and being somebody people can trust. Last L is love. It doesn’t mean romantic love but it’s mean wishing people for well.\n\nThis writing was inspired by Julian Treasure (Sound Consultant) on his speaking at TEDGlobal, June 2013.","tags":[],"publishedDate":"2018-06-02T21:24:03Z","harvestDate":"2018-06-02T21:24:08Z","estimatedPublishedDate":"2018-06-02T21:24:03Z","url":"http://ct.moreover.com/?a=34207109846&p=1u0&v=1&x=uiH0C3m1mu0Si2X0YIwEnA","originalUrl":"https://celotehsije.wordpress.com/2018/06/03/how-to-speak-more-powerfully/","outboundUrls":[],"wordCount":"416","dataFormat":"text","duplicateGroupId":"34207109846","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"1623"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"jajangjaelani93","publishingPlatform":{"userId":"59978535"}},"licenses":[],"source":{"name":"The Project","homeUrl":"https://celotehsije.wordpress.com","location":{},"feed":{"id":"563730155","name":"The Project","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"62654909","generator":"http://wordpress.com/","description":"of sharing and caring each other","tags":[],"language":"Unassigned","dataFormat":"text","rank":{"autoRank":"9","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990271}