{"sequenceId":"845366001746","id":"34207228492","language":"English","title":"Massachusetts House approves bill allowing creation of community benefit districts","content":"THE HOUSE AND SENATE - Beacon Hill Roll Call records local senators and representatives' votes on roll calls from the week of May 28-June 1.    A NEIGHBORHOOD CAN BAND TOGETHER AND FORM A DISTRICT WITH TAXING POWER (H 4546)  House 149-2, approved and sent to the Senate a local option bill allowing a city or town to authorize the creation of community benefit districts which would permit owners of contiguous property in a city or town to form a district and impose taxes to pay for additional services, improvements, events and other projects and activities within the district. The districts would be operated by a nonprofit board.    “Community benefit districts are another tool that municipalities can use to help grow their local economies and build good neighborhoods where people can live, work and play,” said the bill’s sponsor Sen. Brendan Crighton (D-Lynn). “This nationally proven model will create opportunities in downtowns, main streets and town centers across the commonwealth.”     “The Massachusetts Smart Growth Alliance believes that community benefit districts can be a game changer,” said Andre Leroux, Executive Director MA Smart Growth Alliance. “Cities and towns in Massachusetts are struggling to maintain basic services for residents and businesses, much less provide the amenities that world-class, walkable places need to thrive. The bill establishes a way for communities to organize a public-private-nonprofit partnership to support their downtown, Main Street, cultural district, historic area or other important place. It’s really about empowering local people to tackle their own challenges.”    Rep. Denise Provost (D-Somerville), one of only two representatives to vote against the bill, said this new option allows certain property owners to create their own fiefdoms and the ability to assess other property owners for purposes determined by themselves. “These are the kind of activities for which local government exists,” said Provost. “Why would we want to have a class of … private, parallel quasi-governments to perform these functions? Is the democracy, transparency and accountability of local elected government a problem?”    “Homeowners, family-owned businesses and their employees could be negatively impacted by groups who manipulate or misuse the powers created under this bill that privatizes some of local government's management and expense of tax dollars, community development and community services functions,” said Rep. Michelle DuBois (D-Brockton).    “Block by block they're coming for taxpayers,” said Chip Ford, executive director of Citizens for Limited Taxation. “Will the Legislature next propose also taxing us at the street level, then backyard by backyard? Today such speculation is not so far-fetched.”    (A “Yes” vote is for the bill. A “No” vote is against it.)    Rep. Carole Fiola Yes    Rep. Patricia Haddad Yes    Rep. Steven Howitt Yes    Rep. Christopher Markey Yes    Rep. Paul Schmid Yes    Rep. Alan Silvia Yes    HISTORY AND CIVICS IN SCHOOLS (H 4545)    House 151-0, approved a bill that makes changes in the current law that all public schools must provide instruction in American history and civics. Current law requires that the instruction include the Constitution of the United States, the Declaration of Independence and the Bill of Rights; the state Constitution and local history and government; a program on the correct use and display of the U.S. flag; and the importance of participation in the electoral process    The bill adds several topics that are required to be in the instruction including a study of the roles and responsibilities of a citizen in a democracy; the development of skills to access, analyze and evaluate written and digital media as it relates to history and civics; community diversity and historical trends in voter registration; and civic participation relative to disenfranchised voter populations.    “Now more than ever, it is vital to commit to strengthening youth voice, participation and civic engagement,” said Executive Director Arielle Jennings of Generation Citizen’s Massachusetts. “We are delighted to see this commitment fulfilled by the unanimous passing of this bill and to see the commonwealth take such a pivotal step toward becoming the national leader in civic education.”    “At a time when roughly three-quarters of the citizens do not know the three branches of government and more people know who the Three Stooges are, we need to recommit ourselves to civic education,” said Steven Rothstein the executive director of the John F. Kennedy Library Foundation.    The Senate has already approved a different version of the bill and the House version now goes to the Senate for consideration. The major difference in the two bills is that the Senate version makes it mandatory beginning in 2021 for all students to complete one student-led civics project after 8th grade in order to graduate.    (A “Yes” vote is for the bill.)    Rep. Carole Fiola Yes    Rep. Patricia Haddad Yes    Rep. Steven Howitt Yes    Rep. Christopher Markey Yes    Rep. Paul Schmid Yes    Rep. Alan Silvia Yes    FIREFIGHTERS AND CANCER (H 2515)    House 151-0, approved and sent to the Senate a bill designed to help firefighters who are diagnosed with cancer as a result of their job and decide to get treatment with the intention of going back to work. Under current law, a firefighter would have to use his or her accrued sick time to cover the days of the treatment. The bill would change the law and the firefighter would not use the sick time during the treatment. He or she could then use it for follow up care.    “This Legislature is committed to supporting our first responders who put their lives on the line every day for the public,” said Rep. Dan Cahill (D-Lynn), the sponsor of the proposal. “Speaker DeLeo secured bipartisan support to unanimously pass this bill in fulfillment of that commitment.”    (A “Yes” vote is for the bill.)    Rep. Carole Fiola Yes    Rep. Patricia Haddad Yes    Rep. Steven Howitt Yes    Rep. Christopher Markey Yes    Rep. Paul Schmid Yes    Rep. Alan Silvia Yes    LIFE SCIENCES (S 2531)    Senate 33-4, approved a bill that would authorize $462 million in bonds for the Massachusetts Life Sciences Investment Fund with an emphasis on capital grants to increase diversity and opportunity in the Bay State life sciences and biotech industries. The bill is aimed at continued job growth through capital grants that advance education, workforce development, early-stage company growth through spaces dedicated to life sciences companies, advanced bio-manufacturing and scientific innovation.    Provisions include $47 million for an integrated biotechnology and precision manufacturing research and training facility at the University of Massachusetts Amherst; $12 million for grants to community colleges or vocational-technical schools that collaborate with the industry; and an increase from $25 million to $30 million annually in the statutory cap on the Life Sciences Tax Incentive Program.    “The biotech and life sciences industry has been a key component of Massachusetts’ economic progress over the last ten years,” said Sen. Eric Lesser (D-Longmeadow), who led the charge for the bill’s passage. “The investments in this industry that we as a state made ten years ago have helped it flourish here in Massachusetts, and now we can’t afford to lose our national edge. Imagine the lost potential if we allow the next vaccine breakthrough, the next big discovery, the next lifesaving drug, to be developed elsewhere. This bill maintains our leadership in this critical industry and offers us tremendous opportunity to expand economic growth across our state.”    “We truly have a biotech and life sciences supercluster here in Massachusetts, and this bill will ensure we continue to grow and lead the way,” said Sen. Karen Spilka (D-Ashland), chair of the Senate Committee on Ways and Means. “People across the nation and the world depend upon the cutting-edge medical devices, pharmaceuticals and research under development here, and our investments today in innovation, education and workforce training are critical for our continued growth and success.”    “We should not single out a thriving industry for special subsidies,” said Sen. Pat Jehlen (D-Somerville). “Economic development is better served by investing in transportation, affordable housing and education, which benefit all businesses as well as all residents. Tax credits and bond payments are legal commitments in every budget, and crowd out priorities like school aid, human services and adequate pay for preschool educators and home care workers.    “Legislators voted against the bio tech bond bill because it would expand a corporate tax break not necessary for the expansion of the life sciences industry, at a time when the state continues to under-invest in public education, transportation, healthcare, and human services,” said Sen. Jamie Eldridge (D-Acton).    (A “Yes” vote is for the bill. A “No” vote is against it.)    Sen. Mark Montigny No    Sen. Marc Pacheco Yes    Sen. Michael Rodrigues Yes    REQUIRE REVIEW FIVE YEARS EARLIER (S 2531)    Senate 15-22, rejected an amendment that would reduce from ten years to five years, from 2028 to 2023, the time period in which a review of the tax breaks in the life sciences bill is required.    Amendment supporters said this would bring the review of the tax breaks in line with the 5-year review timeline recommended by the Tax Expenditure Commission and passed by the Senate in its version of the fiscal 2018 and 2019 budgets.    Amendment opponents offered no arguments. Several senators did not respond to Beacon Hill Roll Call’s request for a comment on why they voted against the amendment.    (A “Yes” vote is for the reduction to five years. A “No” vote is against the reduction).    Sen. Mark Montigny Yes    Sen. Marc Pacheco No    Sen. Michael Rodrigues No     ALSO UP ON BEACON HILL    SEXUAL ASSAULT BY FRAUD (H 2289) – The House gave initial approval to a bill that makes it a crime for a doctor or other medical professional to commit sexual contact with a patient even when the doctor claims the contact is necessary for a legitimate medical purpose.    Under current law, sexual contact by medical professionals represented to the patient as necessary for a legitimate medical purpose cannot be prosecuted, as the patient may be viewed as consenting to it, either explicitly or implicitly. Two courts have ruled that if a person consents to sexual intercourse, even under false pretenses, it is still consent.    “The lack of a legal remedy in this area is particularly egregious given that a patient or client may be especially vulnerable,” said the bill’s sponsor Rep. Kate Hogan (D-Stow). “A person in need of treatment, and without medical knowledge, will of necessity rely on the representations made by a professional who is entrusted with caring for them and treating them. If passed, this legislation will enable authorities to prosecute a medical professional who sexually assaults their patient and tries to pass it off as being necessary for medical reasons.”    APPEAL PARKING TICKET FOR \"ILLEGALLY\" PARKING IN A HANDICAPPED SPACE (H 2425) – The House gave initial approval to a bill that allows people who legally utilize a handicap placard or license plate to challenge, without a fee, a finding that he or she parked illegally in a handicap space. Current law requires the payment of a fee to have the matter heard by the city or town’s parking clerk.    Another provision allows an accused person to challenge the parking clerk’s unfavorable decision by appealing directly to the mayor or Board of Selectmen before going to the courts. Under current law, an appeal of the case goes from the parking clerk to the court.    “This legislation waives a financial penalty associated with appealing misidentified violators of handicap parking bylaws or ordinances,” said the bill’s sponsor Rep. Alice Peisch (D-Wellesley). “While it is essential to strictly enforce handicap parking laws, it is unfair to require legitimate holders of handicap licenses and placards to pay a fee simply to appeal a wrongly issued ticket.”    TOWING AND IMPOUNDMENT OF VEHICLES (H 1819) – The House gave initial approval to a bill requiring the towing and 12-hour impoundment of a vehicle when an operator is determined to be under the influence of drugs. The bill largely mirrors the current law which impounds vehicles of drunken drivers.    Many people under the influence of drugs are given Narcan, an emergency treatment used for the complete or partial reversal of opioid overdose.    “With the growing use and effectiveness of Narcan, we are seeing a corresponding increase in situations where individuals who are revived are getting back behind the wheel of their cars very quickly,” said Rep. Michael Day (D-Stoneham). “This legislation will improve public safety by enabling our authorities to impound those cars and prohibiting individuals with severely compromised judgment from further endangering themselves or others.”     BAKER SIGNS $1.8 BILLION HOUSING PACKAGE    Gov. Charlie Baker signed into law a package funding various state programs to construct and preserve affordable housing.    Provisions include $400 million for the Affordable Housing Trust Fund that funds a myriad of programs including help for first-time homebuyers; $100 million for the creation of rental housing that is affordable for working families whose incomes are too high for subsidized housing but are priced out of market rents; $600 million to rehabilitate and modernize existing public housing; $60 million for disabled persons and seniors to renovate and modify their homes; and $45 million for grants to non-profits for early education and out-of-school time program facilities that serve low income children.    Tax incentives include extending the Community Investment Tax Credit from December 31, 2019 to December 31, 2025 for taxpayers who make cash contributions to community partners investing in economic opportunities for low- and moderate-income households and providing an additional $5 million per year to the Massachusetts low-income housing tax credit program for projects that preserve and improve existing state or federally assisted housing.    “This bill will help expand our administration’s commitment to ensuring residents across the commonwealth have more access to quality, safe and affordable housing and economic development opportunities,” said Gov. Baker. “Municipalities, developers, and local housing authorities will be supported by a toolbox of flexible resources to create more affordable options and explore new avenues to meet a growing demand.”    “Our goal is to ensure Massachusetts families and residents, despite their income, have access to safe, quality housing they can afford,” said Housing and Community Development Undersecretary Janelle Chan. “Housing, in particular housing affordable to the spectrum of households, drives economic development, supports vibrant and walkable downtowns, promotes neighborhood stability, and enables families and residents to thrive.\"          Bob Katzen welcomes feedback at bob@beaconhillrollcall.com","contentWithMarkup":"THE HOUSE AND SENATE - Beacon Hill Roll Call records local senators and representatives' votes on roll calls from the week of May 28-June 1.    A NEIGHBORHOOD CAN BAND TOGETHER AND FORM A DISTRICT WITH TAXING POWER (H 4546)  House 149-2, approved and sent to the Senate a local option bill allowing a city or town to authorize the creation of community benefit districts which would permit owners of contiguous property in a city or town to form a district and impose taxes to pay for additional services, improvements, events and other projects and activities within the district. The districts would be operated by a nonprofit board.    “Community benefit districts are another tool that municipalities can use to help grow their local economies and build good neighborhoods where people can live, work and play,” said the bill’s sponsor Sen. Brendan Crighton (D-Lynn). “This nationally proven model will create opportunities in downtowns, main streets and town centers across the commonwealth.”     “The Massachusetts Smart Growth Alliance believes that community benefit districts can be a game changer,” said Andre Leroux, Executive Director MA Smart Growth Alliance. “Cities and towns in Massachusetts are struggling to maintain basic services for residents and businesses, much less provide the amenities that world-class, walkable places need to thrive. The bill establishes a way for communities to organize a public-private-nonprofit partnership to support their downtown, Main Street, cultural district, historic area or other important place. It’s really about empowering local people to tackle their own challenges.”    Rep. Denise Provost (D-Somerville), one of only two representatives to vote against the bill, said this new option allows certain property owners to create their own fiefdoms and the ability to assess other property owners for purposes determined by themselves. “These are the kind of activities for which local government exists,” said Provost. “Why would we want to have a class of … private, parallel quasi-governments to perform these functions? Is the democracy, transparency and accountability of local elected government a problem?”    “Homeowners, family-owned businesses and their employees could be negatively impacted by groups who manipulate or misuse the powers created under this bill that privatizes some of local government's management and expense of tax dollars, community development and community services functions,” said Rep. Michelle DuBois (D-Brockton).    “Block by block they're coming for taxpayers,” said Chip Ford, executive director of Citizens for Limited Taxation. “Will the Legislature next propose also taxing us at the street level, then backyard by backyard? Today such speculation is not so far-fetched.”    (A “Yes” vote is for the bill. A “No” vote is against it.)    Rep. Carole Fiola Yes    Rep. Patricia Haddad Yes    Rep. Steven Howitt Yes    Rep. Christopher Markey Yes    Rep. Paul Schmid Yes    Rep. Alan Silvia Yes    HISTORY AND CIVICS IN SCHOOLS (H 4545)    House 151-0, approved a bill that makes changes in the current law that all public schools must provide instruction in American history and civics. Current law requires that the instruction include the Constitution of the United States, the Declaration of Independence and the Bill of Rights; the state Constitution and local history and government; a program on the correct use and display of the U.S. flag; and the importance of participation in the electoral process    The bill adds several topics that are required to be in the instruction including a study of the roles and responsibilities of a citizen in a democracy; the development of skills to access, analyze and evaluate written and digital media as it relates to history and civics; community diversity and historical trends in voter registration; and civic participation relative to disenfranchised voter populations.    “Now more than ever, it is vital to commit to strengthening youth voice, participation and civic engagement,” said Executive Director Arielle Jennings of Generation Citizen’s Massachusetts. “We are delighted to see this commitment fulfilled by the unanimous passing of this bill and to see the commonwealth take such a pivotal step toward becoming the national leader in civic education.”    “At a time when roughly three-quarters of the citizens do not know the three branches of government and more people know who the Three Stooges are, we need to recommit ourselves to civic education,” said Steven Rothstein the executive director of the John F. Kennedy Library Foundation.    The Senate has already approved a different version of the bill and the House version now goes to the Senate for consideration. The major difference in the two bills is that the Senate version makes it mandatory beginning in 2021 for all students to complete one student-led civics project after 8th grade in order to graduate.    (A “Yes” vote is for the bill.)    Rep. Carole Fiola Yes    Rep. Patricia Haddad Yes    Rep. Steven Howitt Yes    Rep. Christopher Markey Yes    Rep. Paul Schmid Yes    Rep. Alan Silvia Yes    FIREFIGHTERS AND CANCER (H 2515)    House 151-0, approved and sent to the Senate a bill designed to help firefighters who are diagnosed with cancer as a result of their job and decide to get treatment with the intention of going back to work. Under current law, a firefighter would have to use his or her accrued sick time to cover the days of the treatment. The bill would change the law and the firefighter would not use the sick time during the treatment. He or she could then use it for follow up care.    “This Legislature is committed to supporting our first responders who put their lives on the line every day for the public,” said Rep. Dan Cahill (D-Lynn), the sponsor of the proposal. “Speaker DeLeo secured bipartisan support to unanimously pass this bill in fulfillment of that commitment.”    (A “Yes” vote is for the bill.)    Rep. Carole Fiola Yes    Rep. Patricia Haddad Yes    Rep. Steven Howitt Yes    Rep. Christopher Markey Yes    Rep. Paul Schmid Yes    Rep. Alan Silvia Yes    LIFE SCIENCES (S 2531)    Senate 33-4, approved a bill that would authorize $462 million in bonds for the Massachusetts Life Sciences Investment Fund with an emphasis on capital grants to increase diversity and opportunity in the Bay State life sciences and biotech industries. The bill is aimed at continued job growth through capital grants that advance education, workforce development, early-stage company growth through spaces dedicated to life sciences companies, advanced bio-manufacturing and scientific innovation.    Provisions include $47 million for an integrated biotechnology and precision manufacturing research and training facility at the University of Massachusetts Amherst; $12 million for grants to community colleges or vocational-technical schools that collaborate with the industry; and an increase from $25 million to $30 million annually in the statutory cap on the Life Sciences Tax Incentive Program.    “The biotech and life sciences industry has been a key component of Massachusetts’ economic progress over the last ten years,” said Sen. Eric Lesser (D-Longmeadow), who led the charge for the bill’s passage. “The investments in this industry that we as a state made ten years ago have helped it flourish here in Massachusetts, and now we can’t afford to lose our national edge. Imagine the lost potential if we allow the next vaccine breakthrough, the next big discovery, the next lifesaving drug, to be developed elsewhere. This bill maintains our leadership in this critical industry and offers us tremendous opportunity to expand economic growth across our state.”    “We truly have a biotech and life sciences supercluster here in Massachusetts, and this bill will ensure we continue to grow and lead the way,” said Sen. Karen Spilka (D-Ashland), chair of the Senate Committee on Ways and Means. “People across the nation and the world depend upon the cutting-edge medical devices, pharmaceuticals and research under development here, and our investments today in innovation, education and workforce training are critical for our continued growth and success.”    “We should not single out a thriving industry for special subsidies,” said Sen. Pat Jehlen (D-Somerville). “Economic development is better served by investing in transportation, affordable housing and education, which benefit all businesses as well as all residents. Tax credits and bond payments are legal commitments in every budget, and crowd out priorities like school aid, human services and adequate pay for preschool educators and home care workers.    “Legislators voted against the bio tech bond bill because it would expand a corporate tax break not necessary for the expansion of the life sciences industry, at a time when the state continues to under-invest in public education, transportation, healthcare, and human services,” said Sen. Jamie Eldridge (D-Acton).    (A “Yes” vote is for the bill. A “No” vote is against it.)    Sen. Mark Montigny No    Sen. Marc Pacheco Yes    Sen. Michael Rodrigues Yes    REQUIRE REVIEW FIVE YEARS EARLIER (S 2531)    Senate 15-22, rejected an amendment that would reduce from ten years to five years, from 2028 to 2023, the time period in which a review of the tax breaks in the life sciences bill is required.    Amendment supporters said this would bring the review of the tax breaks in line with the 5-year review timeline recommended by the Tax Expenditure Commission and passed by the Senate in its version of the fiscal 2018 and 2019 budgets.    Amendment opponents offered no arguments. Several senators did not respond to Beacon Hill Roll Call’s request for a comment on why they voted against the amendment.    (A “Yes” vote is for the reduction to five years. A “No” vote is against the reduction).    Sen. Mark Montigny Yes    Sen. Marc Pacheco No    Sen. Michael Rodrigues No     ALSO UP ON BEACON HILL    SEXUAL ASSAULT BY FRAUD (H 2289) – The House gave initial approval to a bill that makes it a crime for a doctor or other medical professional to commit sexual contact with a patient even when the doctor claims the contact is necessary for a legitimate medical purpose.    Under current law, sexual contact by medical professionals represented to the patient as necessary for a legitimate medical purpose cannot be prosecuted, as the patient may be viewed as consenting to it, either explicitly or implicitly. Two courts have ruled that if a person consents to sexual intercourse, even under false pretenses, it is still consent.    “The lack of a legal remedy in this area is particularly egregious given that a patient or client may be especially vulnerable,” said the bill’s sponsor Rep. Kate Hogan (D-Stow). “A person in need of treatment, and without medical knowledge, will of necessity rely on the representations made by a professional who is entrusted with caring for them and treating them. If passed, this legislation will enable authorities to prosecute a medical professional who sexually assaults their patient and tries to pass it off as being necessary for medical reasons.”    APPEAL PARKING TICKET FOR \"ILLEGALLY\" PARKING IN A HANDICAPPED SPACE (H 2425) – The House gave initial approval to a bill that allows people who legally utilize a handicap placard or license plate to challenge, without a fee, a finding that he or she parked illegally in a handicap space. Current law requires the payment of a fee to have the matter heard by the city or town’s parking clerk.    Another provision allows an accused person to challenge the parking clerk’s unfavorable decision by appealing directly to the mayor or Board of Selectmen before going to the courts. Under current law, an appeal of the case goes from the parking clerk to the court.    “This legislation waives a financial penalty associated with appealing misidentified violators of handicap parking bylaws or ordinances,” said the bill’s sponsor Rep. Alice Peisch (D-Wellesley). “While it is essential to strictly enforce handicap parking laws, it is unfair to require legitimate holders of handicap licenses and placards to pay a fee simply to appeal a wrongly issued ticket.”    TOWING AND IMPOUNDMENT OF VEHICLES (H 1819) – The House gave initial approval to a bill requiring the towing and 12-hour impoundment of a vehicle when an operator is determined to be under the influence of drugs. The bill largely mirrors the current law which impounds vehicles of drunken drivers.    Many people under the influence of drugs are given Narcan, an emergency treatment used for the complete or partial reversal of opioid overdose.    “With the growing use and effectiveness of Narcan, we are seeing a corresponding increase in situations where individuals who are revived are getting back behind the wheel of their cars very quickly,” said Rep. Michael Day (D-Stoneham). “This legislation will improve public safety by enabling our authorities to impound those cars and prohibiting individuals with severely compromised judgment from further endangering themselves or others.”     BAKER SIGNS $1.8 BILLION HOUSING PACKAGE    Gov. Charlie Baker signed into law a package funding various state programs to construct and preserve affordable housing.    Provisions include $400 million for the Affordable Housing Trust Fund that funds a myriad of programs including help for first-time homebuyers; $100 million for the creation of rental housing that is affordable for working families whose incomes are too high for subsidized housing but are priced out of market rents; $600 million to rehabilitate and modernize existing public housing; $60 million for disabled persons and seniors to renovate and modify their homes; and $45 million for grants to non-profits for early education and out-of-school time program facilities that serve low income children.    Tax incentives include extending the Community Investment Tax Credit from December 31, 2019 to December 31, 2025 for taxpayers who make cash contributions to community partners investing in economic opportunities for low- and moderate-income households and providing an additional $5 million per year to the Massachusetts low-income housing tax credit program for projects that preserve and improve existing state or federally assisted housing.    “This bill will help expand our administration’s commitment to ensuring residents across the commonwealth have more access to quality, safe and affordable housing and economic development opportunities,” said Gov. Baker. “Municipalities, developers, and local housing authorities will be supported by a toolbox of flexible resources to create more affordable options and explore new avenues to meet a growing demand.”    “Our goal is to ensure Massachusetts families and residents, despite their income, have access to safe, quality housing they can afford,” said Housing and Community Development Undersecretary Janelle Chan. “Housing, in particular housing affordable to the spectrum of households, drives economic development, supports vibrant and walkable downtowns, promotes neighborhood stability, and enables families and residents to thrive.\"          Bob Katzen welcomes feedback at bob@beaconhillrollcall.com","tags":[],"publishedDate":"2018-06-02T21:57:52Z","harvestDate":"2018-06-02T21:52:48Z","estimatedPublishedDate":"2018-06-02T21:52:48Z","url":"http://ct.moreover.com/?a=34207228492&p=1u0&v=1&x=FYQDyFur7YOB3DGC_kAzhQ","originalUrl":"http://www.heraldnews.com/news/20180602/massachusetts-house-approves-bill-allowing-creation-of-community-benefit-districts?rssfeed=true","outboundUrls":[],"wordCount":"2323","dataFormat":"text","duplicateGroupId":"34207228492","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Biotech news","group":"Industry"},{"name":"US Federal Government news","group":"Society"}],"companies":[],"author":{"name":"Bob Katzen Beacon Hill Roll Call","publishingPlatform":{}},"licenses":[{"name":"Publicly Available"}],"source":{"name":"Herald News","homeUrl":"http://www.heraldnews.com","category":"Local","editorialRank":"4","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America","state":"New Jersey","county":"Passaic","zipArea":"Little Falls","zipCode":"07424"},"feed":{"id":"169704215","name":"Herald News","mediaType":"News","tags":[],"language":"Unassigned","dataFormat":"text","rank":{"inboundLinkCount":"274"},"inWhiteList":"true","autoTopics":[],"editorialTopics":["News","Standard","Local","Geographic"],"genre":"General"}},"es_id":86993961}