{"sequenceId":"845362053775","id":"34207105971","language":"English","title":"The House Is In Play In November","content":"Listen Listening... / Copyright 2018 NPR. To see more, visit http://www.npr.org/. SCOTT SIMON, HOST: Eight states hold primary elections this coming week in a year in which the midterms could change control of the House of Representatives, determine the Republican agenda and steer the future of the Democratic Party with an administration at the White House whose actions are under investigation. NPR political reporter Jessica Taylor has been following the battle for control of Congress. Thanks for joining us, Jessica. JESSICA TAYLOR, BYLINE: Thanks, Scott. SIMON: Now, why are the contests coming up this week particularly important for control of the House? TAYLOR: This is sort of the Super Tuesday with so many states happening. And these are states that are really consequential in determining how competitive the fall elections could be. California - there are half a dozen seats there that Republicans are in danger of losing. Democrats believe that they can flip. But California has a very strange top two primary system. So the top two vote-getters, regardless of party, advance to the November elections. There's the real possibility that in some of these places, because there are so many candidates, they could split the vote and not get a candidate through to November. New Jersey's another place where there are elections. There are a lot of seats there that are very vulnerable, that have moved away from President Trump and toward Democrats recently. So there's just a lot of places that are very competitive. We're going to see what kind of candidates Democrats get in some of these seats. And that will tell us a lot about November. SIMON: What about suburban swing districts? Everybody wants to win there. TAYLOR: These were places that were longtime Republican strongholds that voted big for Mitt Romney in 2012 but then were just dissatisfied, frustrated with President Trump with the way that he's governed. And Democrats are banking on these people to use this vote this fall as a way to register their displeasure with the president and with the Republican Party. These are affluent districts, highly educated voters. And they're no fans of the president. Orange County, for example - longtime Republican area - but there's many seats in that area where Democrats need to pick up seats there - and New Jersey, too, sort of suburban New York and different things, too, there. So these are districts where we've really seen changing demographics. And the path to the house really runs through these districts. SIMON: Are there districts where Democrats hold the seat but have to worry? TAYLOR: There are. In 2006, when Democrats last flipped the House, they lost no incumbents and lost no seats. Neither party thinks that's going to happen this time. And that is because there are still 13 seats that Democrats hold where President Trump carried. And they are pretty weak in some of these areas in the Midwest where Trump did well - blue-collar areas - so places like Minnesota, Ohio - that they could possibly have to worry about. SIMON: So when you talk to Republicans and Democrats at this point, how do they see things proceeding? TAYLOR: Several months ago, when I was talking with Republicans, they were very worried. President Trump's approval ratings were at record lows. And when you look at the generic ballot, which is sort of this test of whether voters would rather vote for a Republican in Congress or Democrat in Congress, Democrats had a double-digit advantage. That tells us sort of something at large about the mood of the country and where sort of these seats could fall. That's tightened to only about three or four points right now. We could see a major shift, really, after Labor Day when a lot of these races start to engage. But Republicans - they are feeling better. It's still not great for them. It's about a 50/50 shot right now, most of them have told me. And Democrats - they still have a lot of things in their favor. I think you'd rather be a Democrat running in the House than Republicans. They have enthusiasm on their side. We've seen so many women candidates get through. This is really sort of driving interest in turnout. Special elections - we've seen an overperformance in traditionally Republican areas. So history is on their side, as well. First-term president typically loses seats in their first midterm election. So there's a lot that we don't know. But with these primaries, we're starting to see what types of candidates are on the ballot. And voter attitudes are beginning to take shape. SIMON: NPR's Jessica Taylor, thanks so much. TAYLOR: Thank you. Transcript provided by NPR, Copyright NPR. TweetShareGoogle+Email","contentWithMarkup":"Copyright 2018 NPR. To see more, visit SCOTT SIMON, HOST: Eight states hold primary elections this coming week in a year in which the midterms could change control of the House of Representatives, determine the Republican agenda and steer the future of the Democratic Party with an administration at...<div class=\"feedflare\">\n<a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=DD00Va0pEQE:oqgy_GDc-Dk:I9og5sOYxJI\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?d=I9og5sOYxJI\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=DD00Va0pEQE:oqgy_GDc-Dk:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?d=qj6IDK7rITs\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=DD00Va0pEQE:oqgy_GDc-Dk:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?i=DD00Va0pEQE:oqgy_GDc-Dk:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=DD00Va0pEQE:oqgy_GDc-Dk:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?d=yIl2AUoC8zA\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/GPBNewsFeed/~4/DD00Va0pEQE\" height=\"1\" width=\"1\" alt=\"\"/>","tags":[],"publishedDate":"2018-06-02T12:28:00Z","harvestDate":"2018-06-02T21:22:57Z","estimatedPublishedDate":"2018-06-02T12:28:00Z","url":"http://ct.moreover.com/?a=34207105971&p=1u0&v=1&x=l5sKGfuMBT3PRdNOZ00HLw","originalUrl":"http://gpbnews.org/post/house-play-november","outboundUrls":["https://ondemand.npr.org/npr-mp4/npr/wesat/2018/06/20180602_wesat_midterms_-_house_in_play.mp4?orgId=1&topicId=1014&d=240&p=7&story=616392715&ft=nprml&f=616392715","http://twitter.com/intent/tweet?url=http%3A%2F%2Fwww.tinyurl.com%2Fyaesv9jk&text=The%20House%20Is%20In%20Play%20In%20November","http://facebook.com/sharer.php?u=http%3A%2F%2Fwww.tinyurl.com%2Fyaesv9jk&t=The%20House%20Is%20In%20Play%20In%20November","https://plus.google.com/share?url=http%3A%2F%2Fwww.tinyurl.com%2Fyaesv9jk","http://www.npr.org/","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=DD00Va0pEQE:oqgy_GDc-Dk:I9og5sOYxJI","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=DD00Va0pEQE:oqgy_GDc-Dk:qj6IDK7rITs","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=DD00Va0pEQE:oqgy_GDc-Dk:F7zBnMyn0Lo","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=DD00Va0pEQE:oqgy_GDc-Dk:yIl2AUoC8zA"],"wordCount":"771","dataFormat":"text","duplicateGroupId":"34200750444","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Jessica Taylor","publishingPlatform":{}},"licenses":[],"source":{"name":"GPB News Feed","homeUrl":"http://gpbnews.org","location":{},"feed":{"id":"186192773","name":"GPB News Feed","mediaType":"Blog","publishingPlatform":"NPR","generator":"NPR Digital Services RSS Generator 0.94","description":"Georgia Public Broadcasting gives you the latest statewide news, features, sights and sounds, all through our redesigned website at http://www.gpb.org/news!","tags":["News & Politics"],"imageUrl":"http://www.npr.org/images/stations/redesign/wjsp_fm.gif","copyright":"℗ & © 2010 Georgia Public Broadcasting","language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"27391","inboundLinkCount":"19"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990148}