{"sequenceId":"845362139464","id":"34207109164","language":"English","title":"Festa della Repubblica","content":"\"We want to restore confidence in our democracy and in the institutions of the state.\" This is the first sentence of the coalition agreement between the leaders of the Lega and Movimento Cinque Stelle parties who will run the Republic together for the next legislative period in Italy. That is an inspiring phrase for a pair of parties that have built their considerable political success on mistrust in Italian democracy and the institutions of the state and who went on to install a politically nobody as a puppet PM between them – surely a move that will make each and every Italian citizen shiver with respect for the institutions of the state. That these two parties might very well blow up the euro zone and the European Union, that migrants, refugees, Muslims and Roma have nothing to expect and much to fear from them, is well known and much discussed and truly terrible enough. What is less clear, however, is what Italy is facing as a constitutional state. Populist parties that claim to represent the \"true will of the people\" have a way to get caught up with the \"elitist\" institutions of the constitutional state sooner or later. Will this happen in Italy, too? And with what consequences? The 57-page Contratto per il Governo del Cambiamento is a rather vague document even for coalition agreement standards. But it’s all we have for now, and it does contain a few interesting things. The next constitutional reform Parliament, for example. One of the things the coalition takes issue with is the fact that deputies tend to the political centre over time, to compromise and muddle through and betray the pure radical line for which they were once elected. This phenomenon,  not unfamiliar to us Merkel-governed Germans at all, is called Trasformismo in Italy and has had a bad reputation since the late 19th. Lega/M5S want to put an end to it with a rather massive encroachment on the freedom of the parliamentary mandate: \"Ways of binding the mandate\" are to be introduced to keep deputies from defecting to another party (p. 35). The coalition is quick to emphasise that such ties exist elsewhere too, for example in Portugal (Article 160 of the Portuguese constitution, which, however, as MASSIMO FICHERA shows, is not comparable with the plans of the Italian coalition – comparative constitutionalism is always a notoriously context-dependent matter). The leaders of the governing parties will be made considerably more powerful by such a measure, of course: If you take the exit option away from the MPs, it’s voice and loyalty that remain. Power concentration in the hand of a few, wasn’t that always anathema to the Grillini?  Not any more, it seems, and why would it as it’s now the good guys who govern. To implement that will require a constitutional amendment. The coalition can initiate an amendment without the participation of the opposition by calling for a constitutional referendum. The last such referendum wasn’t long ago and was a spectacular failure. Whether Lega and M5S are more successful in convincing citizens of the need for constitutional reform than Matteo Renzi remains to be seen. It may make a difference to propose such things from the position of government and thereby beg the question what increase of power one hopes to gain from it. Up the Tricolore One interesting thing will be to see how the Comitato di Conciliazione will turn out – a committee the coalition intends to install in order to search solutions in the case of a coalition conflict. Will this evolve into as some kind of Politburo where all the actual decision-making happens in an informal and intransparent way, sidelining the democratic institutions of the constitution, most of all the Council of Ministers and Parliament? That is neither certain nor can it be excluded from what little information the coalition agreement gives us about it. Furthermore, the coalition has far-reaching plans with regard to direct democracy: So far, referenda to invalidate laws are bound to a quorum of 50 percent of the electorate (Art. 175 of the Constitution). They want to scrap that quorum, so that any majority suffices, and they want to introduce positive popular initiatives (p. 36). As to the independence of the judiciary, the agreement does contain a passage which promises a reform of the elections of the members of the Supreme Judicial Council (p. 22). That might raise a Poland sort of alarm at first sight, which, however, is most likely not indicated here for the time being, since there is no sign that anyone wants to take on the fiercely independent Italian judiciary which had already successfully brought down Silvio Berlusconi and, in general, is very good in facing down political adversaries. It is an old, almost commonplace demand to do something about the party-attachment of the Judicial Council members, but that is to strengthen its independence, not to weaken it. Whether the Lega/M5S government, if it tackles this issue one day, will feel tempted to fill the Council with their minions in some way is too early to tell, but as far as I can see, the coalition agreement contains no indication of this. In sum, on this day of the Festa della Repubblica, it seems to me that there are still many good reasons to hold up the Bandiera Tricolore with defiance and pride. Italy has a robust constitution, a strong judiciary and above all a Constitutional Court that is nobody’s fool and that has repeatedly proved its will and ability to confront the truly deeply detestable Lega Party which controls some regional governments in the North and in that capacity was on several occasions reprimanded by the Constitutional Court in the past. But there are good reasons to remain alarmed, too. If Di Maio’s flamboyant \"Third Republic\" is to become a reality, I suppose it will sooner or later want to replace at least parts of the constitutional system of the Second Republic whose ailing intermediary institutions – parties, media – it owes so much of it’s ascent to. No good reasons exist, however, for all that sanctimonious eye-rolling in Berlin and Brussels and elsewhere about those happy-go-lucky Italians and their inability to get their act together. What is happening in Italy right now is largely just a variation of a phenomenon that is affecting all Europe or even the whole world in these trying times, and not a product of any peculiar feature of the Italian national character. Nor is it primarily Italy’s fault that the structural problems of the euro zone, which have ad nauseam been diagnosed over and over again, still remain unfixed to this present day. Nor is it Italy’s fault that it has been left in the lurch by Europe for so many years to cope with the hundreds of thousands of refugees arriving at its shores. A Europe which, when the chickens finally come home to roost, comes up with nothing but culturalistic arrogance and clandestine satisfaction about the blind logic of the financial markets, such a Europe can get lost, as far as I’m concerned. Pactum ad Excludendum Italy’s President Mattarella had thwarted a first Lega/M5S attempt to form a government by denying the Eurosceptic Paolo Savona the post of Minister of Economics and Finance. In constitutional terms, Mattarella has not exceeded his competences, argues MASSIMO FICHERA, and DILETTA TEGA and MICHELE MASSA explain the role of the argument to keep Italy in the Euro in that respect. For MARCO DANI and AGUSTÍN JOSÉ MENENDEZ, however, it is a massive problem of EU law if the view prevails that EU critics, by means of a \"pactum ad excludendum\", are to be barred from taking the post of Minister of Economy and/or Finance in the member states. Speaking of the Italian Constitutional Court: its legendary dispute with the European Court in the Taricco saga has come to a conclusion with a judgment that CHIARA AMALFITANO and ORESTE POLLICINO will analyze for us. I am expecting the article at any moment and therefore can’t link to it yet. With Italy so prominent on our minds, let’s not forget Poland: The state of its consitution was the subject of this week’s hearing before the European Court of Justice in the seminal Celmer case. Can we expect the EU Member States to have sufficient confidence in the independence of the Polish judiciary to extradite people to it? We hope to publish a report how the hearing went in the next few days. LAURENT PECH told the Polish website OKO Press in an interview what to expect from the Commission, the Council and the Court of Justice in the conflict; the English version of the interview conducted by ANNA WÓJCIK is here. On another note: The German Federal Administrative Court had to decide whether operators of Internet infrastructure can act as guardians of data protection and human rights and take action against the curiosity of the Federal Intelligence Service. They can’t, according to the Bundesverwaltungsgericht, and BJÖRN SCHIFFBAUER tells the whole fabulous story (German). Elsewhere JUAN RODRÍGUEZ TERUEL describes how Pedro Sánchez managed against all odds to replace Mariano Rajoy as Prime Minister of Spain, and MIGUEL ÁNGEL PRESNO LINERA puts the Spanish vote of no confidence into a comparative constitutional context (both Spanish). CHRISTOPHER GIOGIOS investigates whether the German police are allowed to hand over data on German hooligans to the Russian authorities during the upcoming Soccer World Cup 2018 (German). The US constitution still contains no explicit equal treatment clause with respect to men and women. Almost 100 years after the first attempt to change this and almost 50 years after the US Senate decided to open the way for state ratification, Illinois has now voted in favour, theoretically leaving only one state (and an extension of the ratification period in Congress) to make the equal treatment clause part of the US constitution. SANDY LEVINSON, however, does not believe that this will be successful. ILYA SOMIN explains from a libertarian point of view why it is wrong to deport criminals instead of punishing them. BRUNO DAUGERON examines the plans to reform the electoral law for the French Assemblée Nationale. JAMES FOWKES draws our attention to the issue of climate protection litigation, in response to a current Dutch case. IDDO PORAT takes a critical look at a current initiative in Iceland to ban medically unnecessary circumcision. So much for this week. I owe great thanks to DILETTA TEGA and MICHELE MASSA, who took the time to discuss with me the current situation in Italy and the content of the coalition agreement and are wonderful people in general. And here is an editorial announcement: I was lucky enough to get ANNA VON NOTZ, our Associate Editor for parties, electoral law and parliamentarianism (which is a consultative, volunteer function), to sign on to the Verfassungsblog project as an Editor for domestic constitutional issues in Germany alongside me. I am very glad about that, first because Anna is awesome, and second because Verfassungsblog finally shakes off the eggshells of its embryonic stage as Max Steinbeis’s basement project and turns into something with a proper editorial structure – a great adventure which I am very much looking forward to. All the best and a successful week to you! Max Steinbeis DOWNLOAD PDF SUGGESTED CITATION  Steinbeis, Maximilian: Festa della Repubblica, VerfBlog, 2018/6/02, https://verfassungsblog.de/festa-della-repubblica/.","contentWithMarkup":"73 Leser — \"We want to restore confidence in our democracy and in the institutions of the state.\" This is the first sentence of the coalition agreement between the leaders of the Lega and Movimento Cinque Stelle parties who will run the Republic together for the next legislative period in Italy. That is an inspiring phrase for a pair of parties that have built their considerable political success on mistrust ...","tags":[],"publishedDate":"2018-06-02T13:36:17Z","harvestDate":"2018-06-02T21:23:56Z","estimatedPublishedDate":"2018-06-02T13:36:17Z","url":"http://ct.moreover.com/?a=34207109164&p=1u0&v=1&x=vO8ZcrlliVI3ypJLIB5kCQ","originalUrl":"https://verfassungsblog.de/festa-della-repubblica/","outboundUrls":["https://www.corriere.it/politica/18_maggio_18/m5s-lega-ecco-contratto-definitivo-c85cd80a-5a7c-11e8-be88-f6b7fbf45ecc.shtml?refresh_ce-cp","https://verfassungsblog.de/the-people-vs-the-elite-italian-dialectics-and-the-european-malaise/","https://verfassungsblog.de/why-the-italian-presidents-decision-was-legitimate/","https://verfassungsblog.de/the-savona-affaire-overconstitutionalization-in-action/","https://verfassungsblog.de/a-bad-workman-always-blames-his-tools-an-interview-with-laurent-pech/","https://verfassungsblog.de/das-maerchen-von-der-freiheit-des-internets-erste-eindruecke-zum-de-cix-urteil-des-bundesverwaltungsgerichts/","http://agendapublica.elperiodico.com/por-que-pedro-sanchez-ha-ganado-una-mocion-de-censura-improbable/","https://presnolinera.wordpress.com/2018/05/31/algunos-apuntes-urgentes-y-provisionales-sobre-la-mocion-de-censura/","https://www.juwiss.de/54-2018/","https://balkin.blogspot.com/2018/06/the-ratification-of-era.html","https://reason.com/volokh/2018/05/27/the-case-against-deporting-immigrants-co","http://blog.juspoliticum.com/2018/05/31/reforme-institutionnelle-2018-deux-modes-de-scrutin-differents-risquent-ils-daboutir-a-deux-representations-differentes-par-bruno-daugeron/","http://www.iconnectblog.com/2018/05/a-change-in-the-climate-partly-cloudy-with-increasing-litigation-i-connect-column/","http://blogs.lse.ac.uk/europpblog/2018/04/27/the-problem-with-icelands-proposed-ban-on-circumcision/","http://www.printfriendly.com/print/?source=site&url=https://verfassungsblog.de/festa-della-repubblica/","https://verfassungsblog.de/festa-della-repubblica/"],"wordCount":"1876","dataFormat":"text","duplicateGroupId":"34205198964","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"European Union news","group":"Society"}],"companies":[{"name":"Lifull Co Ltd","symbol":"2120","exchange":"TKS","isin":"JP3758140002","titleCount":0,"contentCount":1,"primary":true},{"name":"Lifull Co Ltd","symbol":"NXCLF","exchange":"PINX","isin":"JP3758140002","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"Verfassungsblog","publishingPlatform":{}},"licenses":[],"source":{"name":"Top-Meldungen | JuraBlogs.com - Die Welt juristischer Blogs.","homeUrl":"https://www.jurablogs.com/","location":{"country":"Germany","countryCode":"DE","region":"Europe","subregion":"Western Europe"},"feed":{"id":"555604908","name":"Top-Meldungen | JuraBlogs.com - Die Welt juristischer Blogs.","mediaType":"Blog","description":"Top-Meldungen","tags":[],"language":"German","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"40009","inboundLinkCount":"10"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990253}