{"sequenceId":"845363675754","id":"34207159701","language":"English","title":"Psychiatrist In JonBenét Ramsey Case Among Four People Killed In Arizona, Police Say","content":"PHOENIX (CNN) -- The killings of four people this week in Arizona are thought to be related, Scottsdale Sgt. Ben Hoster said Saturday (June 2).  The victims include famed forensic psychiatrist Steven Pitt, who was involved in several high-profile cases, including the investigation into the death of JonBenét Ramsey in 1996. He was found shot dead in north Scottsdale.  The other victims were 48-year-old Veleria Sharp and 49-year-old Laura Anderson, two paralegals at a Scottsdale law firm who were killed Friday (June 1) afternoon.  They were shot, police said in a news release.  A fourth homicide victim was found Saturday. Police gave an address that is connected to a mental health counselors' office in Scottsdale.  No suspect has been identified. Police say they do not believe there is more than one shooter, whom they referred to a \"him.\"  \"We are in the middle of our investigations so I'm not going to talk about who's being investigated or what's happening,\" Hoster told reporters Saturday. \"We're asking for help from the public.\"  Evidence from each of the three scenes appears to connect the shootings, Hoster said.  The sergeant said he didn't have information that would indicate a serial killer is behind the shootings.","contentWithMarkup":"PHOENIX (CNN) -- The killings of four people this week in Arizona are thought to be related, Scottsdale Sgt. Ben Hoster said Saturday (June 2).\n\nThe victims include famed forensic psychiatrist Steven Pitt, who was involved in several high-profile cases, including the investigation into the death of JonBenét Ramsey in 1996. He was found shot dead in north Scottsdale.\n\nThe other victims were 48-year-old Veleria Sharp and 49-year-old Laura Anderson, two paralegals at a Scottsdale law firm who were killed Friday (June 1) afternoon.\n\nThey were shot, police said in a news release.\n\nA fourth homicide victim was found Saturday. Police gave an address that is connected to a mental health counselors' office in Scottsdale.\n\nNo suspect has been identified. Police say they do not believe there is more than one shooter, whom they referred to a \"him.\"\n\n\"We are in the middle of our investigations so I'm not going to talk about who's being investigated or what's happening,\" Hoster told reporters Saturday. \"We're asking for help from the public.\"\n\nEvidence from each of the three scenes appears to connect the shootings, Hoster said.\n\nThe sergeant said he didn't have information that would indicate a serial killer is behind the shootings.","tags":["News"],"publishedDate":"2018-06-02T21:36:35Z","harvestDate":"2018-06-02T21:36:38Z","estimatedPublishedDate":"2018-06-02T21:36:35Z","url":"http://ct.moreover.com/?a=34207159701&p=1u0&v=1&x=uZIRmeJZgXNyJp8p8j-hag","originalUrl":"http://5newsonline.com/2018/06/02/psychiatrist-in-jonbenet-ramsey-case-among-four-people-killed-in-arizona-police-say/","outboundUrls":[],"wordCount":"197","dataFormat":"text","duplicateGroupId":"34206986125","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"357230"},"adultLanguage":"false","topics":[{"name":"Phoenix news","group":"US regional"}],"companies":[],"author":{"name":"Ninette Sosa","publishingPlatform":{"userId":"110110078"}},"licenses":[],"source":{"name":"Fort Smith/Fayetteville News | 5newsonline KFSM 5NEWS","homeUrl":"http://5newsonline.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"243635329","name":"Fort Smith/Fayetteville News | 5newsonline KFSM 5NEWS","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"29519551","generator":"http://wordpress.com/","description":"Get the local news and weather where you live from 5NEWS. Covering Fort Smith, Fayetteville, Bentonville, and all of Northwest Arkansas and the River Valley.","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"2","autoRankOrder":"2192","inboundLinkCount":"822"},"inWhiteList":"true","autoTopics":[]}},"es_id":86991970}