{"sequenceId":"845362392142","id":"34207118154","language":"English","title":"On Surviving Long Road Trips","content":"We are a little over halfway through our grand 4,300 mile cross-continent road trip. We made it to the Twin Cities just about a week ago – almost exactly a year after we left for our move to Canada. A lot has happened in the last year and a half! We had a baby, Jon left his job, we sold most of our stuff, we sold our house, we moved to a different country, we sold more of our stuff, and then moved again and started our road trip. God has been very good to us. He has sustained us and answered so many of our prayers. Including those for a safe and enjoyable road trip.  Our longest leg of travel was a 14 hour drive through 6 different states – which we made with only four, 15-minute stops! Our boys are definitely troopers! We’ve slept in 9 different places over the last month. Living out of our minivan isn’t as bad as I feared but isn’t exactly enjoyable either -- carefully repacking each piece of luggage after every stay is the part I’m enjoying the least. But we’ve really enjoyed seeing so much of the country and so many of our friends and family along the way.  So here are some road trip survival tips that we’ve picked up along the way...  Tip #1: Buy a headphone splitter  We put all 3 of the older boys in the back of the van and then Jen rigged up the iPad so that they could all see it and could all listen to it on their headphones. It was totally quiet (except for the occasional giggling), so we got to listen to our own audio books and podcasts and even have adult conversation without any interruptions!  Tip #2: Download audiobooks and movies to your mobile devices  Our local library allows you to check out electronic audiobooks using their app. It’s really slick and they actually have a pretty large selection. Check with your library to see if they have anything similar. We downloaded a bunch of Netflix kid shows onto the iPad as well.  Tip #3: Install a pulley system to pass snacks to the back row (and trash to the front)  We used some parachute cord and carabineers to rig up a pulley system. It usually works pretty well (unless the boys try to do pull-ups on it).  Tip #4: Eat in the car  Pack sandwiches and LOTS of snack food. Why try to make the kids sit still in a restaurant and eat their food when they’ve already been sitting in the car all day long?! Talk about an exercise in futility… Better to occupy their time in the car with eating and use stops for physical activity. Did I mention lots of snacks?  Tip #5: Be as active as you can at every stop  Run, jump, stretch. Do jumping jacks, squats, or anything that will get the kids moving. And do it with them! (Don’t mind the stares of the passers-by…)  Tip #6: Use a car-top carrier  It frees up a bunch of space inside your vehicle. Of course for us, it was a simple necessity since we have so many car seats and so much stuff for our 3 month road trip. The one downside is that it does noticeably decrease our gas mileage. But we think it’s still totally worth it. We got a waterproof bag-style one for pretty cheap and have been very pleased with it.  Tip #7: Applesauce pouches  They quench thirst with less liquid. Enough said...","contentWithMarkup":"We are a little over halfway through our grand 4,300 mile cross-continent road trip. We made it to the Twin Cities just about a week ago – almost exactly a year after we left for our move to Canada. A lot has happened in the last year and a half! We had a baby, Jon left his job, we sold most of our stuff, we sold our house, we moved to a different country, we sold more of our stuff, and then moved again and started our road trip. God has been very good to us. He has sustained us and answered so many of our prayers. Including those for a safe and enjoyable road trip.\n\nOur longest leg of travel was a 14 hour drive through 6 different states – which we made with only four, 15-minute stops! Our boys are definitely troopers! We’ve slept in 9 different places over the last month. Living out of our minivan isn’t as bad as I feared but isn’t exactly enjoyable either -- carefully repacking each piece of luggage after every stay is the part I’m enjoying the least. But we’ve really enjoyed seeing so much of the country and so many of our friends and family along the way.\n\nSo here are some road trip survival tips that we’ve picked up along the way...\n\nTip #1: Buy a headphone splitter\n\nWe put all 3 of the older boys in the back of the van and then Jen rigged up the iPad so that they could all see it and could all listen to it on their headphones. It was totally quiet (except for the occasional giggling), so we got to listen to our own audio books and podcasts and even have adult conversation without any interruptions!\n\nTip #2: Download audiobooks and movies to your mobile devices\n\nOur local library allows you to check out electronic audiobooks using their app. It’s really slick and they actually have a pretty large selection. Check with your library to see if they have anything similar. We downloaded a bunch of Netflix kid shows onto the iPad as well.\n\nTip #3: Install a pulley system to pass snacks to the back row (and trash to the front)\n\nWe used some parachute cord and carabineers to rig up a pulley system. It usually works pretty well (unless the boys try to do pull-ups on it).\n\nTip #4: Eat in the car\n\nPack sandwiches and LOTS of snack food. Why try to make the kids sit still in a restaurant and eat their food when they’ve already been sitting in the car all day long?! Talk about an exercise in futility… Better to occupy their time in the car with eating and use stops for physical activity. Did I mention lots of snacks?\n\nTip #5: Be as active as you can at every stop\n\nRun, jump, stretch. Do jumping jacks, squats, or anything that will get the kids moving. And do it with them! (Don’t mind the stares of the passers-by…)\n\nTip #6: Use a car-top carrier\n\nIt frees up a bunch of space inside your vehicle. Of course for us, it was a simple necessity since we have so many car seats and so much stuff for our 3 month road trip. The one downside is that it does noticeably decrease our gas mileage. But we think it’s still totally worth it. We got a waterproof bag-style one for pretty cheap and have been very pleased with it.\n\nTip #7: Applesauce pouches\n\nThey quench thirst with less liquid. Enough said...\n\n<img class=\"alignnone size-full wp-image-1749\" src=\"https://jmoefamily.files.wordpress.com/2018/06/car-pics-2.jpg\" alt=\"Car Pics 2\" width=\"1064\" height=\"1064\" />","tags":[],"publishedDate":"2018-06-02T21:26:04Z","harvestDate":"2018-06-02T21:26:09Z","estimatedPublishedDate":"2018-06-02T21:26:04Z","url":"http://ct.moreover.com/?a=34207118154&p=1u0&v=1&x=0VJpgaljj-UwmPrSigG1MA","originalUrl":"https://jmoefamily.wordpress.com/2018/06/02/on-surviving-long-road-trips/","outboundUrls":[],"wordCount":"577","dataFormat":"text","duplicateGroupId":"34207118154","media":{"audio":[],"images":[{"url":"https://jmoefamily.files.wordpress.com/2018/06/car-pics-2.jpg"}],"video":[],"logo":[]},"publishingPlatform":{"itemId":"1748"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"jmoefamily","publishingPlatform":{"userId":"96993946"}},"licenses":[],"source":{"name":"moefamily","homeUrl":"https://jmoefamily.wordpress.com","location":{},"feed":{"id":"563204785","name":"moefamily","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"102111009","generator":"http://wordpress.com/","description":"following the moe family adventures","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"9","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990588}