{"sequenceId":"845362325569","id":"34207115098","language":"English","title":"'Cunning, deceitful savages': 200 years of Māori bad press","content":"Māori have found it hard to shake off myths and stereotypes.      It has been three months since National Geographic took the brave and unusual step of owning up. , the long-running magazine confessed to what had been in plain sight all along: the magazine had reinforced racist and colonial attitudes. For example, when it devoted a special issue to Australia in 1916, it told readers that that Aboriginal Australians were \"savages\" who \"rank lowest in intelligence of all human beings\".     The magazine would regularly depict \"natives\" as \"exotics, famously and frequently unclothed, happy hunters, noble savages – every type of cliche,\" editor in chief Susan Goldberg wrote.     National Geographic is hardly alone but its influence on generations of readers was greater than most. Its confession prompted a question: what images of Māori have been perpetuated by our news media and entertainment and culture industry, in books, news stories, cartoons, songs, TV shows and movies? Should we be just as sorry as National Geographic ? The short answer is yes. What follows is a survey of more than 200 years of racism disguised as news and entertainment in which Māori were routinely depicted as lazy, dishonest, primitive, drunk, stupid, violent and greedy. All incorrect uses of Māori language have been left as they were.    THE 19TH CENTURY    Lazy, degraded, warlike and so on. Scholars have not settled the question of how widespread cannibalism was among pre-contact Māori, but all agree it must be understood as a consequence of tribal battle. Cannibalism remained a Pākehā obsession until well into the 20th century. In other ways, Māori fit the European checklist of savagery, with some missionaries shocked by their \"heathen\" natures, but other writers would come to praise the Māori as a better class of savage than most and despite the warrior stereotypes, Māori Studies and Anthropology professor Dame Anne Salmond​ has found many examples of Māori men being seen as \"kind, loving and devoted to their children\".  A myth grew during the 19th century that Māori had killed and eaten the \"inferior\" Moriori, who survived only on the Chathams, or so the story went. This was sometimes used to justify the subjugation of Māori by Pākehā. By the century's end, it was assumed that Māori were themselves a dying race.     \"The inhabitants of these islands … appear to me to be descended from a once powerful people … Here gradually degenerating into barbarism, from a high state of civilisation … they ultimately passed to the last stage of moral degradation.\"  John Liddiard Nicholas, from Narrative of a Voyage to New Zealand , 1817.    \"Oh what a wretched spot is a heathen pa, human excrement and filth in every direction so that it is almost impossible to avoid treading in it – wretchedness in every form, women all but naked with their heads and bodies smeared with ochre and oil, shrieking or crying and dirty children running about in a state of nudity all combine to form as wretched a whole as can well be imagined.\"  Missionary Richard Taylor.      CF Goldie's paintings, such as this 1898 work produced with John Steele, contributed to negative depictions of Māori.      \"The Maori, however educated … is a Maori still. He has received a kind of rough polish, which only deceives the unobservant; but beneath this varnish he is a cunning, scheming, deceitful savage … In the attempt to govern the natives we have made a false start. He was treated as if his mental constitution and moral nature were identical with our own race. The reverse of this being the case, we have signally failed.\"  The Southern Cross newspaper, 1865.    \"They [the Moriori] are far inferior to the Maoris physically, and, I should say, mentally too ... I saw Moriori settlements far behind any pa I had ever seen. The poor creatures have a squalid, wayworn look, and almost excite one's pity; but I am afraid they are thoroughly lazy and indolent.\"  The Reverend PC Anderson in the New Zealand Herald , 1882.     \"Time was not at all precious to the Maori. He squatted in the sun, wrapped up in mat or blanket, smoked his pipe, or had a comfortable doze; while his pig, tethered by a rope of flax, grunted and winked, and grubbed up and chumped the young roots of the fern.\"  From Our Maoris by Lady Martin, 1884.     \"The Maori boys and girls between the speeches sang English glees and catches with great spirit. It was a pleasant surprise to find that the New Zealanders, when properly taught, had much musical talent and very good voices.\"  Lady Martin.    \"We should remember that Roman colonists must have found the Briton as rough and unwashen​ and self-willed and prejudiced as the Maoris, and that it has taken more than a thousand years to bring us to our present form of civilisation.\"  Lady Martin.    \"Where once the swarthy chief held savage sway, / The sun of progress sheds his brightest ray.\"  Thomas Bracken from the poem \"Jubilee Day\", in  Musings in Maoriland , 1890. A poet and politician, Bracken also wrote God Defend New Zealand .       Māori were made to look ridiculous in this cartoon by Arthur Herbert Messenger, published in 1918.      \"The great body of the Europeans throughout the colony now regard the natives with indifference. They do not pretend to understand the native character. They do not trouble themselves to entertain anticipations of their advancement to civilisation. They look upon them as an obstacle to the spread of settlement, and so far a drawback to the colony.\"  NZ Herald , 1897.    \"The seamy side of Maori life, as of all savage life, was patent to the most unimaginative observer. The traveller found it not easy to dwell on the dignity, poetry, and bravery of a race which contemned​ washing, and lived, for the most part, in noisome hovels ... Though a cannibal feast was a rare orgie​, putrid food was a common dainty. Without the cringing manner of the Oriental, the Maori had his full share of deceitfulness. Elaborate treachery is constantly met with in the accounts of their wars. If adultery was rare, chastity among the single women was rarer still.\"  William Pember Reeves in The Long White Cloud , 1898.     \"The average colonist regards a Mongolian with repulsion, a Negro with contempt, and looks on an Australian black as very near a wild beast; but he likes the Maoris.\"  William Pember Reeves.       \"The passing of the Māori\" as imagined by cartoonist John Collis Blomfield in 1906.      THE 20TH CENTURY    At the start of the century, the image of Māori as a dying race was reinforced by Pākehā artists like CF Goldie and Gottfried Lindaeur. Art historian Leonard Bell explains in his book Colonial Constructs that they gave \"pictorial expression\" to \"the standard European view of traditional Maoridom as either of the past or something the last remnants of which were about to vanish for all time in the face of European progress\". That \"the  New Zealand Herald  in 1907 could comment casually on the few 'last specimens' of a 'vanishing national entity' suggests what a popular commonplace the notion of vanishing Maori was,\" Bell writes.  But rather than decline, Māori populations began to grow again and as Māori became more urban, stereotypes moved out of the past and into the present. By the late 20th century, the so-called \"grievance industry\" created by the Waitangi Tribunal and Treaty claims had become a more topical target.     \"The people of New Zealand were very much concerned with where the Maoris came from, but were not so much concerned as to where they were going to. 'Yes,' remarked the speaker, 'we are a dying race and the question arises: Is another race doomed to extinction before the cruel march of civilisation.'\"  The Poverty Bay Herald , 1900.    \"Sir Walter Buller stated that in Capt. Cook's time there must have been 100,000, and at the period of the first colonisation of New Zealand about 70,000, but now there are only between about 30,000 and 40,000 Maoris. In 1856 Sir Isaac (then Dr) Featherston said 'the Maoris are dying out fast, nothing can save them; our plain duty as compassionate colonists is to smooth the dying pillow of the Maori; then history will have nothing to reproach us with.'\"  The Southland Times , 1900.       It took just three generations to go from savagery to civilisation, according to this cartoon from 1923.      \"It is perhaps not so well known as it should be that the Maoris were not the first inhabitants of New Zealand – they were preceded by a race known as the Morioris, who are represented in recent times by the Chatham Islanders ... They were inferior to the Maoris in physique, less civilised, poorly armed, and at one time classed as Melanesians or Asiatic Negroes.\"  The Clutha Leader , 1903.    \"They built no huts, and were content with the most meagre shelter afforded by miserably constructed lean-to hovels. Without fixed abode, they wandered about almost aimlessly, and camped where night overtook them ... It has been remarked by more than one authority that in features they strangely resembled the Jewish type.\"  The Press covers the Moriori, 1904.     \"It is true that the Maoris were cannibals. It is true that war was their chief occupation and recreation, but they retained a measure of culture which has never been equalled by any primitive dark race of the world.\"  Frances Del Mar in A Year Among the Maoris , 1924.    \"To sum up: in conditions of steady, continuous work, demanding strength, endurance, and steady application, the Maori is not the equal to the European settler. The discipline that produces these qualities is the product of more advanced civilizations, and is not a feature of the lower planes of civilization.\"  Elsdon Best in The Maori as he was , 1934.       These are \"dinkum horries\" according to mid-20th century cartoonist Neville Maurice Colvin.      \"It is unquestionable, I think, that a great many of the Maori people voted Labour because of what they hoped to get from social security.\"  Sidney Holland, Leader of the Opposition, 1947.    \"Had there been an abundance of meat available it is possible that there might not have been any room later for white people, but a continual diet of fish with only an occasional Moa entree is sufficient reason to turn anyone cannibal.\"  Carl V Smith in From N to Z , 1947.    \"Although the Maoris did not seem averse to marrying some of the tangata whenua women, they did their best to exterminate the men, as if they had been vermin, whenever they had the opportunity.\"  HDB Dansey in How the Maoris Came to Aotearoa , 1947. By \"tangata whenua\", Dansey meant the Moriori.       The character \"Hori\" was overweight and happy-go-lucky. He also enjoyed a beer.      \"The Maoris were exactly the same as the Morioris, only different. They ate people only when all other methods of correction had been tried and used a slower oven.\"  John Magurk​ and Terence Journet​ in Hysteric New Zealand , 1949.     \"This pakeha tells me to fill in the form and to be very careful to state how many people are in the house – males, females and kids – and to give their ages and say what they do for a crust.  'That will be a very hard question to answer,' I tell him. 'Take my wife's brother, who, by the way, is my brother-in-law. No one knows his age and I doubt if he knows it himself, and as for occupation, he has been looking for a job for years and praying to the Lord that he will not find one.'  I go on to tell this coot that I am too busy to answer all these questions 'cause they do not make much sense when there are more important things to think about like the Springboks and the rise in the price of draught ale.\"  Hori, from Flagon Fun , 1966. The Te Ara history website explains that \"in the early 1960s the Pākehā writer W Norman McCallum published several bestselling comedic books under the pseudonym 'Hori'. The pseudonym was chosen as a typical Māori name, and the books depicted Māori as overweight, lazy and happy-go-lucky.\" Other titles included The Half-Gallon Jar and Fill it up Again!    [embedded content]    \"Down by the mudpools, once upon a time,  In the land of the Long White Cloud,  The hungry tribesmen gathered for a meeting  And a warrior spoke to the crowd:  Py corry, boys, I've had enough  Of this stuff call moabone stew.  If you want to put some meat in  To the kai that you've been eating  I've got a new soup for you.    I call it, puha and Pakeha, puha and Pakeha,  The finest food you could ever wish for,  Better line a big fat flaxen dish for  Puha and Pakeha.    Give me some puha and Pakeha, puha and Pakeha,  I don't miss your chips or cream pavlovas,  I want a dish with no leftovers,  Puha and Pakeha.\"  Lyrics from the song Puha and Pakeha , by Rod Derrett, released in the 1960s.     \"One cannot help wondering, in retrospect, whether the Maori women would have served their interests better by refraining from indulging in their unseemly display of emotion, which has left an impression of them as being a group of emotional immoderates.\"  Anthony Haas criticises the Māori Women's Welfare League in Salient in 1964. The league had opposed the depiction of a Māori family in Ans Westra's controversial photo essay, Washday at the Pa .    [embedded content]   \"I like comparing the way that people handle things. I like comparing the way Caucasian people handle things as opposed to the way Maori people handle things. The Maori kids are much more enterprising, eh. A Caucasian child will come up to me and say, 'Gidday, Billy, can I have your autograph?' Whereas a Maori kid will come up and say, 'Gidday, Billy. Give us two dollars.\"  Billy T James, the 1980s.     \"The outlook for Wednesday is stink too. So you may as well go to work.\"  Billy T James reads the weather on Te News , the 1980s.    [embedded content]   \"In the last years of the 20th century, letters to the editor and contributions to talkback radio revealed that large numbers of New Zealanders still saw the Moriori as a dark-skinned, thick-lipped, wide-nosed race who inhabited New Zealand before the Maori and were forced to flee in the face of superior Polynesian enterprise and vitality.\"  Michael King, from Moriori: A People Rediscovered , 1989.    \"Duff is dismissive of the fashionable excuses, the Waitangi nonsense and all the other wearingly familiar and frequently exploitive​ rubbish trotted out to explain Maori self-degradation.\"  Bob Jones praises Alan Duff's novel  Once Were Warriors , 1991.     \"The burgeoning Maori industry ... are milking these seemingly endless opportunities to take dollops of public money in return for looking intensely grave and periodically barking out a bevy of Maori sentences which none of their listeners understand.\"  Bob Jones, 1991.     THE 21ST CENTURY    The so-called \"grievance industry\" remained a popular target for some Pākehā commentators. But the new century has also seen more complicated approaches to the depiction of Māori, such as in the animated series bro'Town, the reality show The GC  and the movie Boy .     \"At last! ... Somebody to blame!\"  by Garrick Tremain, published in the Otago Daily Times in 2000, a group of Māori watch from the shore as European explorers arrive. The National Library explains: \"There was growing public disquiet about what has become known as the 'Treaty of Waitangi Industry', and the tendency of some of Maoridom's leaders to blame European society for all Maori social and economic problems.\" (Tremain declined permission to reproduce the cartoon.)     \"Wait till you hear about this one. Prepare to go ballistic. We've had the taniwha in recent weeks, we've had the sand on the North Shore beach and now the mountain, a mountain called Kopukairoa, in Welcome Bay, just outside of Tauranga.\"  Paul Holmes introduces a Holmes item about a mountain that was registered as wāhi tapu, 2002. The Broadcasting Standards Authority said the item was inflammatory and inaccurate and ordered TVNZ to broadcast a statement. Former Holmes reporter Duncan Garner said: \"I was uncomfortable with what went to air. I objected absolutely.\"      \"It is bizarre that, in a society where the Prime Minister refuses to allow grace to be said at a state banquet, because, she says, we are an increasingly secular society, we fly Maori elders around the world to lift tapu and expel evil spirits from New Zealand embassies ... We are becoming a society that allows people to invent or rediscover beliefs for pecuniary gain.\"  National Party leader Don Brash delivers  at the Orewa Rotary Club in 2004.     \"If you look to mainstream programming that has a Maori presence ...  Dream Home ,  Shortland Street ,  Ten Years Younger ,  Intrepid Journeys ,  Location Location ,  Animal House ,  Game of Two Halves ,  Police Ten-7 ...\"  Former TVNZ boss Rick Ellis before the Māori Affairs Select Committee in Parliament, 2007.     \"On certain days of the week there are great congregations of Maoris in Kerikeri. They sit in parked cars and chat through the window. They buy fish-and-chips at the takeaway and eat it off butcher paper in the park. They splurge on lotto tickets, tailor-mades, pies with sauce, cream buns, and cases of beer.\"  Christina Thompson in Come on Shore and We Will Kill and Eat You All , 2008. The American Thompson wrote about her marriage to a Māori man. The book was poorly received in New Zealand.    [embedded content]   \"One way bro'Town employs reverse discourse is  through intertextuality​ – referring to other, negative representations of ethnic culture. The character of Jeff da Maori for example is straight out of Once Were Warriors : illiterate, ignorant, with his 'eight Dads' hanging round in leather jackets, wearing sunglasses and drinking beer; he lives in an abandoned car on the lawn, much like the character Tu. This plays, then, not on a 'true' but rather a familiar representation of Maori as 'pot smoking dole­ bludgers who are also really good singers'.\"  Matthew Bannister in the New Zealand Journal of Media Studies , 2008.     \" bro'Town  was not universally celebrated. A number of prominent Māori and Samoan intellectuals deplored its exaggerated use of stereotypes, condemning the series for perpetuating rather than undermining conditions that entrench racial inequity. For example, Melanie Anae has argued that  bro'Town  promotes the stereotype of 'the happy-go-lucky' funny brown coconut that Pacific Islanders 'fought against in the 70s', and that [writer Oscar] Kightley​ is one of a number of Pacific artists, playwrights and entertainers who 'pick the negatives of our cultures and get rich on it by entertaining people'.\"   Sarina Pearson in the  Journal of the Polynesian Society , 2013.    [embedded content]   \"Being from Taranaki the opening sequence accompanied by the Pātea Māori Club hit Poi E was familiar and fun. The ET quote provided the quirkiness that one has come to expect from any Waititi film. My own children had told me about the opening and how funny it was to see a Kuia in the car saying goodbye to her mokopuna and to then see them all pushing the car for it to jump-start.  Pushing cars in that manner was something I remembered as a common occurrence of that time. But the fun of this scene disappeared as the Kuia drove away and left all the mokopuna to fend for themselves for a week. At that point the familiarity merged with all the negative stereotypes of our people that have been the basis for so many films in this country. And sadly that feeling never changed for the remainder of the film. Rather, I sat wondering why such a film even needed to be made. Earlier reflections of Once Were Warriors came flooding back. I had entered into the world of lame stereotypes yet again and felt an instant disappointment.\"  Leonie Pihama reviews Taika Waititi's film Boy in the  Media Studies Journal of Aotearoa New Zealand , 2012.       The reality show The GC featured Māori enjoying the good life on the Gold Coast.      THE 2010s AND LANGUAGE BATTLES    The Native Schools Act of 1867 decreed that Māori children should be taught in English and they were punished for speaking their own language. The language withered and it was not until the 1980s that strenuous efforts were made to keep it alive. Thirty years later, there is increasing use and acceptance of Te Reo among Pākehā but some commentators still insist it is irrelevant.      \"It makes  Come Dine with Me  look like classical Shakespeare, and if you think the language is too difficult the show comes with its own list of lingo, dumbo subtitles to make sure you haven't missed one scintillating witticism of the cuzzie bros and their wahines' utterances.\"  Jane Bowron reviews The GC  for Stuff in 2015 .  started life as a NZ On Air-funded documentary series called Golden Mozzies , about seven Māori families living on Australia's Gold Coast.    \"They had been to a piss up on a neighbouring island (probably Hawaii) and had got lost on the way home. Throwing their 'navigator' overboard in a fit of pique hadn't helped and when they arrived they were, to put it mildly, somewhat out of sorts and of a belligerent disposition. This regrettably led to the immediate extermination and in many cases consumption of the previous inhabitants. As KFC hadn't arrived yet and the Maoris had eaten all the Moas feeding the family at times was a bit of a problem.\"   Balclutha fishing lobbyist Nelson Cross explains early New Zealand history in a newsletter in 2016. He was  from his position on the South East Marine Protection Forum.    \"Maori Language Week, now a permanent annual fixture, is one of those occasions when our determination to give no offence blossoms into the urge to grovel. This year was the best yet, with media apologists the length and breadth of the land prostrating themselves before the holy altar of te reo. Radio New Zealand took the prize, in a seven-day fiesta of cringing servility that, were Billy T James still with us, would have provided him with material forever.  For the last couple of years, of course, RNZ has been ahead of the pack in obsequiousness. Everything indigenous is sacrosanct, and even formerly redoubtable interviewers now shrink from the slightest demur when boring bigots drone on about the mana of all things native.  The whole business has become surreal. One morning, for example, a couple of Maori snowflakes were banging on about the terrible grief they were suffering from the mispronunciation of their names. Not only were they themselves being insulted by this, but so were their ancestors, the whole tribal boiling of them, right back to the first canoe.\"  Columnist Dave Witherow in the Otago Daily Times , 2017.     \"It is not a government's job to go round saving languages.  Why not? Because you have to ask yourself why it's in trouble. And the answer is simple: People don't want to bother with it. It's not like they don't have the choice. It's not like they haven't had the choice forever ... And if you forced kids to learn it they would learn at the expense of what? Maths? History?\"  Mike Hosking in the New Zealand Herald , 2","contentWithMarkup":"Māori have found it hard to shake off myths and stereotypes.      It has been three months since National Geographic took the brave and unusual step of owning up. , the long-running magazine confessed to what had been in plain sight all along: the magazine had reinforced racist and colonial attitudes. For example, when it devoted a special issue to Australia in 1916, it told readers that that Aboriginal Australians were \"savages\" who \"rank lowest in intelligence of all human beings\".     The magazine would regularly depict \"natives\" as \"exotics, famously and frequently unclothed, happy hunters, noble savages – every type of cliche,\" editor in chief Susan Goldberg wrote.     National Geographic is hardly alone but its influence on generations of readers was greater than most. Its confession prompted a question: what images of Māori have been perpetuated by our news media and entertainment and culture industry, in books, news stories, cartoons, songs, TV shows and movies? Should we be just as sorry as National Geographic ? The short answer is yes. What follows is a survey of more than 200 years of racism disguised as news and entertainment in which Māori were routinely depicted as lazy, dishonest, primitive, drunk, stupid, violent and greedy. All incorrect uses of Māori language have been left as they were.    THE 19TH CENTURY    Lazy, degraded, warlike and so on. Scholars have not settled the question of how widespread cannibalism was among pre-contact Māori, but all agree it must be understood as a consequence of tribal battle. Cannibalism remained a Pākehā obsession until well into the 20th century. In other ways, Māori fit the European checklist of savagery, with some missionaries shocked by their \"heathen\" natures, but other writers would come to praise the Māori as a better class of savage than most and despite the warrior stereotypes, Māori Studies and Anthropology professor Dame Anne Salmond​ has found many examples of Māori men being seen as \"kind, loving and devoted to their children\".  A myth grew during the 19th century that Māori had killed and eaten the \"inferior\" Moriori, who survived only on the Chathams, or so the story went. This was sometimes used to justify the subjugation of Māori by Pākehā. By the century's end, it was assumed that Māori were themselves a dying race.     \"The inhabitants of these islands … appear to me to be descended from a once powerful people … Here gradually degenerating into barbarism, from a high state of civilisation … they ultimately passed to the last stage of moral degradation.\"  John Liddiard Nicholas, from Narrative of a Voyage to New Zealand , 1817.    \"Oh what a wretched spot is a heathen pa, human excrement and filth in every direction so that it is almost impossible to avoid treading in it – wretchedness in every form, women all but naked with their heads and bodies smeared with ochre and oil, shrieking or crying and dirty children running about in a state of nudity all combine to form as wretched a whole as can well be imagined.\"  Missionary Richard Taylor.      CF Goldie's paintings, such as this 1898 work produced with John Steele, contributed to negative depictions of Māori.      \"The Maori, however educated … is a Maori still. He has received a kind of rough polish, which only deceives the unobservant; but beneath this varnish he is a cunning, scheming, deceitful savage … In the attempt to govern the natives we have made a false start. He was treated as if his mental constitution and moral nature were identical with our own race. The reverse of this being the case, we have signally failed.\"  The Southern Cross newspaper, 1865.    \"They [the Moriori] are far inferior to the Maoris physically, and, I should say, mentally too ... I saw Moriori settlements far behind any pa I had ever seen. The poor creatures have a squalid, wayworn look, and almost excite one's pity; but I am afraid they are thoroughly lazy and indolent.\"  The Reverend PC Anderson in the New Zealand Herald , 1882.     \"Time was not at all precious to the Maori. He squatted in the sun, wrapped up in mat or blanket, smoked his pipe, or had a comfortable doze; while his pig, tethered by a rope of flax, grunted and winked, and grubbed up and chumped the young roots of the fern.\"  From Our Maoris by Lady Martin, 1884.     \"The Maori boys and girls between the speeches sang English glees and catches with great spirit. It was a pleasant surprise to find that the New Zealanders, when properly taught, had much musical talent and very good voices.\"  Lady Martin.    \"We should remember that Roman colonists must have found the Briton as rough and unwashen​ and self-willed and prejudiced as the Maoris, and that it has taken more than a thousand years to bring us to our present form of civilisation.\"  Lady Martin.    \"Where once the swarthy chief held savage sway, / The sun of progress sheds his brightest ray.\"  Thomas Bracken from the poem \"Jubilee Day\", in  Musings in Maoriland , 1890. A poet and politician, Bracken also wrote God Defend New Zealand .       Māori were made to look ridiculous in this cartoon by Arthur Herbert Messenger, published in 1918.      \"The great body of the Europeans throughout the colony now regard the natives with indifference. They do not pretend to understand the native character. They do not trouble themselves to entertain anticipations of their advancement to civilisation. They look upon them as an obstacle to the spread of settlement, and so far a drawback to the colony.\"  NZ Herald , 1897.    \"The seamy side of Maori life, as of all savage life, was patent to the most unimaginative observer. The traveller found it not easy to dwell on the dignity, poetry, and bravery of a race which contemned​ washing, and lived, for the most part, in noisome hovels ... Though a cannibal feast was a rare orgie​, putrid food was a common dainty. Without the cringing manner of the Oriental, the Maori had his full share of deceitfulness. Elaborate treachery is constantly met with in the accounts of their wars. If adultery was rare, chastity among the single women was rarer still.\"  William Pember Reeves in The Long White Cloud , 1898.     \"The average colonist regards a Mongolian with repulsion, a Negro with contempt, and looks on an Australian black as very near a wild beast; but he likes the Maoris.\"  William Pember Reeves.       \"The passing of the Māori\" as imagined by cartoonist John Collis Blomfield in 1906.      THE 20TH CENTURY    At the start of the century, the image of Māori as a dying race was reinforced by Pākehā artists like CF Goldie and Gottfried Lindaeur. Art historian Leonard Bell explains in his book Colonial Constructs that they gave \"pictorial expression\" to \"the standard European view of traditional Maoridom as either of the past or something the last remnants of which were about to vanish for all time in the face of European progress\". That \"the  New Zealand Herald  in 1907 could comment casually on the few 'last specimens' of a 'vanishing national entity' suggests what a popular commonplace the notion of vanishing Maori was,\" Bell writes.  But rather than decline, Māori populations began to grow again and as Māori became more urban, stereotypes moved out of the past and into the present. By the late 20th century, the so-called \"grievance industry\" created by the Waitangi Tribunal and Treaty claims had become a more topical target.     \"The people of New Zealand were very much concerned with where the Maoris came from, but were not so much concerned as to where they were going to. 'Yes,' remarked the speaker, 'we are a dying race and the question arises: Is another race doomed to extinction before the cruel march of civilisation.'\"  The Poverty Bay Herald , 1900.    \"Sir Walter Buller stated that in Capt. Cook's time there must have been 100,000, and at the period of the first colonisation of New Zealand about 70,000, but now there are only between about 30,000 and 40,000 Maoris. In 1856 Sir Isaac (then Dr) Featherston said 'the Maoris are dying out fast, nothing can save them; our plain duty as compassionate colonists is to smooth the dying pillow of the Maori; then history will have nothing to reproach us with.'\"  The Southland Times , 1900.       It took just three generations to go from savagery to civilisation, according to this cartoon from 1923.      \"It is perhaps not so well known as it should be that the Maoris were not the first inhabitants of New Zealand – they were preceded by a race known as the Morioris, who are represented in recent times by the Chatham Islanders ... They were inferior to the Maoris in physique, less civilised, poorly armed, and at one time classed as Melanesians or Asiatic Negroes.\"  The Clutha Leader , 1903.    \"They built no huts, and were content with the most meagre shelter afforded by miserably constructed lean-to hovels. Without fixed abode, they wandered about almost aimlessly, and camped where night overtook them ... It has been remarked by more than one authority that in features they strangely resembled the Jewish type.\"  The Press covers the Moriori, 1904.     \"It is true that the Maoris were cannibals. It is true that war was their chief occupation and recreation, but they retained a measure of culture which has never been equalled by any primitive dark race of the world.\"  Frances Del Mar in A Year Among the Maoris , 1924.    \"To sum up: in conditions of steady, continuous work, demanding strength, endurance, and steady application, the Maori is not the equal to the European settler. The discipline that produces these qualities is the product of more advanced civilizations, and is not a feature of the lower planes of civilization.\"  Elsdon Best in The Maori as he was , 1934.       These are \"dinkum horries\" according to mid-20th century cartoonist Neville Maurice Colvin.      \"It is unquestionable, I think, that a great many of the Maori people voted Labour because of what they hoped to get from social security.\"  Sidney Holland, Leader of the Opposition, 1947.    \"Had there been an abundance of meat available it is possible that there might not have been any room later for white people, but a continual diet of fish with only an occasional Moa entree is sufficient reason to turn anyone cannibal.\"  Carl V Smith in From N to Z , 1947.    \"Although the Maoris did not seem averse to marrying some of the tangata whenua women, they did their best to exterminate the men, as if they had been vermin, whenever they had the opportunity.\"  HDB Dansey in How the Maoris Came to Aotearoa , 1947. By \"tangata whenua\", Dansey meant the Moriori.       The character \"Hori\" was overweight and happy-go-lucky. He also enjoyed a beer.      \"The Maoris were exactly the same as the Morioris, only different. They ate people only when all other methods of correction had been tried and used a slower oven.\"  John Magurk​ and Terence Journet​ in Hysteric New Zealand , 1949.     \"This pakeha tells me to fill in the form and to be very careful to state how many people are in the house – males, females and kids – and to give their ages and say what they do for a crust.  'That will be a very hard question to answer,' I tell him. 'Take my wife's brother, who, by the way, is my brother-in-law. No one knows his age and I doubt if he knows it himself, and as for occupation, he has been looking for a job for years and praying to the Lord that he will not find one.'  I go on to tell this coot that I am too busy to answer all these questions 'cause they do not make much sense when there are more important things to think about like the Springboks and the rise in the price of draught ale.\"  Hori, from Flagon Fun , 1966. The Te Ara history website explains that \"in the early 1960s the Pākehā writer W Norman McCallum published several bestselling comedic books under the pseudonym 'Hori'. The pseudonym was chosen as a typical Māori name, and the books depicted Māori as overweight, lazy and happy-go-lucky.\" Other titles included The Half-Gallon Jar and Fill it up Again!    [embedded content]    \"Down by the mudpools, once upon a time,  In the land of the Long White Cloud,  The hungry tribesmen gathered for a meeting  And a warrior spoke to the crowd:  Py corry, boys, I've had enough  Of this stuff call moabone stew.  If you want to put some meat in  To the kai that you've been eating  I've got a new soup for you.    I call it, puha and Pakeha, puha and Pakeha,  The finest food you could ever wish for,  Better line a big fat flaxen dish for  Puha and Pakeha.    Give me some puha and Pakeha, puha and Pakeha,  I don't miss your chips or cream pavlovas,  I want a dish with no leftovers,  Puha and Pakeha.\"  Lyrics from the song Puha and Pakeha , by Rod Derrett, released in the 1960s.     \"One cannot help wondering, in retrospect, whether the Maori women would have served their interests better by refraining from indulging in their unseemly display of emotion, which has left an impression of them as being a group of emotional immoderates.\"  Anthony Haas criticises the Māori Women's Welfare League in Salient in 1964. The league had opposed the depiction of a Māori family in Ans Westra's controversial photo essay, Washday at the Pa .    [embedded content]   \"I like comparing the way that people handle things. I like comparing the way Caucasian people handle things as opposed to the way Maori people handle things. The Maori kids are much more enterprising, eh. A Caucasian child will come up to me and say, 'Gidday, Billy, can I have your autograph?' Whereas a Maori kid will come up and say, 'Gidday, Billy. Give us two dollars.\"  Billy T James, the 1980s.     \"The outlook for Wednesday is stink too. So you may as well go to work.\"  Billy T James reads the weather on Te News , the 1980s.    [embedded content]   \"In the last years of the 20th century, letters to the editor and contributions to talkback radio revealed that large numbers of New Zealanders still saw the Moriori as a dark-skinned, thick-lipped, wide-nosed race who inhabited New Zealand before the Maori and were forced to flee in the face of superior Polynesian enterprise and vitality.\"  Michael King, from Moriori: A People Rediscovered , 1989.    \"Duff is dismissive of the fashionable excuses, the Waitangi nonsense and all the other wearingly familiar and frequently exploitive​ rubbish trotted out to explain Maori self-degradation.\"  Bob Jones praises Alan Duff's novel  Once Were Warriors , 1991.     \"The burgeoning Maori industry ... are milking these seemingly endless opportunities to take dollops of public money in return for looking intensely grave and periodically barking out a bevy of Maori sentences which none of their listeners understand.\"  Bob Jones, 1991.     THE 21ST CENTURY    The so-called \"grievance industry\" remained a popular target for some Pākehā commentators. But the new century has also seen more complicated approaches to the depiction of Māori, such as in the animated series bro'Town, the reality show The GC  and the movie Boy .     \"At last! ... Somebody to blame!\"  by Garrick Tremain, published in the Otago Daily Times in 2000, a group of Māori watch from the shore as European explorers arrive. The National Library explains: \"There was growing public disquiet about what has become known as the 'Treaty of Waitangi Industry', and the tendency of some of Maoridom's leaders to blame European society for all Maori social and economic problems.\" (Tremain declined permission to reproduce the cartoon.)     \"Wait till you hear about this one. Prepare to go ballistic. We've had the taniwha in recent weeks, we've had the sand on the North Shore beach and now the mountain, a mountain called Kopukairoa, in Welcome Bay, just outside of Tauranga.\"  Paul Holmes introduces a Holmes item about a mountain that was registered as wāhi tapu, 2002. The Broadcasting Standards Authority said the item was inflammatory and inaccurate and ordered TVNZ to broadcast a statement. Former Holmes reporter Duncan Garner said: \"I was uncomfortable with what went to air. I objected absolutely.\"      \"It is bizarre that, in a society where the Prime Minister refuses to allow grace to be said at a state banquet, because, she says, we are an increasingly secular society, we fly Maori elders around the world to lift tapu and expel evil spirits from New Zealand embassies ... We are becoming a society that allows people to invent or rediscover beliefs for pecuniary gain.\"  National Party leader Don Brash delivers  at the Orewa Rotary Club in 2004.     \"If you look to mainstream programming that has a Maori presence ...  Dream Home ,  Shortland Street ,  Ten Years Younger ,  Intrepid Journeys ,  Location Location ,  Animal House ,  Game of Two Halves ,  Police Ten-7 ...\"  Former TVNZ boss Rick Ellis before the Māori Affairs Select Committee in Parliament, 2007.     \"On certain days of the week there are great congregations of Maoris in Kerikeri. They sit in parked cars and chat through the window. They buy fish-and-chips at the takeaway and eat it off butcher paper in the park. They splurge on lotto tickets, tailor-mades, pies with sauce, cream buns, and cases of beer.\"  Christina Thompson in Come on Shore and We Will Kill and Eat You All , 2008. The American Thompson wrote about her marriage to a Māori man. The book was poorly received in New Zealand.    [embedded content]   \"One way bro'Town employs reverse discourse is  through intertextuality​ – referring to other, negative representations of ethnic culture. The character of Jeff da Maori for example is straight out of Once Were Warriors : illiterate, ignorant, with his 'eight Dads' hanging round in leather jackets, wearing sunglasses and drinking beer; he lives in an abandoned car on the lawn, much like the character Tu. This plays, then, not on a 'true' but rather a familiar representation of Maori as 'pot smoking dole­ bludgers who are also really good singers'.\"  Matthew Bannister in the New Zealand Journal of Media Studies , 2008.     \" bro'Town  was not universally celebrated. A number of prominent Māori and Samoan intellectuals deplored its exaggerated use of stereotypes, condemning the series for perpetuating rather than undermining conditions that entrench racial inequity. For example, Melanie Anae has argued that  bro'Town  promotes the stereotype of 'the happy-go-lucky' funny brown coconut that Pacific Islanders 'fought against in the 70s', and that [writer Oscar] Kightley​ is one of a number of Pacific artists, playwrights and entertainers who 'pick the negatives of our cultures and get rich on it by entertaining people'.\"   Sarina Pearson in the  Journal of the Polynesian Society , 2013.    [embedded content]   \"Being from Taranaki the opening sequence accompanied by the Pātea Māori Club hit Poi E was familiar and fun. The ET quote provided the quirkiness that one has come to expect from any Waititi film. My own children had told me about the opening and how funny it was to see a Kuia in the car saying goodbye to her mokopuna and to then see them all pushing the car for it to jump-start.  Pushing cars in that manner was something I remembered as a common occurrence of that time. But the fun of this scene disappeared as the Kuia drove away and left all the mokopuna to fend for themselves for a week. At that point the familiarity merged with all the negative stereotypes of our people that have been the basis for so many films in this country. And sadly that feeling never changed for the remainder of the film. Rather, I sat wondering why such a film even needed to be made. Earlier reflections of Once Were Warriors came flooding back. I had entered into the world of lame stereotypes yet again and felt an instant disappointment.\"  Leonie Pihama reviews Taika Waititi's film Boy in the  Media Studies Journal of Aotearoa New Zealand , 2012.       The reality show The GC featured Māori enjoying the good life on the Gold Coast.      THE 2010s AND LANGUAGE BATTLES    The Native Schools Act of 1867 decreed that Māori children should be taught in English and they were punished for speaking their own language. The language withered and it was not until the 1980s that strenuous efforts were made to keep it alive. Thirty years later, there is increasing use and acceptance of Te Reo among Pākehā but some commentators still insist it is irrelevant.      \"It makes  Come Dine with Me  look like classical Shakespeare, and if you think the language is too difficult the show comes with its own list of lingo, dumbo subtitles to make sure you haven't missed one scintillating witticism of the cuzzie bros and their wahines' utterances.\"  Jane Bowron reviews The GC  for Stuff in 2015 .  started life as a NZ On Air-funded documentary series called Golden Mozzies , about seven Māori families living on Australia's Gold Coast.    \"They had been to a piss up on a neighbouring island (probably Hawaii) and had got lost on the way home. Throwing their 'navigator' overboard in a fit of pique hadn't helped and when they arrived they were, to put it mildly, somewhat out of sorts and of a belligerent disposition. This regrettably led to the immediate extermination and in many cases consumption of the previous inhabitants. As KFC hadn't arrived yet and the Maoris had eaten all the Moas feeding the family at times was a bit of a problem.\"   Balclutha fishing lobbyist Nelson Cross explains early New Zealand history in a newsletter in 2016. He was  from his position on the South East Marine Protection Forum.    \"Maori Language Week, now a permanent annual fixture, is one of those occasions when our determination to give no offence blossoms into the urge to grovel. This year was the best yet, with media apologists the length and breadth of the land prostrating themselves before the holy altar of te reo. Radio New Zealand took the prize, in a seven-day fiesta of cringing servility that, were Billy T James still with us, would have provided him with material forever.  For the last couple of years, of course, RNZ has been ahead of the pack in obsequiousness. Everything indigenous is sacrosanct, and even formerly redoubtable interviewers now shrink from the slightest demur when boring bigots drone on about the mana of all things native.  The whole business has become surreal. One morning, for example, a couple of Maori snowflakes were banging on about the terrible grief they were suffering from the mispronunciation of their names. Not only were they themselves being insulted by this, but so were their ancestors, the whole tribal boiling of them, right back to the first canoe.\"  Columnist Dave Witherow in the Otago Daily Times , 2017.     \"It is not a government's job to go round saving languages.  Why not? Because you have to ask yourself why it's in trouble. And the answer is simple: People don't want to bother with it. It's not like they don't have the choice. It's not like they haven't had the choice forever ... And if you forced kids to learn it they would learn at the expense of what? Maths? History?\"  Mike Hosking in the New Zealand Herald , 2","tags":[],"harvestDate":"2018-06-02T21:25:14Z","estimatedPublishedDate":"2018-06-02T21:25:14Z","url":"http://ct.moreover.com/?a=34207115098&p=1u0&v=1&x=nCtaI816WC6_NYSTxQYY2g","originalUrl":"https://www.stuff.co.nz/life-style/103871652/cunning-deceitful-savages-200-years-of-mori-bad-press","outboundUrls":[],"wordCount":"3795","dataFormat":"text","duplicateGroupId":"34206029634","media":{"audio":[],"images":[{"url":"https://resources.stuff.co.nz/content/dam/images/1/q/5/o/3/b/image.related.StuffLandscapeSixteenByNine.620x349.1pubvo.png/1527974231832.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"PHILIP MATTHEWS","publishingPlatform":{}},"licenses":[{"name":"Publicly Available"}],"source":{"name":"NZ House & Garden","homeUrl":"http://nzhouseandgarden.co.nz","category":"Consumer","editorialRank":"4","location":{"country":"New Zealand","countryCode":"NZ","region":"Oceania","subregion":"Australia and New Zealand"},"feed":{"id":"548286259","name":"NZ House & Garden","mediaType":"News","tags":[],"language":"Unassigned","dataFormat":"text","rank":{"inboundLinkCount":"252"},"inWhiteList":"true","autoTopics":[],"editorialTopics":["Lifestyle","Consumer"],"genre":"General"}},"es_id":86990518}