{"sequenceId":"845362189596","id":"34207110904","language":"English","title":"Playing Out the Depression Playbook","content":"“A crash is coming, and it may be terrific…The vicious circle will get in full swing and the result will be a serious business depression. There may be a stampede for selling which will exceed anything that the Stock Exchange has ever witnessed…Wise are those investors who now get out of debt.” - Roger Babson, September, 1929 In the run-up to the 1929 crash, which heralded in the Great Depression, many pundits claimed that the new highs in the market signified that the business cycle had been “repealed.” Stocks had never enjoyed such a bull market before and this led many to believe that “the sky’s the limit.” All over the US, people put all the money they could find into stocks. Then, wanting to buy more, they bought on margin. Then, wanting still more, they borrowed privately to buy on margin – a double-dip into debt. In essence, this meant that a large portion of the extreme bull market was the result of stock investments that were made with money that didn’t exist – a mere “promise” to somehow pay, with nothing to back that promise up. This, of course, is the very essence of a bubble. And, sooner or later, bubbles pop. After the crash, the pundits that had driven the market ever-upward were all but speechless, saying only, “No one could have predicted this.” However, it was predicted by those who understood market bubbles. Roger Babson, in particular, made the statement above to the Annual Business Conference in Massachusetts on 5th September, 1929. At that time, he was vilified by Wall Street for making such an obviously false proclamation, yet, after the crash, he was again vilified for having brought on the crash with his statement. Neither was true and no lesson was learned by those who created the crash. Yet, it was the logical conclusion to the buildup of events. In fact there could have been no other outcome… and the same is true today. The twenty trillion dollar debt that the US government has created is far beyond anything the world has ever seen and, in fact, it exceeds the total of all other countries combined. To add insult to injury, the unfunded liabilities of Medicare, Medicaid, Social Security, etc., bring the total real debt to over one hundred trillion - an amount so large that not even the interest can be repaid. Although Republicans have traditionally railed against debt, they’ve recently voted in a dramatic tax cut, with no corresponding cut in federal spending. This is akin to an addict giving himself a shot of heroin. A brief period of investment in business will occur, but, within a year, it will be followed by a deeper tightening. In addition, dramatically increased spending has been approved. Republicans have joined Democrats in the elimination of budget caps on defense (read: foreign invasions) and domestic spending. Entitlement spending is higher than at any time in history, yet that, too, will be expanded. (Even the poor understand that expenditure cannot be increased if income has been curtailed, yet this basic arithmetic has been overlooked by legislators.) Hence, both Democrats and Republicans are on board for dead-ended economic policies that will lead to a depression. The present economic condition is riper for a crash than ever before in history. In 1929, it was triggered by the central bank raising the interest rate, assuring that those who were up to their chins in debt were now under water, as the cost of borrowed money had just risen. And, of course, the Fed has raised rates repeatedly in the last year and has announced that it will raise them five times more over the next two years. Which rise will prove to be the trigger this time around? All right, so a crash appears inevitable, but surely, a crash does not ensure a depression. So, let’s have a look at the events that took place after Black Friday in 1929 that sent much of the world into a prolonged economic collapse. Decreased International Trade The Smoot Hawley Tariff of 1930 introduced “protective” tariffs that instead sparked a trade war with other countries. Today, there’s a slight difference. Rather than wait for a crash, the US government has created major tariffs prior to the crash, speeding the process up. Announcements have been made that more may be on the way. Demand for Goods Throughout the “roaring 20’s,” the demand for goods rose at an unprecedented rate. This has been blamed on greed by some economists, but, in truth, it was fueled by a loose money policy by banks, willing to offer loans to all and sundry. Today, the level of money-lending is far beyond that of 1929. Never before in history has the private sector debt level been so high. Its total now exceeds the total of private sector assets. Bank Failures By 1929, the amount of money that had been loaned far exceeded the amount of money that banks held on deposit. A crash assured that the non-existence of the money was revealed. Credit crashed and thousands of banks went under, taking people’s savings with them. In 1933, the FDIC was created to assure that this could never happen again, yet, today, the FDIC is underfunded to the point that it cannot bail out even one major bank. (This time around, bail-in laws will allow the banks to simply absorb deposits legally.) Unemployment The banks had provided the loans that created the spending spree. When they went into liquidation, the demand for goods dropped off dramatically. As sales dried up, countless people lost their jobs. And many of those jobs never came back, assuring that the Great Depression would far outlast any previous depression. All of the conditions that were present in 1929 are once again in place today. Although we can’t project a precise trigger date for the bubble to burst, it most certainly will do so, as do all bubbles. But, what we can do is anticipate that, historically, the crash and its subsequent damage are invariably equal to the level of indebtedness. As the present level so far exceeds what existed in 1929, we can presume that the crash itself will be far more devastating, as will be the subsequent damage. The Depression Playbook has been faithfully followed. However, the reader need not choose to play. If he sees fit, he can opt out. Although time may now be rather short, he may choose to do all he can to remove himself from the system, so that his own economic life is impacted as minimally as possible. Courtesy of Jeff Thomas, Sprott Money  The author is not affiliated with, endorsed or sponsored by Sprott Money Ltd. The views and opinions expressed in this material are those of the author or guest speaker, are subject to change and may not necessarily reflect the opinions of Sprott Money Ltd. Sprott Money does not guarantee the accuracy, completeness, timeliness and reliability of the information or any results from its use. The views and opinions expressed herein are the author's own, and do not necessarily reflect those of EconMatters. © EconMatters.com All Rights Reserved | Facebook | Twitter | YouTube | Email Digest economy Sprott 6/02/2018 02:00:00 PM","contentWithMarkup":"“A crash is coming, and it may be terrific…The vicious circle will get in full swing and the result will be a serious business depression. There may be a stampede for selling which will exceed anything that the Stock Exchange has ever witnessed…Wise are those investors who now get out of debt.” -...<br/>\n<br/>\nPlease click on the post title or visit http://www.econmatters.com for full content.<div class=\"feedflare\">\n<a href=\"http://feeds.feedburner.com/~ff/EconForecast?a=luI6AR4diAY:xD1UsMxO2m8:I9og5sOYxJI\"><img src=\"http://feeds.feedburner.com/~ff/EconForecast?d=I9og5sOYxJI\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/EconForecast?a=luI6AR4diAY:xD1UsMxO2m8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/EconForecast?d=qj6IDK7rITs\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/EconForecast?a=luI6AR4diAY:xD1UsMxO2m8:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/EconForecast?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/EconForecast?a=luI6AR4diAY:xD1UsMxO2m8:bcOpcFrp8Mo\"><img src=\"http://feeds.feedburner.com/~ff/EconForecast?d=bcOpcFrp8Mo\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/EconForecast?a=luI6AR4diAY:xD1UsMxO2m8:V_sGLiPBpWU\"><img src=\"http://feeds.feedburner.com/~ff/EconForecast?i=luI6AR4diAY:xD1UsMxO2m8:V_sGLiPBpWU\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/EconForecast?a=luI6AR4diAY:xD1UsMxO2m8:gIN9vFwOqvQ\"><img src=\"http://feeds.feedburner.com/~ff/EconForecast?i=luI6AR4diAY:xD1UsMxO2m8:gIN9vFwOqvQ\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/EconForecast/~4/luI6AR4diAY\" height=\"1\" width=\"1\" alt=\"\"/>","tags":["economy","Sprott"],"publishedDate":"2018-06-02T19:00:11Z","harvestDate":"2018-06-02T21:24:24Z","estimatedPublishedDate":"2018-06-02T19:00:11Z","url":"http://ct.moreover.com/?a=34207110904&p=1u0&v=1&x=Bd2JP6xzxe5GpvOXj4iuWQ","originalUrl":"https://www.econmatters.com/2018/06/playing-out-depression-playbook.html","outboundUrls":["https://4.bp.blogspot.com/-bd4bsE3pWSE/WxK7DK4uF4I/AAAAAAAAI7E/h7AEt1Uk13sx_s-kV2v-lYuGznTN4GdPACLcBGAs/s1600/graph-3078540_960_720.png","http://www.sprottmoney.com/?mw_aref=ca165dff42226ed5478f0dccf5118a4d","http://www.facebook.com/EconMatters","http://twitter.com/#!/EconMatters","http://feedburner.google.com/fb/a/mailverify?uri=EconForecast","https://www.blogger.com/email-post.g?blogID=4722060956500512885&postID=1984693087406334011","http://feeds.feedburner.com/~ff/EconForecast?a=luI6AR4diAY:xD1UsMxO2m8:I9og5sOYxJI","http://feeds.feedburner.com/~ff/EconForecast?a=luI6AR4diAY:xD1UsMxO2m8:qj6IDK7rITs","http://feeds.feedburner.com/~ff/EconForecast?a=luI6AR4diAY:xD1UsMxO2m8:yIl2AUoC8zA","http://feeds.feedburner.com/~ff/EconForecast?a=luI6AR4diAY:xD1UsMxO2m8:bcOpcFrp8Mo","http://feeds.feedburner.com/~ff/EconForecast?a=luI6AR4diAY:xD1UsMxO2m8:V_sGLiPBpWU","http://feeds.feedburner.com/~ff/EconForecast?a=luI6AR4diAY:xD1UsMxO2m8:gIN9vFwOqvQ"],"wordCount":"1184","dataFormat":"text","duplicateGroupId":"34163812073","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"Central Bank Corp","symbol":"CBSU","exchange":"PINX","isin":"US15251P1084","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"Econ Matters","publishingPlatform":{}},"licenses":[],"source":{"name":"EconMatters Global","homeUrl":"http://www.econmatters.com/","location":{},"feed":{"id":"92190419","name":"EconMatters Global","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"EconMatters.com Posts in preview format","tags":["economy","EconMatters","guest post","Video","Stocks","China","investing","Fed","Europe","commodities","crude","energy","geopolitics","Trading","Politics","ZH","currency","gold","Bond","tech","interest rates","Michael Snyder","Emerging Markets","policy","inflation","unemployment","EW","Oil Market","iMFdirect","te"],"imageUrl":"http://2.bp.blogspot.com/-y3CH3iEyyOU/VTfGKUJEm2I/AAAAAAAAE_A/8V2JTycNwtc/s1600/econ%2Blogo%2Bfinal.png","language":"English","dataFormat":"text","rank":{"autoRank":"4","autoRankOrder":"13596","inboundLinkCount":"57"},"inWhiteList":"true","autoTopics":["ugc economics feeds","ugc financial feeds"]}},"es_id":86990334}