{"sequenceId":"845363688967","id":"34207159744","language":"English","title":"Study: Marijuana Use Has No Harmful Effects On Brain Structure","content":"From CBDoilECO   The data from the study showed that marijuana use isn’t in any way connected with individual brain structure differences. According to a new study, which will soon be published in the scientific journal Addiction, there is no link between the continuous use of cannabis and changes in the structure of the brain. In total, 20 researchers from 13 institutions across the United States, Australia, and the United Kingdom participated in the study; they looked into the relationship between habitual marijuana use and the structure of the brain in 1,096 middle-aged men and young adults. For the study, researchers used MRI screenings to evaluate the connection between frequent marijuana use and the volumes of gray matter in seven brain regions. They inspected the thalamus, putamen, caudate nucleus, pallidum, amygdala, hippocampus, and nucleus accumbens. Once the research was completed, the researchers found no connection between cannabis use and brain morphology. Finally, they came to the conclusion that “standard variation in marijuana use is statistically unassociated with brain morphology as measured by subcortical volumes in non-clinical samples.” During the research, researchers also recorded the maximum alcohol and nicotine use, and total lifespan multi-drug use of the subjects. Here is what they found; in middle-aged men, there was a strong connection between nicotine and substantial decreases in the size of the thalamus. The thalamus is in charge of relaying sensory signals and regulating sleep, consciousness, and alertness. The discoveries are noteworthy, especially if we take some earlier studies into account. One such troubling study from the past found evidence of habitual marijuana use being connected with multiple changes in the shape and size of brain parts which are associated with motivation and emotion. However, the findings from this most recent study fail to support those. Scientists are now connecting those brain changes with the use of other drugs, as well as nicotine and alcohol. “This is the biggest investigative analysis which integrates brain imaging with self-report marijuana and comorbid substance use data,” the researchers concluded. They added that cannabis use hadn’t affected the volume at any subcortical regions in either middle-aged men or young adults. Similar Findings The findings of this research are consistent with those of a meta-analysis which were printed earlier this month; that research found that marijuana exposure in teenagers and young adults isn’t in any way connected with substantial long-term harmful cognitive performance effects. Last year, a co-twin control study, done on people over a long period of time, also didn’t find a link between negative changes in the IQ or executive functioning and cannabis use. In an unrelated study conducted a year prior to that, researchers similarly reported no connection between marijuana use and IQ declines. There is more and more evidence that cannabis is safe; that should help ease public health concerns about legalized medical and recreational marijuana which continues to expand all over the United States. Advertisements","contentWithMarkup":"From CBDoilECO   The data from the study showed that marijuana use isn’t in any way connected with individual brain structure differences. According to a new study, which will soon be published in the scientific journal Addiction, there is no link between the continuous use of cannabis and changes in the structure of the brain. … <a href=\"https://patients4medicalmarijuana.wordpress.com/2018/06/02/study-marijuana-use-has-no-harmful-effects-on-brain-structure/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> \"Study: Marijuana Use Has No Harmful Effects On Brain Structure\"</span></a>","tags":[],"publishedDate":"2018-06-02T21:36:34Z","harvestDate":"2018-06-02T21:36:39Z","estimatedPublishedDate":"2018-06-02T21:36:34Z","url":"http://ct.moreover.com/?a=34207159744&p=1u0&v=1&x=Rew18z8t33E614q7m9ScoQ","originalUrl":"https://patients4medicalmarijuana.wordpress.com/2018/06/02/study-marijuana-use-has-no-harmful-effects-on-brain-structure/","outboundUrls":["https://cbdoileco.com/marijuana-no-harmful-effects/","https://www.sciencedaily.com/releases/2014/04/140415181156.htm","https://www.ncbi.nlm.nih.gov/pubmed/28646566","https://onlinelibrary.wiley.com/doi/abs/10.1111/add.14252"],"wordCount":"479","dataFormat":"text","duplicateGroupId":"34207159744","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"10080"},"adultLanguage":"false","topics":[{"name":"Illegal drugs news","group":"Society"}],"companies":[],"author":{"name":"Admin","publishingPlatform":{"userId":"7699935"}},"licenses":[],"source":{"name":"Patients for Medical Cannabis","homeUrl":"https://patients4medicalmarijuana.wordpress.com","location":{},"feed":{"id":"93483613","name":"Patients for Medical Cannabis","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"7415045","generator":"http://wordpress.com/","description":"Sharing information about medicinal use & legalization of Cannabis (Marijuana) & Hemp","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"6","autoRankOrder":"65826","inboundLinkCount":"4"},"inWhiteList":"true","autoTopics":["ugc medical feeds","ugc health feeds","ugc science feeds"]}},"es_id":86991995}