{"sequenceId":"845362185013","id":"34207110509","language":"English","title":"Today is the day","content":"This is the motivational statement that always stuck in my mind. No time is better to do things you want to do than now. Whatever it is you want to accomplish, today is the best day to start doing it. I try and work every single day, even though a lot of days are spent doing research in the nature or traveling or just thinking. There is a lot going on behind the scenes - finished product - a painting or a sculpture is a small part of artist's efforts. I have been busy writing new proposals. I took a whole year off from doing this because it was emotionally draining to get so many rejections in 2016. I wrote about 40 proposals and every single one was rejected, and I was not able to secure a space to show my newest body of work in 2018. I have been very productive last year and this year, and feel it is time to try again. Writing is not my strong quality, but I do what I can. I cannot provide verbal diarrhea required of artists today, and I keep things simple and to the point. No, I am not going to change the whole world with my art, or describe \"human condition\", or provide \"narrative\" to boggle deep thinking minds. What I hope to achieve is to give a sliver of beauty to the observer, create some emotional response in a world of a few people who find meaning in my work. I am sticking to my theme \"Ancestors\" this year - it has been quite a journey so far and I cannot wait to share more. Roots, 11x23\"","contentWithMarkup":"This is the motivational statement that always stuck in my mind. No time is better to do things you want to do than now. Whatever it is you want to accomplish, today is the best day to start doing it.<br />I try and work every single day, even though a lot of days are spent doing research in the nature or traveling or just thinking. There is a lot going on behind the scenes - finished product - a painting or a sculpture is a small part of artist's efforts.<br /><br />I have been busy writing new proposals. I took a whole year off from doing this because it was emotionally draining to get so many rejections in 2016. I wrote about 40 proposals and every single one was rejected, and I was not able to secure a space to show my newest body of work in 2018. I have been very productive last year and this year, and feel it is time to try again.<br />Writing is not my strong quality, but I do what I can. I cannot provide verbal diarrhea required of artists today, and I keep things simple and to the point. No, I am not going to change the whole world with my art, or describe \"human condition\", or provide \"narrative\" to boggle deep thinking minds. What I hope to achieve is to give a sliver of beauty to the observer, create some emotional response in a world of a few people who find meaning in my work. I am sticking to my theme \"Ancestors\" this year - it has been quite a journey so far and I cannot wait to share more.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-mi19Me7lH28/WxLA3Q-N7zI/AAAAAAAAIBs/Np9yRB--7qMpNoHqimt1zX0zkWnSFJ-ggCLcBGAs/s1600/IMG_6783.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1600\" data-original-width=\"762\" height=\"400\" src=\"https://2.bp.blogspot.com/-mi19Me7lH28/WxLA3Q-N7zI/AAAAAAAAIBs/Np9yRB--7qMpNoHqimt1zX0zkWnSFJ-ggCLcBGAs/s400/IMG_6783.jpg\" width=\"190\" /></a></div>Roots, 11x23\"","tags":[],"publishedDate":"2018-06-02T16:08:19Z","harvestDate":"2018-06-02T21:24:20Z","estimatedPublishedDate":"2018-06-02T16:08:19Z","url":"http://ct.moreover.com/?a=34207110509&p=1u0&v=1&x=x44SqKhxFLxEH7qdi9VVXQ","originalUrl":"http://artbynv.blogspot.com/2018/06/today-is-day.html","commentsUrl":"http://artbynv.blogspot.com/2018/06/today-is-day.html#comment-form","outboundUrls":["https://2.bp.blogspot.com/-mi19Me7lH28/WxLA3Q-N7zI/AAAAAAAAIBs/Np9yRB--7qMpNoHqimt1zX0zkWnSFJ-ggCLcBGAs/s1600/IMG_6783.jpg"],"wordCount":"273","dataFormat":"text","duplicateGroupId":"34207110509","media":{"audio":[],"images":[{"url":"https://2.bp.blogspot.com/-mi19Me7lH28/WxLA3Q-N7zI/AAAAAAAAIBs/Np9yRB--7qMpNoHqimt1zX0zkWnSFJ-ggCLcBGAs/s400/IMG_6783.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"N V","publishingPlatform":{}},"licenses":[],"source":{"name":"Nataša Vretenar's Art","homeUrl":"http://artbynv.blogspot.com/","location":{},"feed":{"id":"98186769","name":"Nataša Vretenar's Art","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"Nataša Vretenar is an artist in Edmonton, Alberta.","tags":["vretenar","natasa","acrylic","painting","art","texture","alberta","artist","edmonton","bosnia","poppies","abstract","bright","koi","paintings","bear","bosna","umjetnost","new mexico","contemporary","daily","hercegovina","poppy","wolf","colours","impasto","painter","show","challenge","mountain","painted desert new "],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990324}