{"sequenceId":"845363645083","id":"34207158637","language":"English","title":"3499 - Off To See Soyo A Stare Warz Storing","content":"So, by the time this post is eventually published, I will be off to watch that Soyo movie... or is it Solow... wait, maybe it's Lowblow? I don't know... that movie and stuff. I don't know if the viewing will entice me to do some semblance of a full-blown post or revive that slideshow movie reviews, but if nothing else, it'll be an interesting ride to say the least. Hopefully, the end result will be an enjoyable film if not a good one. On blog-related matters, I'm presently rendering the House Show at the moment and if all goes well, it should be up live on Youtube tonight or tomorrow. Said show will probably be featured tomorrow on the blog, so check the channel later on to see if the upload made it in one piece. There's bound to be glitches (my first attempt in a year), but hopefully things'll be ironed out for the next one... assuming there is a next one.","contentWithMarkup":"So, by the time this post is eventually published, I will be off to  watch that Soyo movie... or is it Solow... wait, maybe it's Lowblow? I  don't know... that movie and stuff. I don't know if the viewing will  entice me to do some semblance of a full-blown post or revive that  slideshow movie reviews, but if nothing else, it'll be an interesting ride to say the least. Hopefully, the end result will be an enjoyable film if not a good one.<br /><br />On blog-related matters, I'm presently rendering the House Show at the moment and if all goes well, it should be up live on Youtube tonight or tomorrow. Said show will probably be featured tomorrow on the blog, so check the channel later on to see if the upload made it in one piece. There's bound to be glitches (my first attempt in a year), but hopefully things'll be ironed out for the next one... assuming there is a next one.","tags":["Jedi And Stuff","Movies And Television"],"publishedDate":"2018-06-02T16:30:03Z","harvestDate":"2018-06-02T21:36:22Z","estimatedPublishedDate":"2018-06-02T16:30:03Z","url":"http://ct.moreover.com/?a=34207158637&p=1u0&v=1&x=ETNzQKMKfQ_-7gFOwTtVzw","originalUrl":"http://www.dtm666.com/2018/06/3499-off-to-see-soyo-stare-warz-storing.html","commentsUrl":"http://www.dtm666.com/2018/06/3499-off-to-see-soyo-stare-warz-storing.html#comment-form","outboundUrls":[],"wordCount":"163","dataFormat":"text","duplicateGroupId":"34206534619","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Dave Mac","publishingPlatform":{}},"licenses":[],"source":{"name":"DTM Rambles...","homeUrl":"http://www.dtm666.com/","location":{},"feed":{"id":"107844642","name":"DTM Rambles...","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"Incoherent Randomness From A Rambling Mind.","tags":["Wrestling Musings","Video Gaming","Reviews","WTF","Blog Updates","Musings","Power Rangers","Quotables","DTM Gallery","VLOG","Movies And Television","Fanfiction","BITE","DTM Archive","Commentaries","DTM-Cast","Collection Vid","Star Trekkish","Comics","Grumble Grumble","WrestleGameFights","Doggy St"],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86991927}