{"sequenceId":"845367452572","id":"34207268061","language":"English","title":"Top Candidates - Partner for Shea Weber","content":"Aside perhaps for the centre position, one of the most glaring needs for the Montreal Canadiens is for a mobile, puck-moving left handed defenseman who can log quality minutes on the top pairing to play along Shea Weber. Of course, winning the Draft lottery would have gone a long way as a player like Rasmus Dahlin would have been the prototypical prospect to be groomed alongside Weber, but we know now that it’s not a possibility. While Canadiens’ General Manager Marc Bergevin does have some young blueliners bringing hope to the team, finding a proven top-4 defenseman bringing experience would go a long way in helping goaltender Carey Price bounce back from a very bad season to his standards.  Without further ado, let’s have a look as some names that may be available either through free agency or through trades, perhaps some that are already in the Habs’ brass’ plans. UNRESTRICTED FREE AGENTS Dan Hamhuis – Dallas Stars AGE: 35 HEIGHT: 6’1″ WEIGHT: 204 lbs GP: 80 G: 3 A: 21 PTS: 24 TOI/G: 20:11 +/-: -6 STATUS: UFA JUSTIFICATION: At age 35, Hamhuis would be a stop-gap. He still logged some major minutes last year with the Stars and on a one or two year contract, he could be helpful, also as a mentor to young Victor Mete and Mike Reilly. He can play a sound defensive game and also be used in a shutdown role. He moves the puck very well out of the defensive zone and he has loads of hockey sense. He can also fill in with a more offensive role if or when required. Thomas Hickey – New York Islanders AGE: 29 HEIGHT: 6’0″ WEIGHT: 188 lbs GP: 69 G: 5 A: 20 PTS: 25 TOI/G: 18:04 +/-: +20 STATUS: UFA JUSTIFICATION: Hickey is very much underrated, but he is very much appreciated by his coaches and teammates. He’s great at moving the puck quickly up ice and fairly sound in his own end. He is also extremely mobile and does not make a lot of mistakes in his own end. John Moore – New Jersey Devils AGE: 27 HEIGHT: 6’2″ WEIGHT: 210 GP: 81 G: 7 A: 11 PTS: 18 TOI/G: 20:01 +/-: +3 STATUS: UFA JUSTIFICATION: Moore is one of my favourite candidates as a UFA for the position. He has a big frame and owns exceptional skating ability. He is a very steady defender and he shoots the puck with aplomb. His speed is useful all over the ice. Calvin De Hann – New York Islanders AGE: 27 HEIGHT: 6’1″ WEIGHT: 198 lbs GP: 33 G: 1 A: 11 PTS: 12 TOI/G: 18:04 +/-: +11 STATUS: UFA JUSTIFICATION: De Haan was lost for the season in December, having shoulder surgery but he has since confirmed that he will be ready for the start of the 2018-19 season. When healthy, he is very reliable in his own end. He skates extremely well and owns good puck-moving skills. His type of low-maintenance game can register huge amounts of ice time. TRADES Jake Muzzin – Los Angeles AGE: 29 HEIGHT: 6’3″ WEIGHT: 213 lbs GP: 74 G: 8 A: 34 PTS: 42 TOI/G: 21:39 +/-: +10 STATUS: $4M until 2019-20 JUSTIFICATION: The Kings have the most money committed towards next year’s cap and with the way they were bounced out of the playoffs, they will be looking at making some change, possibly freeing up some salary cap in the process. Muzzin has good size and a great point shot. He moves the puck well out of danger and can log big minutes. Alec Martinez – Los Angeles AGE: 30 HEIGHT: 6’1″ WEIGHT: 208 lbs GP: 77 G: 9 A: 16 PTS: 25 TOI/G: 22:52 +/-: +3 STATUS: $4M until 2020-21 JUSTIFICATION: As mentioned, the Kings may want and/or need to make moves. Martinec is a strong, swift and well-balanced skater with two-way ability. He also has solid puck-moving and passing skills. He usually keeps things simple and limits mistakes. Oscar Klefbom – Edmonton Oilers AGE: 24 HEIGHT: 6’3″ WEIGHT: 215 GP: 66 G: 5 A: 16 PTS: 21 TOI/G: 22:51 +/-: -12 STATUS: $4.167 until 2022-23 JUSTIFICATION: Prior to the trade deadline back in March, Sportsnet’s Elliott Friedman was saying that the Oilers were showcasing Klefbom and speculations continue. The Oilers have several RFA’s to sign, including Ryan Strome and Darnell Nurse, and McDavid and Draisaitl’s contracts kick in this upcoming season. Klefbom owns great shutdown ability, excellent mobility and sound positioning. He can log huge minutes and is a factor on both special teams, but that didn’t keep pundits in Edmonton from pointing the finger at him for the team’s disappointing season. Kris Russell – Edmonton Oilers AGE: 31 HEIGHT: 5’10” WEIGHT: 173 lbs GP: 78 G: 4 A: 17 PTS: 21 TOI/G: 19:04 +/-: -7 STATUS: $4M until 2020-21 JUSTIFICATION: If not Klefbom, Russell is another possibility. Most known around the league as a tremendous shot-blocking defenseman – his best attribute – he plays with confidence with the puck. Russell also has enough offensive instincts to play on the power play and he does move the puck with aplomb. He definitely has great wheels and is able to skate out of trouble. T.J. Brodie – Calgary Flames AGE: 27 HEIGHT: 6’1″ WEIGHT: 182 lbs GP: 73 G: 4 A: 28 PTS: 32 TOI/G: 23:41 +/-: -16 STATUS: $4.65M until 2019-20 JUSTIFICATION: The Flames keep popping in mind when I think of teams ready to make a big move, and with the Canadiens owning the 3rd overall pick, it makes me wonder what they could pitch to Marc Bergevin to bite for trading it to them, assuming that they want Brady Tkachuk, younger brother Matthew, who already is an impact player on their team. One of the players that would help the Habs is Brodie, a defenseman who moves the puck well and is an even better skater. His offensive ability seems untapped, as he can run the power play and jump up into the rush. He is definitely capable of logging huge amounts of ice time. Oh and no, I’m NOT suggesting the 3rd overall pick for Brodie, in case someone thinks that I’ve completely lost my mind. As for the value for any of those defensemen in trades, it obviously varies depending on the target. While rumours are circulating that the Habs are in negotiation with Max Pacioretty, many still think that it is very likely that he will be traded at the deadline. Based on his production being higher than Duchene and what Colorado received, the return would have to be substantial. Alex Galchenyuk‘s name often returns into rumours as well, and we know that Bergevin is wanting to make some change. We shall see who he was pointing to when talking about “attitude” in the dressing room. Is it June 22nd yet? Go Habs Go!   Advertisements","contentWithMarkup":"Aside perhaps for the centre position, one of the most glaring needs for the Montreal Canadiens is for a mobile, puck-moving left handed defenseman who can log quality minutes on the top pairing to play along Shea Weber. Of course, winning the Draft lottery would have gone a long way as a player like Rasmus Dahlin … <a href=\"http://habsterix.com/2018/06/02/top-candidates-partner-for-shea-weber/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> \"Top Candidates - Partner for Shea Weber\"</span></a>","tags":["Hockey topics","Canadiens","Habs","Marc Bergevin","Montreal Canadiens","Shea Weber","Trade Rumours","UFA"],"publishedDate":"2018-06-02T22:01:04Z","harvestDate":"2018-06-02T22:01:13Z","estimatedPublishedDate":"2018-06-02T22:01:04Z","url":"http://ct.moreover.com/?a=34207268061&p=1u0&v=1&x=2Utk8GC8CO_CgKRudcX2LA","originalUrl":"https://habsterix.com/2018/06/02/top-candidates-partner-for-shea-weber/","outboundUrls":["https://www.cbssports.com/fantasy/hockey/news/islanders-calvin-de-haan-will-be-healthy-for-start-of-2018-19/"],"wordCount":"1037","dataFormat":"text","duplicateGroupId":"34207268061","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"11049"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"J.D. Lagrange","publishingPlatform":{"userId":"17446316"}},"licenses":[],"source":{"name":"The Instigator","homeUrl":"http://habsterix.com","location":{},"feed":{"id":"572540390","name":"The Instigator","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"16825682","generator":"http://wordpress.com/","description":"Only dead fish swim with the flow","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"8","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994985}