{"sequenceId":"845365882135","id":"34207226034","language":"English","title":"Life's Lessons","content":"Life has many lessons to teach us, some more painful than others – and some we’d just as soon be spared. But as graduates everywhere look ahead to the next chapter in their lives, it seems a good time to reflect on some of the lessons we’ve learned. Here are some nuggets I’ve picked up along the way…. Be willing to take all the blame – and to share the credit. There actually are stupid questions. Shun those who are cruel – and don’t laugh at their “jokes.” Never say you’ll never. Be on time. “Bad” people eventually get what’s coming to them. But you may not be there to see it. Always sleep on big decisions. Sometimes the grass looks greener because of the amount of fertilizer. Never email in anger – or frustration. And be extra careful when using the “Reply All” button. If your current boss doesn’t want to hear the truth, it may be time to look for a new one. Never pass up a chance to say “thank you.” If you wouldn’t want your mother to learn about it, don’t do it. Never assume that your employer (or your boss) is looking out for your best interests. Bad news doesn’t generally age well. There can be a “bad” time even for good ideas. Your work attitude often affects your career altitude. When you don’t have an opinion, “what do you think?” is a good response. And sometimes even when you do. You can be liked and respected. Comments that begin “with all due respect” generally don’t include much. Sometimes the questions are complicated, but the answer isn’t. Remember as well that that 401(k) match isn’t really “free” money – but it won’t cost you a thing. And don’t forget that you’ll want to plan for your future now – because retirement, like graduation, seems a long way off – until it isn’t. Got some to add? Feel free to add in the comments. Congratulations to all the graduates out there. We’re proud of you! - Nevin E. Adams, JD","contentWithMarkup":"Life has many lessons to teach us, some more painful than others –  and some we’d just as soon be spared. But as graduates everywhere look  ahead to the next chapter in their lives, it seems a good time to  reflect on some of the lessons we’ve learned.<br />  <br />Here are some nuggets I’ve picked up along the way….<br /><ol><a href=\"https://2.bp.blogspot.com/-jNs3x548ylM/WxK2S6U1C6I/AAAAAAAACNw/VfVw-WJvWRUN7S-hVvA98fmuD5ErBDgoACLcBGAs/s1600/things%2Bto%2Bknow.jpg\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" data-original-height=\"720\" data-original-width=\"1280\" height=\"180\" src=\"https://2.bp.blogspot.com/-jNs3x548ylM/WxK2S6U1C6I/AAAAAAAACNw/VfVw-WJvWRUN7S-hVvA98fmuD5ErBDgoACLcBGAs/s320/things%2Bto%2Bknow.jpg\" width=\"320\" /></a><li><b>Be willing to take all the blame – and to share the credit.</b></li><li>There actually <em>are</em> stupid questions.</li><li><b>Shun those who are cruel – and don’t laugh at their “jokes.”</b></li><li>Never say you’ll never.</li><li><b>Be on time.</b></li><li>“Bad” people eventually get what’s coming to them. But you may not be there to see it.</li><li><b>Always sleep on big decisions.</b></li><li>Sometimes the grass looks greener because of the amount of fertilizer.</li><li><b>Never email in anger – or frustration. And be extra careful when using the “Reply All” button.</b></li><li>If your current boss doesn’t want to hear the truth, it may be time to look for a new one.</li><li><b>Never pass up a chance to say “thank you.”</b></li><li>If you wouldn’t want your mother to learn about it, don’t do it.</li><li><b>Never assume that your employer (or your boss) is looking out for your best interests.</b></li><li>Bad news doesn’t generally age well.</li><li><b>There can be a “bad” time even for good ideas.</b></li><li>Your work attitude often affects your career altitude.</li><li><b>When you don’t have an opinion, “what do <em>you</em> think?” is a good response. And sometimes even when you do.</b></li><li>You can be liked <em>and </em>respected.</li><li><b>Comments that begin “with all due respect” generally don’t include much.</b></li><li>Sometimes the questions are complicated, but the answer isn’t.</li></ol>Remember as well that that 401(k) match isn’t really “free” money – but it won’t cost you a thing.<br />  And don’t forget that you’ll want to plan for your future now –  because retirement, like graduation, seems a long way off – until it  isn’t.<br /><br />  Got some to add? Feel free to add in the comments.<br /><br />  Congratulations to all the graduates out there. We’re proud of you!<br /><br /><i><b>- Nevin E. Adams, JD</b></i>","tags":["401(k)","401k","403(b)","403b","college graduation","common wisdom","graduates","graduation wisdom","grass is greener","helpful hints","retirement","retirement savings","stupid questions","wisdom"],"publishedDate":"2018-06-02T15:25:23Z","harvestDate":"2018-06-02T21:52:18Z","estimatedPublishedDate":"2018-06-02T15:25:23Z","url":"http://ct.moreover.com/?a=34207226034&p=1u0&v=1&x=yGrDZowaKkLM_d1cf-uLWg","originalUrl":"http://planadviser.blogspot.com/2018/06/lifes-lessons.html","commentsUrl":"http://www.blogger.com/comment.g?blogID=33014325&postID=8235235089448833849","outboundUrls":["https://2.bp.blogspot.com/-jNs3x548ylM/WxK2S6U1C6I/AAAAAAAACNw/VfVw-WJvWRUN7S-hVvA98fmuD5ErBDgoACLcBGAs/s1600/things%2Bto%2Bknow.jpg"],"wordCount":"336","dataFormat":"text","duplicateGroupId":"34205622313","media":{"audio":[],"images":[{"url":"https://2.bp.blogspot.com/-jNs3x548ylM/WxK2S6U1C6I/AAAAAAAACNw/VfVw-WJvWRUN7S-hVvA98fmuD5ErBDgoACLcBGAs/s320/things%2Bto%2Bknow.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Nevin E. Adams, JD","publishingPlatform":{}},"licenses":[],"source":{"name":"planadviser* ponderings","homeUrl":"http://planadviser.blogspot.com/","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"91876401","name":"planadviser* ponderings","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"this blog is about topics of interest to plan advisers (or advisors) and the employer-sponsored benefit plans they support.  *It doesn't have a thing to do (any more) with PLANADVISER magazine.","tags":["401(k)","401k","403(b)","403b","retirement","retirement income","ebri","Employee Benefit Research Institute","fiduciary","dol","retirement savings","department of labor","adviser","savings","Fees","erisa","401(k) fees","advice","pension","advisor","ERISA fiduciary","retirement income adequacy","rev"],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86993887}