{"sequenceId":"845362201978","id":"34207111135","language":"English","title":"Covington: I’ll move up and KO Whittaker if Yoel Romero doesn’t","content":"Colby Covington could be making a move up to middleweight, depending on the outcome of Robert Whittaker vs. Yoel Romero at UFC 225. Next week’s UFC 225 pay-per-view will feature two headlining championship bouts, where Colby Covington will take on Rafael dos Anjos for the interim welterweight title in the co-main event and Robert Whittaker will defend his middleweight strap against Yoel Romero in the main event. Covington, who trains alongside Romero at American Top Team (ATT), is rooting for ‘Soldier of God’ to usurp Whittaker at UFC 225 but teased of a move up to the middleweight division if his teammate doesn’t get the job done. “I think it’s a great match up,” Covington said of the UFC 225 main event between Whittaker and Romero, per BJPenn.com’s Tom Taylor. “I think Yoel has all the tools to put Whittaker away. He won those first two rounds in the first fight, so it’s going to be a very competitive fight and I don’t know what to expect. What will we see fro  Whittaker coming back from injury? He may not be the same from his injuries. Yoel looked on fire, he just knocked out Rockhold. I’ll definitely have my eyes on that. I’m not going to go up and challenge Romero ’cause he’s my teammate and I like the guy, but if Whittaker wins I’ll definitely be looking to go up and knock him out just like Choir Boy (Stephen Thompson) did.” Romero, 41, dropped a unanimous decision to Whittaker last year but re-established himself as the official No. 1 contender with a brutal knockout win over Luke Rockhold at UFC 221. Covington, a top-five ranked welterweight contender, ambitiously has his sights set on winning three UFC belts in the future, with plans to beat Khabib Nurmagomedov for the lightweight title as well as winning the welterweight and middleweight titles to become the first three-division champion in the promotion’s history. “I’m looking for three belts,” Covington said in an interview with BJPenn.com last month. “I’m looking to do something that’s never been done in this sport. I wanna go down to 155. I wanna go up to 185 middleweight and take the belt. Whitaker hasn’t been that impressive. He got knocked out by choir boy Thompson. Karate, everybody knows that shit don’t work. As far as Khabib, the guy couldn’t finish a real estate on 20 hours notice. That’s sad, man. If that dweeb ever comes up to 170, I’ll rag doll him like the chump he is.” UFC 225: Whittaker vs. Romero 2 takes place next Saturday, June 9 at the United Center in Chicago, Illinois.","contentWithMarkup":"<img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/PG11LFjuF3NYwDFZHwqQWFRf6Bo=/1x0:4000x2666/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/59931395/696956628.jpg.0.jpg\" />\n\n\n\n  <p>Colby Covington could be making a move up to middleweight, depending on the outcome of Robert Whittaker vs. Yoel Romero at UFC 225.</p> <p id=\"cYfUg3\">Next week’s <a href=\"http://www.mmafighting.com/fight-card/942/ufc-225\">UFC 225</a> pay-per-view will feature two headlining championship bouts, where <a href=\"http://www.mmafighting.com/fighter/2975/colby-covington\">Colby Covington</a> will take on <a href=\"http://www.mmafighting.com/fighter/796/rafael-dos-anjos\">Rafael dos Anjos</a> for the interim welterweight title in the co-main event and <a href=\"http://www.mmafighting.com/fighter/1900/robert-whittaker\">Robert Whittaker</a> will defend his middleweight strap against <a href=\"http://www.mmafighting.com/fighter/387/yoel-romero\">Yoel Romero</a> in the main event.</p>\n<p id=\"dP655y\">Covington, who trains alongside Romero at American Top Team (ATT), is rooting for ‘Soldier of God’ to usurp Whittaker at UFC 225 but teased of a move up to the middleweight division if his teammate doesn’t get the job done.</p>\n<p id=\"OULX1Z\">“I think it’s a great match up,” Covington said of the UFC 225 main event between Whittaker and Romero, <a href=\"https://www.bjpenn.com/mma-news/exclusive-interviews/exclusive-colby-covington-says-hell-knock-robert-whittaker-out-if-yoel-romero-doesnt/\">per BJPenn.com’s Tom Taylor</a>. “I think Yoel has all the tools to put Whittaker away. He won those first two rounds in the first fight, so it’s going to be a very competitive fight and I don’t know what to expect. What will we see fro  Whittaker coming back from injury? He may not be the same from his injuries. Yoel looked on fire, he just knocked out Rockhold. I’ll definitely have my eyes on that. I’m not going to go up and challenge Romero ’cause he’s my teammate and I like the guy, but if Whittaker wins I’ll definitely be looking to go up and knock him out just like <a href=\"https://www.bjpenn.com/mma-news/exclusive-interviews/exclusive-colby-covington-offers-his-scorecard-for-darren-till-vs-stephen-thompson/\">Choir Boy</a> (<a href=\"http://www.mmafighting.com/fighter/1559/stephen-thompson\">Stephen Thompson</a>) did.”</p>\n<p id=\"znTkjT\">Romero, 41, dropped a unanimous decision to Whittaker last year but re-established himself as the official No. 1 contender with a brutal knockout win over <a href=\"http://www.mmafighting.com/fighter/98/luke-rockhold\">Luke Rockhold</a> at <a href=\"http://www.mmafighting.com/fight-card/922/ufc-221\">UFC 221</a>.</p>\n<p id=\"p9HlwK\">Covington, a top-five ranked welterweight contender, ambitiously has his sights set on winning three UFC belts in the future, with plans to beat <a href=\"http://www.mmafighting.com/fighter/1480/khabib-nurmagomedov\">Khabib Nurmagomedov</a> for the lightweight title as well as winning the welterweight and middleweight titles to become the first three-division champion in the promotion’s history.</p>\n<p id=\"1iM26x\">“I’m looking for three belts,” Covington said in an interview with <a href=\"https://www.bjpenn.com/mma-news/exclusive-interviews/exclusive-colby-covington-would-drop-to-155-and-fight-khabib-nurmagomedov-in-russia/\">BJPenn.com last month</a>. “I’m looking to do something that’s never been done in this sport. I wanna go down to 155. I wanna go up to 185 middleweight and take the belt. Whitaker hasn’t been that impressive. He got knocked out by choir boy Thompson. Karate, everybody knows that shit don’t work. As far as Khabib, the guy couldn’t finish a real estate on 20 hours notice. That’s sad, man. If that dweeb ever comes up to 170, I’ll rag doll him like the chump he is.”</p>\n<p id=\"30E7Vw\">UFC 225: Whittaker vs. Romero 2 takes place next Saturday, June 9 at the United Center in Chicago, Illinois.</p>","tags":[],"publishedDate":"2018-06-02T19:30:02Z","harvestDate":"2018-06-02T21:24:27Z","estimatedPublishedDate":"2018-06-02T19:30:02Z","url":"http://ct.moreover.com/?a=34207111135&p=1u0&v=1&x=mJcXc_d3D8v1tNXzbFfugg","originalUrl":"https://www.bloodyelbow.com/2018/6/2/17420276/ufc-225-mma-news-interview-colby-covington-robert-whittaker-yoel-romero-fight-knock-out","outboundUrls":["http://www.mmafighting.com/fight-card/942/ufc-225","http://www.mmafighting.com/fighter/2975/colby-covington","http://www.mmafighting.com/fighter/796/rafael-dos-anjos","http://www.mmafighting.com/fighter/1900/robert-whittaker","http://www.mmafighting.com/fighter/387/yoel-romero","https://www.bjpenn.com/mma-news/exclusive-interviews/exclusive-colby-covington-says-hell-knock-robert-whittaker-out-if-yoel-romero-doesnt/","https://www.bjpenn.com/mma-news/exclusive-interviews/exclusive-colby-covington-offers-his-scorecard-for-darren-till-vs-stephen-thompson/","http://www.mmafighting.com/fighter/1559/stephen-thompson","http://www.mmafighting.com/fighter/98/luke-rockhold","http://www.mmafighting.com/fight-card/922/ufc-221","http://www.mmafighting.com/fighter/1480/khabib-nurmagomedov","https://www.bjpenn.com/mma-news/exclusive-interviews/exclusive-colby-covington-would-drop-to-155-and-fight-khabib-nurmagomedov-in-russia/"],"wordCount":"423","dataFormat":"text","duplicateGroupId":"34200280944","media":{"audio":[],"images":[{"url":"https://cdn.vox-cdn.com/thumbor/PG11LFjuF3NYwDFZHwqQWFRf6Bo=/1x0:4000x2666/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/59931395/696956628.jpg.0.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"No.1 Co Ltd","symbol":"3562","exchange":"TKS","isin":"JP3653590004","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"Lewis Mckeever","publishingPlatform":{}},"licenses":[],"source":{"name":"Bloody Elbow -  All Posts","homeUrl":"https://www.bloodyelbow.com/","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"108659108","name":"Bloody Elbow -  All Posts","mediaType":"Blog","description":"Pound-for-Pound the Best in Mixed Martial Arts (MMA) Commentary, News and Community","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"3","autoRankOrder":"4908","inboundLinkCount":"251"},"inWhiteList":"true","autoTopics":["ugc sport feeds"]}},"es_id":86990356}