{"sequenceId":"845366802884","id":"34207250912","language":"English","title":"Road Trip","content":"We Americans are not a stay-at-home bunch. Not surprising since, except for Native Americans, we're the children of people who packed up everything they owned and headed for a new land. We're also a friendly bunch. That's one of the reasons my husband and I love road trips. We want to see as many as possible of the wonders our country has to offer, but even more, we want to peer beyond those attractions into the hidden corners of the country and to meet the people who live there. For us, a road trip is a chance to celebrate the ordinary as well as the extraordinary, a matter of balance.  One trip we've taken multiple times is almost a thousand miles each way - from a small town just north of Philadelphia to a small town just west of St. Louis. We make this trip about twice a year to see family, to re-visit our roots and, believe it or not, we always drive. As many times as we've made this trip, we always get into the car ready to see something new - and we've never been disappointed.  We don't take the most obvious route, which would be the PA Turnpike, then west on I-70 until we hit St. Louis.  Too much traffic, too many huge trucks. I appreciate the contribution truckers make to our way of life, delivering all those goodies we buy on the internet and much of the food we find in our supermarkets, but it's no fun being in a tiny car barreling along the highway in a box made by huge semis.    I laughed when I saw this picture of I-70. I've never seen it that empty.  Neither do we take back roads, though the prospect is temping. Maybe some day when we have more time (like that will ever happen). We follow a route that dips south through the mountains of West Virginia, then head west and travel through Kentucky horse country.    It's a beautiful route and a reminder of just how beautiful this country is, how large and how varied the scenery.  But the best part is always the people we run into when we stop for gas and/or meals. As I said earlier, Americans are a friendly people. We really want to like everyone. Even people wearing T-shirts that proclaim views very different from those I hold are good company when we meet on a person-to-person level and forget about the artificial barriers so prevalent these days. These encounters give me hope for the future of our country and our world.  Finally, there's that moment when I catch the first glimpse of the St. Louis Arch. It's my welcome-home symbol. As much as I love new places and new people, seeing the places and people that I grew up with never fails to give my heart a lift. Again, a matter of  balance, the necessity of both roots and wings.    Enjoy your summer, my friends, no matter where or how you spend it.","contentWithMarkup":"We Americans are not a stay-at-home bunch. Not surprising since, except for Native Americans, we're the children of people who packed up everything they owned and headed for a new land. We're also a friendly bunch. That's one of the reasons my husband and I love road trips. We want to see as many as possible of the wonders our country has to offer, but even more, we want to peer beyond those attractions into the hidden corners of the country and to meet the people who live there. For us, a road trip is a chance to celebrate the ordinary as well as the extraordinary, a matter of balance.\n\nOne trip we've taken multiple times is almost a thousand miles each way - from a small town just north of Philadelphia to a small town just west of St. Louis. We make this trip about twice a year to see family, to re-visit our roots and, believe it or not, we always drive. As many times as we've made this trip, we always get into the car ready to see something new - and we've never been disappointed.\n\nWe don't take the most obvious route, which would be the PA Turnpike, then west on I-70 until we hit St. Louis.  Too much traffic, too many huge trucks. I appreciate the contribution truckers make to our way of life, delivering all those goodies we buy on the internet and much of the food we find in our supermarkets, but it's no fun being in a tiny car barreling along the highway in a box made by huge semis.  <img class=\"alignnone size-full wp-image-7443\" src=\"https://birthofanovel.files.wordpress.com/2017/09/i-70-2.jpg\" alt=\"I-70 - 2\" width=\"800\" height=\"384\" />\n\nI laughed when I saw this picture of I-70. I've never seen it that empty.\n\nNeither do we take back roads, though the prospect is temping. Maybe some day when we have more time (like that will ever happen). We follow a route that dips south through the mountains of West Virginia, then head west and travel through Kentucky horse country.\n\n<a href=\"https://birthofanovel.files.wordpress.com/2017/09/horse-country-1.jpg\"><img class=\"aligncenter wp-image-7449 size-full\" src=\"https://birthofanovel.files.wordpress.com/2017/09/horse-country-1.jpg\" alt=\"\" width=\"599\" height=\"405\" /></a>\n\nIt's a beautiful route and a reminder of just how beautiful this country is, how large and how varied the scenery.\n\nBut the best part is always the people we run into when we stop for gas and/or meals. As I said earlier, Americans are a friendly people. We really want to like everyone. Even people wearing T-shirts that proclaim views very different from those I hold are good company when we meet on a person-to-person level and forget about the artificial barriers so prevalent these days. These encounters give me hope for the future of our country and our world.\n\nFinally, there's that moment when I catch the first glimpse of the St. Louis Arch. It's my welcome-home symbol. As much as I love new places and new people, seeing the places and people that I grew up with never fails to give my heart a lift. Again, a matter of  balance, the necessity of both roots and wings.\n\n<a href=\"https://birthofanovel.files.wordpress.com/2018/06/arch-through-trees.jpg\"><img class=\"aligncenter wp-image-7977 size-large\" src=\"https://birthofanovel.files.wordpress.com/2018/06/arch-through-trees.jpg?w=600\" alt=\"\" width=\"600\" height=\"800\" /></a>\n\nEnjoy your summer, my friends, no matter where or how you spend it.","tags":["civility","Women and Writing","American character","friendliness","Kentucky Horse Country","road trips","roots","St. Louis Arch","Travel"],"publishedDate":"2018-06-02T21:58:01Z","harvestDate":"2018-06-02T21:58:13Z","estimatedPublishedDate":"2018-06-02T21:58:01Z","url":"http://ct.moreover.com/?a=34207250912&p=1u0&v=1&x=DCBeAEBJwjFnIDVXUb_4cg","originalUrl":"https://birthofanovel.wordpress.com/2018/06/02/road-trip/","outboundUrls":[],"wordCount":"500","dataFormat":"text","duplicateGroupId":"34207250912","media":{"audio":[],"images":[{"url":"https://birthofanovel.files.wordpress.com/2017/09/horse-country-1.jpg"},{"url":"https://birthofanovel.files.wordpress.com/2017/09/i-70-2.jpg"},{"url":"https://birthofanovel.files.wordpress.com/2018/06/arch-through-trees.jpg?w=600"}],"video":[],"logo":[]},"publishingPlatform":{"itemId":"7440"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Sandra Carey Cody","publishingPlatform":{"userId":"7277011"}},"licenses":[],"source":{"name":"BIRTH OF A NOVEL","homeUrl":"https://birthofanovel.wordpress.com","location":{},"feed":{"id":"88156090","name":"BIRTH OF A NOVEL","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"6877137","generator":"http://wordpress.com/","description":"THOUGHTS ON THE SOMETIMES PAINFUL, OFTEN JOYFUL, AND ALWAYS FULFILLING PROCESS OF BIRTHING A NOVEL.","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"7","autoRankOrder":"121620","inboundLinkCount":"1"},"inWhiteList":"true","autoTopics":["ugc technology feeds"]}},"es_id":86994557}