{"sequenceId":"845367417583","id":"34207266571","language":"English","title":"Martha Washington","content":"From Bill Bennett's American Patriot's Almanac: June 2 is the birthday of Martha Washington, born in 1731 near Williamsburg, Virginia. By all accounts, America’s first First Lady was a dignified, gentle woman. Abigail Adams called her “one of those unassuming characters which create Love and Esteem.” One visitor described meeting Martha: “We dressed ourselves in our most elegant ruffles and silks, and were introduced to her ladyship. And, don’t you think, we found her knitting, and with a checked apron on! She received us very graciously and easily, but after the compliments were over, she resumed her knitting.” Like her husband, Mrs. Washington loved home life at Mount Vernon. But during the Revolution, whenever the Continental Army was in winter camp, she left home to join her husband and lift the troops’ spirits. “I never in my life knew a woman so busy from early morning until late at night as was Lady Washington, providing comforts for the sick soldiers,” recalled one woman who lived at Valley Forge. “Every fair day she might be seen, with basket in hand . . . going among the huts seeking the keenest and most needy sufferers, and giving all the comfort to them in her power.” Martha was a warm, hospitable First Lady, but she wasn’t overly fond of the role. “I think I am more like a state prisoner than anything else,” she confided to a niece. Yet her willingness to serve equaled her husband’s. “I cannot blame him for having acted according to his ideas of duty in obeying the voice of his country,” she wrote to a friend. “I am still determined to be cheerful and happy, in whatever situation I may be; for I have also learned from experience that the greater part of our happiness or misery depends upon our dispositions, and not upon our circumstances.” Every day, Bill Bennett provides via email--for free--a reading from his American Patriot's Almanac. You’ll read about heroes, their achievements, and key events that took place “On This Day” in American history. Click here to subscribe.","contentWithMarkup":"From Bill Bennett's <i>American Patriot's Almanac</i>:<br /><span class=\"Apple-tab-span\" style=\"white-space: pre;\"> </span><br /><b>June 2 is the birthday of Martha Washington, born in 1731 near Williamsburg, Virginia.</b><br /><b><br /></b><b>By all accounts, America’s first First Lady was a dignified, gentle woman. Abigail Adams called her “one of those unassuming characters which create Love and Esteem.”</b><br /><b><br /></b><b>One visitor described meeting Martha: “We dressed ourselves in our most elegant ruffles and silks, and were introduced to her ladyship. And, don’t you think, we found her knitting, and with a checked apron on! She received us very graciously and easily, but after the compliments were over, she resumed her knitting.”</b><br /><b><br /></b><b>Like her husband, Mrs. Washington loved home life at Mount Vernon. But during the Revolution, whenever the Continental Army was in winter camp, she left home to join her husband and lift the troops’ spirits. “I never in my life knew a woman so busy from early morning until late at night as was Lady Washington, providing comforts for the sick soldiers,” recalled one woman who lived at Valley Forge. “Every fair day she might be seen, with basket in hand . . . going among the huts seeking the keenest and most needy sufferers, and giving all the comfort to them in her power.”</b><br /><b><br /></b><b>Martha was a warm, hospitable First Lady, but she wasn’t overly fond of the role. “I think I am more like a state prisoner than anything else,” she confided to a niece. Yet her willingness to serve equaled her husband’s. “I cannot blame him for having acted according to his ideas of duty in obeying the voice of his country,” she wrote to a friend. “I am still determined to be cheerful and happy, in whatever situation I may be; for I have also learned from experience that the greater part of our happiness or misery depends upon our dispositions, and not upon our circumstances.”</b><br /><br />Every day, Bill Bennett provides via email--for free--a reading from his American Patriot's Almanac. You’ll read about heroes, their achievements, and key events that took place “On This Day” in American history. Click <a href=\"http://www.patriotsalmanac.com/\">here</a> to subscribe.<br /><div><br /></div>","tags":[],"publishedDate":"2018-06-02T20:22:54Z","harvestDate":"2018-06-02T22:00:54Z","estimatedPublishedDate":"2018-06-02T20:22:54Z","url":"http://ct.moreover.com/?a=34207266571&p=1u0&v=1&x=9dj1TFSKD-HROwjrELhlsQ","originalUrl":"http://whocareswhatkeiththinks.blogspot.com/2015/06/martha-washington.html","commentsUrl":"http://whocareswhatkeiththinks.blogspot.com/2015/06/martha-washington.html#comment-form","outboundUrls":["http://www.patriotsalmanac.com/"],"wordCount":"339","dataFormat":"text","duplicateGroupId":"34207266571","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Keith","publishingPlatform":{}},"licenses":[],"source":{"name":"Intersections","homeUrl":"http://whocareswhatkeiththinks.blogspot.com/","location":{},"feed":{"id":"330306658","name":"Intersections","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"Welcome to the Intersections Blog, where I try to work out where politics, pop culture, and the Bible meet","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994958}