{"sequenceId":"845364083778","id":"34207172693","language":"English","title":"Shedding Skin. Dear Intimacy...","content":"Dear Intimacy, I imagine you hugging me so tight you crawl under my skin. You slip under my tongue. You tuck between my heart and my diaphragm. You’re so determined to go past my walls. You go through, behind, under my blockades. You won’t let any obstruction stop you. I imagine you to be unstoppable. You won’t let NO stop you. Yet, I’m not sure I’ve actually felt you. My imagination is probably sparked by movies and novels. I’m not sure I’m capable of being intimate. Have I made you something that I can’t have? Have I put you so high up on a pedestal, that you’re unreachable? I want to crawl up on your lap. I want to feel you squeeze me so tight I squeal. Dear Intimacy, You’re too much. I’m afraid if I taste you, I’ll be cursed. ‘Cuz then when I lose you, I’ll die. I’m afraid that if I really experience your infinity, I’ll be bitter and resentful when you leave. You’re a happiness that’s lethal. You’re a shot of clean oxygen that will keep me wanting more. Yeah, you’re like cocaine or heroine. You’re too much-so that regular will be flat. You’re an addiction-so I won’t come close to you. I want to keep me safe from falling off the edge. I won’t get too close. You’re a slippery edge. In fact, your edge is treacherous. You are constantly sloughing off and getting smaller every day. I experience you- intimacy as an edge I can’t get close to, to see over, ‘cuz you can’t hold me. If I step near you, you’ll disintegrate from my body weight and both of us will fall to our death. So right now I’ll test you out. I’ll see how fragile you really are. I toss a pebble out in front of me. The pebble bounces off the ground and falls off the edge. This time I pick a round pebble and roll it like a marble. It rolls slowly and stops closer to me than to the edge. Now I pick another round pebble just a little bigger and push it a little harder. It rocks and rolls and stops closer to the edge. It just sits there. That’s where I want to be. Just a little closer to the edge. I don’t want to push my luck. This spot feels like a solid place. Just a little closer to intimacy. I can reveal a little more vulnerability. I can be a little more honest. I can say “when you…I feel…I want…” I can come closer, inch by inch. I can crawl. I don’t have to leap. I don’t have to push it too much. Intimacy has patience. Intimacy has time. Intimacy is not eroding. Thanks Intimacy for hanging with me and letting me sniff and scratch and check you out. Love, Carola lah Call me. I’m at your fingertips. Letting someone help you is sometimes the bravest thing you can do. I’m a phone call away. (512) 925-0625 Payment can be made through PayPal. HERE Click here to read more about who I am professionally. As a published author, I am your writing coach and editor. As a trained Transpersonal Therapist, I am your soul advocate and Heart Whisperer. As a facilitator trainer, I help you move forward and stay focused. As a mover and shaker of authenticity, I help you unleash your tongue and speak your truth from the inside out. As a trained Transpersonal Therapist, I listen with soft ears. My Soul purpose is to help reclaim intuition as the flashlight to our inner guide. When I feel heard by someone, it’s like the best hug ever! Being seen and heard transforms pain into medicine, tragedy into comedy, and death into rebirth. What others say about Carola’s Shedding Skin Writing Practice: “Carola’s sweet and loving energy is only surpassed by her ability to tune into a higher channel and by doing so guide you in finding your highest good. She helped me reaffirm a huge life change and especially my purpose for it. It was a confirmation AND an expansion. It was empowering. Knowing this woman will fatten your soul! Thank you x 3! -Aloha” “Carola’s intuition ability is excellent! Through her fine-tuned listening, she helped me unearth core areas in my personal life that had been unexamined; she supported me to become more empowered and clear.” “She has a special ability to listen in a way that allows you to connect with your true self. She is a steady, insightful and a supportive guide. Through her skillful leadership I developed confidence in my ability to connect with myself more deeply.” “Most importantly, I learned how to ‘follow the energy’, to listen for what resonates within me. I feel lucky to have found her and I am more attuned and authentic as a result of our work together.” I teach what I desire to learn which is how to listen, discern, and respond to intuition. Carola Marashi M.A. Published Author, Writing Coach, Transpersonal Therapist. My 30 years of professional experience is primarily Body Based Therapy What folks say about Carola “Carola was so perfectly right on and complete. As I look back on the experience now I’m struck that the nature of the communication was not something the egoic mind can really grab hold of and make an action plan out of. (wink!) The message was directly communicated to the heart where it still lives glowing encouragingly. Your open-hearted acceptance and sweet encouragement allowed a natural and easy deepening, and I especially like that you encouraged me to articulate for myself what I had received in the session. Thanks for your openness, your spiritual maturity, and your insightful sharing.” First 10 Minutes free. “Carola’s intuition ability is excellent! Through her fine-tuned listening, she helped me unearth core areas in my personal life that had been unexamined; she supported me to become more empowered and clear.” “She has a special ability to listen in a way that allows you to connect with your true self. She is a steady, insightful and a supportive guide. Through her skillful leadership I developed confidence in my ability to connect with myself more deeply.” “Most importantly, I learned how to ‘follow the energy’, to listen for what resonates within me. I feel lucky to have found her and I am more attuned and authentic as a result of our work together.” I receive payment from Pay Pal. Call me for your Individual Phone Session. (512) 925-0625  ","contentWithMarkup":"...I'm not sure I've actually felt you. My imagination is probably sparked by movies and novels. I'm not sure I'm capable of being intimate. Have I made you something that I can't have? Have I put you so high up on a pedestal, that you're unreachable? \n\nI want to crawl up on your lap. I want to feel you squeeze me so tight I squeal.","tags":["addiction","Intimacy"],"publishedDate":"2018-06-02T21:39:31Z","harvestDate":"2018-06-02T21:39:36Z","estimatedPublishedDate":"2018-06-02T21:39:31Z","url":"http://ct.moreover.com/?a=34207172693&p=1u0&v=1&x=hp4oCpRciQtPTGbgIJbLCw","originalUrl":"https://carolamarashi.me/2018/06/02/shedding-skin-dear-intimacy/","outboundUrls":["http://paypal.me/carolamarashi","https://carolamarashi.files.wordpress.com/2013/11/child-hugging-self.jpg","https://www.paypal.me/carolamarashi"],"wordCount":"1080","dataFormat":"text","duplicateGroupId":"34207172693","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"4025"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Carola Marashi M.A.","publishingPlatform":{"userId":"19146136"}},"licenses":[],"source":{"name":"Carola Marashi M.A. Bump Up Your Intuition!","homeUrl":"http://carolamarashi.me","location":{},"feed":{"id":"575339102","name":"Carola Marashi M.A. Bump Up Your Intuition!","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"18688579","generator":"http://wordpress.com/","description":"Phone sessions at your fingertips.","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"8","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86992381}