{"sequenceId":"845362091715","id":"34207107411","language":"English","title":"The Equal Rights Amendment: What you need to know 23 hours ago","content":"WASHINGTON (Circa) —  The Equal Rights Amendment moved a step closer to becoming part of the United States Constitution this week as Illinois became the 37th state to ratify the provision nearly a century after it was originally written.    The vote by the Illinois legislature Wednesday leaves supporters of the amendment, which was intended to prevent discrimination against women, one state away from achieving the 38-state ratification the Constitution requires. That likely would not be the end of a fight that has dragged on for decades, though.    Why not? And what is the Equal Rights Amendment anyway? Good questions.    What is it?   First drafted as the “Lucretia Mott Amendment” by suffragette Alice Paul and other feminist activists in 1923, the amendment was then introduced in every session of Congress until 1972, when it was passed by the House and Senate.    The Equal Rights Amendment was ratified by 22 states in the first year after passage. That pace slowed drastically in 1973 amid growing conservative opposition. In 1977, Indiana became the 35th state to ratify the amendment.    Though state legislators around the country continued to offer the ERA up for votes in the years that followed, it was four decades before the 36th state, Nevada, ratified it in 2017.     “The passage of Nevada was a game changer,” said Carol Robles-Roman, co-president and CEO of the ERA Coalition, “and that came out of a lot of the work that had been taking place at a grass roots level.”   What does it say?   Since revised by Paul in 1943, the text has included three sections:   Section 1: Equality of rights under the law shall not be denied or abridged by the United States or by any state on account of sex.  Section 2: The Congress shall have the power to enforce, by appropriate legislation, the provisions of this article.  Section 3: This amendment shall take effect two years after the date of ratification.   What does that mean?     Nobody really knows, according to Marjorie Spruill, author of “Divided We Stand: The Battle Over Women’s Rights and Family Values That Polarized American Politics” and professor emerita at the University of South Carolina.    “No one has ever known the answer to that question,” she said of the practical effect the amendment would have. “Everyone has always speculated because it’s a vague statement of equality and it would have to be figured out gradually as states passed legislation to try to comply with it.”    According to Jane Mansbridge, author of “Why We Lost the ERA” and a professor at the Harvard Kennedy School of Government, amendments like this are written with the future in mind, not immediate upheavals of existing law.    “The point is not to change x, y, or z law, but to put in place a statement of principle that will affect not only future court decisions but also the way the U.S. Congress thinks about legislation and the American people think about themselves,” she said via email Friday.    Robles-Roman pointed to two specific changes she expects to see if the amendment takes effect.     “The first and most obvious legal change would be the type of scrutiny a federal jurist will accord a case that comes before him or her,” she said. Gender discrimination cases would face the same strict scrutiny standard that race and religion currently do.    She also predicted it would impact some everyday government decisions.    “It would mean governments would have to be proactive in looking at their budgeting, their hiring, their services to make sure they’re appropriate and gender-neutral,” she said.   Why do some object to it?   Critics of the amendment have raised a number of concerns, including a belief that it is redundant because other laws already prohibit gender discrimination. They also warn of potentially dire consequences for women if they are treated the same as men under the law.    “The conservatives said we don’t need this amendment because women are gaining some equal rights already through other means, and since no one knows what it means, it would be dangerous to go for something so drastic as a constitutional amendment.” Spruill said.    In a statement, Elise Bouc, chairwoman of Stop ERA Illinois, called the amendment “poorly-written” and vague.    “The Supreme Court has already recognized and ruled favorably for women based on the 14th amendment,” she said. “Women will receive no additional benefits from the ERA. Instead, they will see their rights and benefits taken away as they are forced to be treated exactly like men with no exceptions allowed.”    In an interview Friday, Bouc stressed that her problem is not with the goal of equality but with the ramifications of the text of the ERA as written.    “We need different language that is going to actually help us help women… That doesn’t mean we have to be forced into sameness with men,\" she said.    Conservative activist Phyllis Schlafly led the fight against the ERA in the 1970s and 1980s, predicting its passage would lead to same-sex marriage, unisex bathrooms, women being forced into military combat, and loss of child support and alimony payments.    “Hundreds of good state laws would be overturned — such as sex segregated prisons, women’s shelters, and legal accommodations for pregnant women,” Anne Schlafly, Phyllis’ daughter, wrote in a letter to the Chicago Tribune in April.    According to Mansbridge, many of these fears were born of misinterpretations of the text.    Some religious groups also fear the amendment will be used to justify laws mandating government funding of abortions. They point to a 1999 New Mexico Supreme Court ruling that concluded limiting state Medicaid reimbursement for medically-necessary abortions was unconstitutional under the state’s Equal Rights Amendment.     Advocates argue that decision relates to state policy and is not indicative of how federal courts would handle an amendment to the U.S. Constitution. They also observe that the Supreme Court has already upheld the Hyde Amendment, which prohibits federal funding of most abortions.   Why do supporters say it’s necessary?   Proponents say the amendment would enshrine gender equality in the U.S. Constitution, providing unassailable nationwide protection of women’s rights that laws and state constitutional amendments cannot.    “They also said that any law that is passed by legislators can be undone,” Spruill said, “and that, yes, there’s been a great deal of progress made in terms of women’s rights, but if a change came in the way of thinking or different lawmakers, those gains could be lost.”    In recent years, Supreme Court Justices Antonin Scalia and Ruth Bader Ginsburg have both stated publicly that the Constitution does not currently prohibit gender discrimination.     “We don’t want some protection,” Robles-Roman said. “We want full constitutional rights. A lot of the laws [opponents] point to can be changed at the stroke of a pen and you can’t do that with a constitutional amendment.”    According to Mansbridge, 76 percent of constitutions around the world guarantee equality specifically for women.    “The constitution provides the basic foundation of rights in a liberal democracy,” she said. “It shapes not only the law but how people think about those rights. Just as we need a right to free speech, we need a right to equality for women.”   Where does the ratification process stand today?   After the vote in Illinois this week, there are now 13 states that have not ratified the ERA: Alabama, Arizona, Arkansas, Florida, Georgia, Louisiana, Mississippi, North Carolina, Oklahoma, South Carolina, Utah, and Virginia.    Ratification attempts have failed this year in Virginia, Florida, and Arizona, but advocates remain optimistic after their success in Illinois.     “There’s an incredible equality pendulum that’s swinging in our direction,” Robles-Roman said.   Why are states talking about this now?   Robles-Roman credited dozens of activist groups that drove the Nevada legislature to ratify the amendment in March 2017, ending a 40-year drought in progress. That momentum quickly combined with other cultural and political factors to bring the fight for the ERA back to the forefront.    “Very soon thereafter, we saw the #MeToo movement and #TimesUp and the incredible work the media did to shine this spotlight and people took another look to say these are issues of gender discrimination,” she said.    Mansbridge views the issue in the context of global shifts in attitude, as well.    “I also think in general more and more women throughout the world are coming to understand equal rights for women is something that has to be fought for,” she said. “It’s not just going to drop in our laps.”    The feminist backlash against President Donald Trump’s election has also fueled activist energy, as has anger over Trump’s conservative policy agenda.     “Given the results of the last presidential election and the actions of the Trump administration since, a lot of people feel like that kind of protection is definitely needed,” Spruill said.    She stressed that feminists and advocates for women’s rights never abandoned the amendment, believing there would eventually be a time when there is widespread agreement that it is needed. They are increasingly optimistic that time may be now.    “Given that they’d been working on this since 1923, no one just assumed this was over,” she said.   So if one more state ratifies it, the ERA becomes part of the Constitution?   Not necessarily. When Congress passed the amendment in 1972, it imposed a seven-year time limit on the ratification process. That ultimatum was later extended to 1982, but it was allowed to expire.    Congress could now vote to extend the deadline again or eliminate it altogether, but such a move could face legal challenges. Supporters point to the 1992 ratification of what became the 27th Amendment, which had been passed by Congress in 1789 but took more than 200 years to secure support from three-fourths of state legislatures.    “What we realize now, thanks to the passage of the ‘Madison Amendment’ in 1992, is that the amount of time since an amendment was first introduced is no barrier to the process being taken up and continued,” Mansbridge said.    A 2013 report by the Congressional Research Service concluded federal lawmakers could consider legislation to revive the amendment or accede to additional state ratification. However, it noted several unresolved legal and procedural questions that would likely arise.    “We only allow ourselves to be ruled by law if we feel that law has been placed in our legal system in a fair way…I worry that this is really going to overturn people’s faith in the law,” Bouc said.     Additional complications may come from five states that have attempted to withdraw their ratification of the ERA since 1972—Idaho, Kentucky, Nebraska, Tennessee, and South Dakota. In 1981, a federal district court ruled Idaho could rescind its ratification, but the Supreme Court vacated the decision after the 1982 deadline passed.    “Who would make all these determinations, I’m not sure, but I think we’re about to find out,” Spruill said.    One option that would bypass these issues is for Congress to pass the ERA again without a time limit. However, that would also mean starting the process of finding 38 states to ratify it all over again.   What’s next?   After successful ratification in Nevada and Illinois, activists are seeking a third state to push the ERA over the top. According to the Associated Press, Virginia, North Carolina, and Georgia are being eyed as the likeliest targets. The GOP-led Virginia legislature rejected ratification earlier this year, but advocates are hoping lawmakers seated after this November’s election will be more supportive of the cause.    “You’re going to see some really great enthusiasm in several of these states going forward,” Robles-Roman said.    Opponents of the amendment are not yet ready to give up the fight.     “We are really urging better language that could actually better accomplish the vision of equal opportunities for women,” Bouc said.     Robles-Roman is confident her coalition can make their case to the public and legislators in those states as effectively as they did in Nevada and Illinois.    “We start with the premise that women aren’t in the Constitution and they should be…We’re fixing something that wasn’t done quite right the first time and we’re going to get it right this time,” she said.","contentWithMarkup":"WASHINGTON (Circa) —  The Equal Rights Amendment moved a step closer to becoming part of the United States Constitution this week as Illinois became the 37th state to ratify the provision nearly a century after it was originally written.    The vote by the Illinois legislature Wednesday leaves supporters of the amendment, which was intended to prevent discrimination against women, one state away from achieving the 38-state ratification the Constitution requires. That likely would not be the end of a fight that has dragged on for decades, though.    Why not? And what is the Equal Rights Amendment anyway? Good questions.    What is it?   First drafted as the “Lucretia Mott Amendment” by suffragette Alice Paul and other feminist activists in 1923, the amendment was then introduced in every session of Congress until 1972, when it was passed by the House and Senate.    The Equal Rights Amendment was ratified by 22 states in the first year after passage. That pace slowed drastically in 1973 amid growing conservative opposition. In 1977, Indiana became the 35th state to ratify the amendment.    Though state legislators around the country continued to offer the ERA up for votes in the years that followed, it was four decades before the 36th state, Nevada, ratified it in 2017.     “The passage of Nevada was a game changer,” said Carol Robles-Roman, co-president and CEO of the ERA Coalition, “and that came out of a lot of the work that had been taking place at a grass roots level.”   What does it say?   Since revised by Paul in 1943, the text has included three sections:   Section 1: Equality of rights under the law shall not be denied or abridged by the United States or by any state on account of sex.  Section 2: The Congress shall have the power to enforce, by appropriate legislation, the provisions of this article.  Section 3: This amendment shall take effect two years after the date of ratification.   What does that mean?     Nobody really knows, according to Marjorie Spruill, author of “Divided We Stand: The Battle Over Women’s Rights and Family Values That Polarized American Politics” and professor emerita at the University of South Carolina.    “No one has ever known the answer to that question,” she said of the practical effect the amendment would have. “Everyone has always speculated because it’s a vague statement of equality and it would have to be figured out gradually as states passed legislation to try to comply with it.”    According to Jane Mansbridge, author of “Why We Lost the ERA” and a professor at the Harvard Kennedy School of Government, amendments like this are written with the future in mind, not immediate upheavals of existing law.    “The point is not to change x, y, or z law, but to put in place a statement of principle that will affect not only future court decisions but also the way the U.S. Congress thinks about legislation and the American people think about themselves,” she said via email Friday.    Robles-Roman pointed to two specific changes she expects to see if the amendment takes effect.     “The first and most obvious legal change would be the type of scrutiny a federal jurist will accord a case that comes before him or her,” she said. Gender discrimination cases would face the same strict scrutiny standard that race and religion currently do.    She also predicted it would impact some everyday government decisions.    “It would mean governments would have to be proactive in looking at their budgeting, their hiring, their services to make sure they’re appropriate and gender-neutral,” she said.   Why do some object to it?   Critics of the amendment have raised a number of concerns, including a belief that it is redundant because other laws already prohibit gender discrimination. They also warn of potentially dire consequences for women if they are treated the same as men under the law.    “The conservatives said we don’t need this amendment because women are gaining some equal rights already through other means, and since no one knows what it means, it would be dangerous to go for something so drastic as a constitutional amendment.” Spruill said.    In a statement, Elise Bouc, chairwoman of Stop ERA Illinois, called the amendment “poorly-written” and vague.    “The Supreme Court has already recognized and ruled favorably for women based on the 14th amendment,” she said. “Women will receive no additional benefits from the ERA. Instead, they will see their rights and benefits taken away as they are forced to be treated exactly like men with no exceptions allowed.”    In an interview Friday, Bouc stressed that her problem is not with the goal of equality but with the ramifications of the text of the ERA as written.    “We need different language that is going to actually help us help women… That doesn’t mean we have to be forced into sameness with men,\" she said.    Conservative activist Phyllis Schlafly led the fight against the ERA in the 1970s and 1980s, predicting its passage would lead to same-sex marriage, unisex bathrooms, women being forced into military combat, and loss of child support and alimony payments.    “Hundreds of good state laws would be overturned — such as sex segregated prisons, women’s shelters, and legal accommodations for pregnant women,” Anne Schlafly, Phyllis’ daughter, wrote in a letter to the Chicago Tribune in April.    According to Mansbridge, many of these fears were born of misinterpretations of the text.    Some religious groups also fear the amendment will be used to justify laws mandating government funding of abortions. They point to a 1999 New Mexico Supreme Court ruling that concluded limiting state Medicaid reimbursement for medically-necessary abortions was unconstitutional under the state’s Equal Rights Amendment.     Advocates argue that decision relates to state policy and is not indicative of how federal courts would handle an amendment to the U.S. Constitution. They also observe that the Supreme Court has already upheld the Hyde Amendment, which prohibits federal funding of most abortions.   Why do supporters say it’s necessary?   Proponents say the amendment would enshrine gender equality in the U.S. Constitution, providing unassailable nationwide protection of women’s rights that laws and state constitutional amendments cannot.    “They also said that any law that is passed by legislators can be undone,” Spruill said, “and that, yes, there’s been a great deal of progress made in terms of women’s rights, but if a change came in the way of thinking or different lawmakers, those gains could be lost.”    In recent years, Supreme Court Justices Antonin Scalia and Ruth Bader Ginsburg have both stated publicly that the Constitution does not currently prohibit gender discrimination.     “We don’t want some protection,” Robles-Roman said. “We want full constitutional rights. A lot of the laws [opponents] point to can be changed at the stroke of a pen and you can’t do that with a constitutional amendment.”    According to Mansbridge, 76 percent of constitutions around the world guarantee equality specifically for women.    “The constitution provides the basic foundation of rights in a liberal democracy,” she said. “It shapes not only the law but how people think about those rights. Just as we need a right to free speech, we need a right to equality for women.”   Where does the ratification process stand today?   After the vote in Illinois this week, there are now 13 states that have not ratified the ERA: Alabama, Arizona, Arkansas, Florida, Georgia, Louisiana, Mississippi, North Carolina, Oklahoma, South Carolina, Utah, and Virginia.    Ratification attempts have failed this year in Virginia, Florida, and Arizona, but advocates remain optimistic after their success in Illinois.     “There’s an incredible equality pendulum that’s swinging in our direction,” Robles-Roman said.   Why are states talking about this now?   Robles-Roman credited dozens of activist groups that drove the Nevada legislature to ratify the amendment in March 2017, ending a 40-year drought in progress. That momentum quickly combined with other cultural and political factors to bring the fight for the ERA back to the forefront.    “Very soon thereafter, we saw the #MeToo movement and #TimesUp and the incredible work the media did to shine this spotlight and people took another look to say these are issues of gender discrimination,” she said.    Mansbridge views the issue in the context of global shifts in attitude, as well.    “I also think in general more and more women throughout the world are coming to understand equal rights for women is something that has to be fought for,” she said. “It’s not just going to drop in our laps.”    The feminist backlash against President Donald Trump’s election has also fueled activist energy, as has anger over Trump’s conservative policy agenda.     “Given the results of the last presidential election and the actions of the Trump administration since, a lot of people feel like that kind of protection is definitely needed,” Spruill said.    She stressed that feminists and advocates for women’s rights never abandoned the amendment, believing there would eventually be a time when there is widespread agreement that it is needed. They are increasingly optimistic that time may be now.    “Given that they’d been working on this since 1923, no one just assumed this was over,” she said.   So if one more state ratifies it, the ERA becomes part of the Constitution?   Not necessarily. When Congress passed the amendment in 1972, it imposed a seven-year time limit on the ratification process. That ultimatum was later extended to 1982, but it was allowed to expire.    Congress could now vote to extend the deadline again or eliminate it altogether, but such a move could face legal challenges. Supporters point to the 1992 ratification of what became the 27th Amendment, which had been passed by Congress in 1789 but took more than 200 years to secure support from three-fourths of state legislatures.    “What we realize now, thanks to the passage of the ‘Madison Amendment’ in 1992, is that the amount of time since an amendment was first introduced is no barrier to the process being taken up and continued,” Mansbridge said.    A 2013 report by the Congressional Research Service concluded federal lawmakers could consider legislation to revive the amendment or accede to additional state ratification. However, it noted several unresolved legal and procedural questions that would likely arise.    “We only allow ourselves to be ruled by law if we feel that law has been placed in our legal system in a fair way…I worry that this is really going to overturn people’s faith in the law,” Bouc said.     Additional complications may come from five states that have attempted to withdraw their ratification of the ERA since 1972—Idaho, Kentucky, Nebraska, Tennessee, and South Dakota. In 1981, a federal district court ruled Idaho could rescind its ratification, but the Supreme Court vacated the decision after the 1982 deadline passed.    “Who would make all these determinations, I’m not sure, but I think we’re about to find out,” Spruill said.    One option that would bypass these issues is for Congress to pass the ERA again without a time limit. However, that would also mean starting the process of finding 38 states to ratify it all over again.   What’s next?   After successful ratification in Nevada and Illinois, activists are seeking a third state to push the ERA over the top. According to the Associated Press, Virginia, North Carolina, and Georgia are being eyed as the likeliest targets. The GOP-led Virginia legislature rejected ratification earlier this year, but advocates are hoping lawmakers seated after this November’s election will be more supportive of the cause.    “You’re going to see some really great enthusiasm in several of these states going forward,” Robles-Roman said.    Opponents of the amendment are not yet ready to give up the fight.     “We are really urging better language that could actually better accomplish the vision of equal opportunities for women,” Bouc said.     Robles-Roman is confident her coalition can make their case to the public and legislators in those states as effectively as they did in Nevada and Illinois.    “We start with the premise that women aren’t in the Constitution and they should be…We’re fixing something that wasn’t done quite right the first time and we’re going to get it right this time,” she said.","tags":[],"harvestDate":"2018-06-02T21:23:22Z","estimatedPublishedDate":"2018-06-02T21:23:22Z","url":"http://ct.moreover.com/?a=34207107411&p=1u0&v=1&x=wyz-OgDJj3-dY6DueoQvGA","originalUrl":"http://fox28media.com/news/connect-to-congress/the-equal-rights-amendment-what-you-need-to-know","outboundUrls":["http://foxillinois.com/news/local/illinois-becomes-37th-state-to-ratify-the-equal-rights-amendment"],"wordCount":"1980","dataFormat":"text","duplicateGroupId":"34200716641","media":{"audio":[],"images":[{"url":"http://static-34.sinclairstoryline.com/resources/media/55dbde03-e5b8-4bdf-b414-49bf180b0a9c-large16x9_anthonyresolutionxl.jpg?1527891023415"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"Quick Co Ltd","symbol":"4318","exchange":"TKS","isin":"JP3266000003","titleCount":0,"contentCount":1,"primary":true}],"author":{"publishingPlatform":{}},"licenses":[{"name":"Publicly Available"}],"source":{"name":"Fox28MEDIA","homeUrl":"http://fox28media.com","category":"Local","editorialRank":"4","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America","state":"Georgia","county":"Chatham","zipArea":"Savannah","zipCode":"31405"},"feed":{"id":"639570701","name":"Fox28MEDIA","mediaType":"News","tags":[],"language":"Unassigned","dataFormat":"text","rank":{"inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[],"editorialTopics":["Geographic","Local","Standard","News"],"genre":"General"}},"es_id":86990178}