{"sequenceId":"845361797957","id":"34207097511","language":"English","title":"How to sell Steam Trading Cards","content":"How to sell Steam Trading Cards by John_A Steam has become more than just a platform for buying and distributing games — developer Valve has, over the years, inserted hooks to make it feel like a bit of a social network and a game unto itself. One of the big ways Steam encourages people to use the client and interact with other people is its Steam Trading Cards system, where games dish out digital cards when you play them that you can then trade with other people. If you’re not a fan of collecting and trading digital cards, though, there is another option — selling them. Steam allows you to put up some digital and in-game items on its Community Market, which can net you money in the form of Steam credit to spend on more games. While most trading cards only go for a few pennies, a select few can be pretty lucrative. Plus, even if you only get a little, that a bit less leaving your pocket next time you buy a game. Interested? We’ve put together a step-by-step guide to walk you through the process of selling your Steam trading cards. Download the Steam Guard Mobile Authenticator app In order to use the Steam Community Market to sell cards (or anything else), Valve requires that you set up two-factor authentication with its Steam Guard Mobile Authenticator app. You can find the app in the Google Play store, the iOS App Store, and the Microsoft Store. Sign into the app with your Steam account to use it to activate two-factor authentication. Keep it handy: You’ll need it to confirm when you try to sell cards. Play some games, earn some cards Not every game on Steam issues trading cards, but if you find games that have some, procuring a few is as easy as installing a game and playing. Cards drop after you’ve spent a certain amount of time playing the game, and usually limits the number of drops per session — how many cards you can get depends on the game. To check if a game supports cards, check its store page under the list of features to see if it’s tagged as including Steam Trading Cards. That’s not completely foolproof — some games dish out cards even though it isn’t listed as a feature — but the designation is pretty reliable. You can also search Steam using the Steam Trading Cards tag to find more games with cards. Find the cards you don’t want in your inventory When cards are added to your account, they appear in your Steam inventory. You can find your inventory by hovering over your account name at the top of the Steam window and clicking “inventory” on the drop-down menu that appears. On the Inventory page, click the left-most “Steam” tab to see your cards. From there, you can select cards and find the ones you’re ready to get rid of on the market. Clicking on a card allows you to read its description and find other info, including the number that have sold on the market in the last 24 hours, and what the lowest starting price is on the market. List your card When you’re ready to sell, click your card and scroll all the way to the bottom of the screen, to the bottom of the section on the right side that gives you information on the card. Beneath the information about the sales volume and starting price on the Community Market, you will see a button marked “Sell” that will get you started. When you click it, you’ll get a window that lets you set your price for the card, and shows you a graph of how many cards have sold lately, and at what price. Use that information to decide how much to ask for the card when you list it. You can set your price in either one of two ways: How much money you will receive from the person buying your card, or how much they will pay in total. The two prices are different because Steam adds a small fee to every transaction on the Community Market, so the price the buyer pays is always a little higher than what you receive in Steam credit. Confirm the listing Now it’s time to grab your Steam Guard Authenticator app. Log into the app and go to the “Confirmations” tab on the main menu, which you can access by tapping the three lines in the top left corner of the app. Find the listings you want to confirm and tap the big gray box on their right side, then click “Confirm Selected.” Once you hit that button, your card goes on the Community Market. Check your listings Once you post a card, it’s easy to find and view your listings or adjust as needed. To find them, however over “Community” on Steam to pull up the drop-down menu and hit “Market.” Steam will show your current active listings, which you can remove if you need to (and relist if you want to change prices), as well as your complete market history on another tab. Otherwise, that’s it: You have listed your Steam trading cards on the Community Market and all that is left to do is wait for pennies’ worth of Steam credit to roll in. Editors’ Recommendations Gabe Newell says Valve currently has multiple games in development Steam privacy changes make purchase-tracking service Steam Spy useless Steam Machines quietly disappear from Valve’s home page Cleaning up your game library? Use our tips to organize your digital clutter You can soon stream your Steam PC games to Android, iPhone, Apple TV Advertisements Read more from News","contentWithMarkup":"<p>Steam has become more than just a platform for buying and distributing games — developer Valve has, over the years, inserted hooks to make it feel like a bit of a social network and a game unto itself. One of the big ways Steam encourages people to use the client and interact with other people is its Steam Trading Cards system, where games dish out digital cards when you play them that you can then trade with other people.</p>\n<p>If you’re not a fan of collecting and trading digital cards, though, there is another option — selling them. Steam allows you to put up some digital and in-game items on its Community Market, which can net you money in the form of Steam credit to spend on more games. While most trading cards only go for a few pennies, a select few can be pretty lucrative. Plus, even if you only get a little, that a bit less leaving your pocket next time you buy a game.</p>\n<p>Interested? We’ve put together a step-by-step guide to walk you through the process of sel</p>","tags":["News"],"publishedDate":"2018-06-02T21:20:55Z","harvestDate":"2018-06-02T21:21:03Z","estimatedPublishedDate":"2018-06-02T21:20:55Z","url":"http://ct.moreover.com/?a=34207097511&p=1u0&v=1&x=dvmGnCwogk2jK4onUxNrGA","originalUrl":"https://blog.aivanet.com/2018/06/03/how-to-sell-steam-trading-cards/","outboundUrls":[],"wordCount":"945","dataFormat":"text","duplicateGroupId":"34200596614","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"286384"},"adultLanguage":"false","topics":[{"name":"Digital distribution news","group":"Internet"}],"companies":[],"author":{"name":"John_A","publishingPlatform":{"userId":"23332316"}},"licenses":[],"source":{"name":"AIVAnet","homeUrl":"http://blog.aivanet.com","location":{"country":"Greece","countryCode":"GR","region":"Europe","subregion":"Southern Europe"},"feed":{"id":"406647543","name":"AIVAnet","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"23050495","generator":"http://wordpress.com/","description":"Online Magazine with news, reviews, software and comparisons for mobile devices and more.","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"53086","inboundLinkCount":"6"},"inWhiteList":"true","autoTopics":["ugc technology feeds"]}},"es_id":86989854}