{"sequenceId":"845365554468","id":"34207218916","language":"English","title":"LeBron James says Game 1 loss was one of the toughest of his career","content":"LeBron James says Game 1 loss was one of the toughest of his career Originally posted on Larry Brown Sports By Darryn Albert  |  Last updated 6/2/18 Tweet Cleveland’s deflating loss in Game 1 of the NBA Finals was on a level of its own, even for a player who has been through as much as LeBron James has. Speaking with reporters on Saturday, the Cavaliers star called Thursday’s defeat one of the toughest losses of his NBA career but expressed optimism heading into Sunday’s Game 2. He also said that the poked eye he suffered in the game was feeling a lot better, per Marc J. Spears of The Undefeated. LeBron James called Game 1 of the NBA Finals one of the \"toughest losses of his career\" and a \"tough 24 hours\" after, but he \"feels excited about the opportunity to be better, be great\" now. — Marc J. Spears (@MarcJSpearsESPN) June 2, 2018 Cavaliers forward LeBron James says he is taking eye drops and antibiotics to aid him with his poked eye injury suffered in Game 1 and says his eye \"feels a lot better.\" — Marc J. Spears (@MarcJSpearsESPN) June 2, 2018 James has, of course, played in the league for 15 years and seen his fair share of devastating defeats, including five times losing in the Finals. But coming within a JR Smith brain cramp of stealing Game 1 from a heavily-favored all-time team like the Warriors on their home floor is probably unprecedented, even for James. Now we wait to see how he and the Cavs respond on Sunday. This article first appeared on Larry Brown Sports and was syndicated with permission. PLAYERS: LeBron James,  J.R. Smith TEAMS: Cleveland Cavaliers MORE FROM YARDBARKER Report: Klay Thompson receiving around-the-clock treatment to play in Game 2 WATCH: Klay Thompson leaves Game 1 of NBA Finals with apparent knee injury NBA releases official two-minute report following Game 1 Andre Iguodala still considered day-to-day by Warriors, is improving Andre Iguodala doubtful for Game 2 of NBA Finals Ranking NFL head coaches heading into the 2018 season Report: Clay Matthews likely has broken nose after softball accident Watch: Clay Matthews hit in face by line drive during charity softball game WATCH: NFL explains use of helmet rule in new video LIKE WHAT YOU SEE? GET THE DAILY NEWSLETTER: WATCH: Clay Matthews takes liner off face in charity softball game Packers RB Aaron Jones sees his act of kindness go viral Ha-Ha Clinton-Dix skips Packers OTAs Former NBA player Matt Barnes gets sick Tupac tattoo Mariners use Smash Mouth song to troll fans into making their All-Star votes Mariners option Gordon Beckham to Triple-A Sports & Politics Intersect: POTUS trumped players in anthem policy decision Red Sox place Dustin Pedroia on 10-day DL AL MVP the year you were born Red Sox place Mookie Betts on 10-day DL Hanley Ramirez officially released by Red Sox Terrell Owens pitches his services to the 49ers NBA has ‘no plans’ to alter Rookie of the Year rules amid Simmons-Mitchell debate MORE STORIES >> Sports & Politics Intersect: POTUS trumped players in anthem policy decision Minnesota Congressman vows to boycott NFL over ‘idiotic kneeling ban’ Rudy Giuliani has odd take on Yankees fans booing him at game Idaho AD has leave extended as probe into sexual assault handling continues The 'Man of steal' quiz Famous and obscure MLB records that could fall in 2018 22 MLB records that will never be broken in our lifetimes Best MLB player of all time drafted from every state Major League Baseball's 3,000-hit club Best first-round MLB Draft picks by slot First-round 2018 MLB Mock Draft Best first overall MLB Draft picks ever Athletes from other sports drafted by MLB teams Best MLB player of all time drafted from every state Best late-round steals in MLB Draft history Cities that have infamously lost franchises Top 10 MLB prospects who could make an impact in June Cardinals unlikely to put innings limit on Alex Reyes Dodgers promote highly-touted prospect Dennis Santana First-round 2018 MLB Mock Draft Best late-round steals in MLB Draft history The 'Who's your Vladdy?' quiz Three Up, Three Down: The MLB hot/cold report Mariners acquire Denard Span, Alex Colome in trade with Rays Rudy Giuliani has odd take on Yankees fans booing him at game Top 10 MLB prospects who could make an impact in June June entertainment planner: 'Jurassic World,' 'Sense8' and Kanye bring the summer heat The 20 movies you shouldn't sleep on this summer Five emerging artists to catch at Governors Ball 2018 Potential summer anthems for 2018 The Steelers should swallow their pride and pay Le'Veon Bell New Le'Veon Bell rap song sends strong message to Steelers Report: Bell seeking $17 million a year from Steelers Antonio Brown’s advice to RB: ‘Show up’ Steelers reportedly not expecting Bell to show until September No, veterans missing OTAs is not a big deal First-round 2018 NBA Mock Draft 2018 NBA Draft lottery prospect tiers Suns may target Doncic with No. 1 pick 10 sleepers to keep an eye on in the 2018 NBA Draft Ranking the No. 2 overall NBA Draft picks in the lottery era Will Germany's issues between the pipes prevent them from World Cup glory? 20 key questions entering the 2018 World Cup First-round 2018 MLB Mock Draft Best first overall MLB Draft picks ever Best late-round steals in MLB Draft history NBA Finals Preview: Can LeBron James beat the Warriors? LeBron has blunt take on idea Cavs vs. Warriors IV is bad for NBA Tyronn Lue still unsure of Kevin Love’s status for Game 1 Andre Iguodala ruled out for Game 1 Greatest games of the Warriors-Cavaliers showdowns in NBA Finals The 'Throne for a loop' quiz MORE STORIES >> Cavaliers News Delivered to your inbox You'll also receive Yardbarker's daily Top 10, featuring the best sports stories from around the web. Customize your newsletter to get articles on your favorite sports and teams. And the best part? It's free! By clicking \"Sign Me Up\", you have read and agreed to the Yardbarker Privacy Policy and Terms of Service. You can opt out at any time. For more information, please see our Privacy Policy. Follow us on Twitter Follow @Yardbarker BEST OF YARDBARKER Sports & Politics Intersect: POTUS trumped players in anthem policy decision Tweet Best first-round MLB Draft picks by slot Tweet Cities that have infamously lost franchises Tweet The 'Man of steal' quiz Tweet Three Up, Three Down: The MLB hot/cold report Tweet The 'King vs. Goliath' quiz Tweet NBA Finals Preview: Can LeBron James beat the Warriors? Tweet Top 10 MLB prospects who could make an impact in June Tweet The 'Hello, old friend' quiz Tweet June entertainment planner: 'Jurassic World,' 'Sense8' and Kanye bring the summer heat Tweet MORE BEST OF YARDBARKER >>","contentWithMarkup":"Cleveland’s deflating loss in Game 1 of the NBA Finals was on a level of its own, even for a player who has been through as much as LeBron James has.Speaking with reporters on Saturday, the Cavaliers star called Thursday’s defeat one of the toughest losses of his NBA career, but expressed optimism heading into Sunday’s Game 2. He also said that the poked eye he suffered in the game was feeling a lot better, per Marc J. Spears of The Undefeated. James has, of course, played in the league for 15 years and seen his fair share of devastating defeats, including five times losing in the Finals. But coming within a JR Smith brain cramp of stealing Game 1 from a heavily-favored all-time team like the Warriors on their home floor is probably unprecedented, even for James. Now we wait to see how he and the Cavs respond on Sunday.","tags":[],"publishedDate":"2018-06-02T21:08:00Z","harvestDate":"2018-06-02T21:50:53Z","estimatedPublishedDate":"2018-06-02T21:08:00Z","url":"http://ct.moreover.com/?a=34207218916&p=1u0&v=1&x=HvYDk3Sud1upoZ-WJWx7Bg","originalUrl":"https://www.yardbarker.com/nba/articles/lebron_james_says_game_1_loss_was_one_of_the_toughest_of_his_career/s1_127_26549390","outboundUrls":["http://larrybrownsports.com/basketball/lebron-james-game-1-loss-one-toughest-career/447094","http://larrybrownsports.com/","http://twitter.com/share?count=horizontal&via=yardbarker","http://larrybrownsports.com/basketball/lebron-james-blurry-vision-draymond-green-poke/446917","https://twitter.com/MarcJSpearsESPN/status/1003011882603515904?ref_src=twsrc%5Etfw","https://twitter.com/MarcJSpearsESPN/status/1003012864922169344?ref_src=twsrc%5Etfw","http://larrybrownsports.com/basketball/jr-smith-blunder-end-of-game-1/446871","http://twitter.com/Yardbarker","https://twitter.com/share"],"wordCount":"1086","dataFormat":"text","duplicateGroupId":"34207000692","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"No.1 Co Ltd","symbol":"3562","exchange":"TKS","isin":"JP3653590004","titleCount":0,"contentCount":1,"primary":true}],"author":{"publishingPlatform":{}},"licenses":[],"source":{"name":"Yardbarker: Rumors and Gossip","homeUrl":"http://www.yardbarker.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"327833350","name":"Yardbarker: Rumors and Gossip","mediaType":"Blog","description":"Recent rumors and gossip","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"40009","inboundLinkCount":"10"},"inWhiteList":"true","autoTopics":["ugc management feeds","ugc sport feeds"],"editorialTopics":["Basketball","Sports","Consumer"]}},"es_id":86993743}