{"sequenceId":"845362053167","id":"34207105965","language":"English","title":"Not My Job: We Quiz Aubrey Plaza On The Plaza Hotel","content":"Listen Listening... / Originally published on June 2, 2018 10:46 am Copyright 2018 NPR. To see more, visit http://www.npr.org/. BILL KURTIS: From NPR and WBEZ Chicago, this is WAIT WAIT... DON'T TELL ME, the NPR News quiz. I'm Bill Kurtis, and here is your host at the Chase Bank Auditorium in Chicago, Peter Sagal. PETER SAGAL, HOST: Thank you, Bill. (APPLAUSE) SAGAL: So we're outside this week. We're blinking at the sun, trying to get our eyes adjusted to the natural light. The sun is so much brighter than our phones. KURTIS: While we're reacclimating to the actual climate, we're revisiting some great interviews we did in the last year. SAGAL: So we all loved the sitcom \"Parks And Recreation,\" so it was a thrill to have a star of that show, Aubrey Plaza, right here with us onstage in Chicago to talk about her obscene movie about medieval nuns, \"The Little Hours.\" (SOUNDBITE OF ARCHIVED BROADCAST) AUBREY PLAZA: Thank you for having me. SAGAL: It is so... (APPLAUSE) SAGAL: ...Exciting to have you. And, as always, I was surprised to find out - I know I should know by now - that you are not the characters you have played. We heard, in fact, that you were kind of a - I don't know how to put this - a goody-goody-type girl growing up in Delaware? PLAZA: Yeah. SAGAL: You walked the straight and narrow - is that true? PLAZA: Yeah. Yeah. I think I was. Yeah. I didn't really get into too much trouble. SAGAL: And we understand you were a member of 4-H. PLAZA: I was, yeah. SAGAL: And were you a farm girl? Were you with livestock? PLAZA: No. I grew - I was - I lived in Wilmington, Del., which - and I lived more in the city. But, in the summers, I would go down for 4-H state camp, and I would hang out with all the farmers down there in lower Delaware. SAGAL: You have gotten into trouble a few times, we heard. Like, we heard that you were thrown out of an award ceremony because you stole Will Ferrell's award. Is this true? PLAZA: It is true. Yeah. SAGAL: Yeah. What is... (LAUGHTER) PLAZA: That's true. That's a fact. SAGAL: What exactly did you do? PLAZA: I'm not at liberty to say. SAGAL: I understand. (LAUGHTER) PLAZA: That's a legal matter... SAGAL: Yeah. PLAZA: ...That I can't discuss on... SAGAL: You've been... PLAZA: ...Television. SAGAL: You've been advised not to go into that? PLAZA: Let's just say... FAITH SALIE: I mean, you went there... PLAZA: ...There were pyrotechnics on the stage, and if you go on without announcing yourself, I could have burned alive. So legally, they had to throw me out. And that's on me. SAGAL: If it had gone badly, it would've been a great way to go out, I'll have to say. PLAZA: I'll take it. SAGAL: Yeah, I know. (LAUGHTER) SAGAL: So the movie you're in, \"The Little Hours\" - I'm going to let you describe this film. PLAZA: OK. It's called \"The Little Hours,\" and it's based on \"The Decameron,\" which is a compilation of stories from medieval times. SAGAL: This is public radio. We're all English majors. We know. PLAZA: OK. (LAUGHTER) PLAZA: I'm not very smart, so it's new to me. (LAUGHTER) PLAZA: And it's a - yeah, it's basically an adaptation of \"The Decameron,\" and it's about three nuns in a convent that don't really want to be there or want to be nuns. SAGAL: There's a lot of nuns going berserk. PLAZA: Yes. SAGAL: Yes. (LAUGHTER) SAGAL: There's a fair amount - and, particularly for a film with a religious setting, a fair amount of sex. PLAZA: Oh, yeah. SAGAL: Oh, yeah. (LAUGHTER) SAGAL: So basically, you play a foul-mouthed, axe-wielding, sexually rapacious pagan witch nun. PLAZA: Yes. (LAUGHTER) LUKE BURBANK: Do you ever feel typecast by that role? (LAUGHTER) PLAZA: You know, that role was also written for me, so... (LAUGHTER) SAGAL: Well, not - and this is the funny thing. (LAUGHTER, APPLAUSE) SAGAL: This role was written for you by the director of the film, who is your partner, right? PLAZA: That's right. SAGAL: So he says to you, honey, I have got a great idea for a part. I would like you to play an axe-wielding, profane, foul-mouthed, sexually rapacious, pagan, Satan-worshipping-possibly nun. And you say... PLAZA: I said, OK. What are we having for dinner? (LAUGHTER) SALIE: So what was it like to film the sex scenes in front of your partner - for him? PLAZA: Yeah. It was - you know, it was fine. It wasn't like, oh, my god. Today's the day. (LAUGHTER) PLAZA: We're all going to really get weird tonight. You know, we were just - I was in character, and we were just trying to honor the script and make something good. BURBANK: I promise you, though, if you've been married for 15 years, it would be, like, oh, my god. Today's the day. (LAUGHTER) PLAZA: You know what? It was a little fun... (LAUGHTER) SAGAL: Yeah. PLAZA: ...Really spiced things up. SAGAL: Yeah. (LAUGHTER) PLAZA: Keeps it interesting, you know? SAGAL: Yeah. Preferably favorite thing we found out about you is that you play basketball in a team called the Pistol Shrimps. PLAZA: I play basketball, but I traded myself from the Pistol Shrimps to the Spice Squirrels last season. (LAUGHTER) SAGAL: Oh, wow. PLAZA: We won first place last season, second place this season. We're doing pretty good right now. SAGAL: Are actors and comedians weird to play basketball with? Are they as weird in the basketball court as they tend to be in real life? PLAZA: No. I mean, I think once you're on the court, you're just like an animal, you know? You're just, like, watching the ball and trying to get it in the thing and... (LAUGHTER) PLAZA: You just - there's not a lot of times to make jokes... SAGAL: Yeah. PLAZA: ...You know? But I do sometimes. SAGAL: Really? PLAZA: Yeah. SAGAL: Can you give me an example? PLAZA: Just shoot it now - just shoot it right now. (LAUGHTER) PLAZA: I like to say stuff like that to people where they're, like, what? I'm, like, shoot it now. Like, I just try to have conversations with them and distract them. SALIE: (Laughter). BURBANK: That can be good advice. If the shot clock is running down, that could be helpful advice, actually. PLAZA: Yeah. (LAUGHTER) SAGAL: So you're a very dry trash-talker. PLAZA: Yeah. I like to - yeah, keep it really subtle. SAGAL: Yeah, I understand. (LAUGHTER) SAGAL: Well, Aubrey Plaza, it is a pleasure to meet you, but we've invited you here to play a game we're calling... KURTIS: Welcome to the Most Prestigious Hotel in the World. SAGAL: So you are Aubrey Plaza, so, of course, we're going to ask you... PLAZA: Right. SAGAL: ...About the Plaza Hotel in New York City, famed in history and in gossip columns. Answer two questions correctly about the great hotel, you'll win our prize for one of our listeners. Bill, who is Aubrey Plaza playing for? KURTIS: Samantha Gray of Utica, N.Y. SAGAL: All right. You ready to do this? PLAZA: Yes. SAGAL: All right. Perhaps the most famous long-term resident of the Plaza Hotel was Kay Thompson, who wrote the \"Eloise\" books about a little girl who lived in the hotel. Kay Thompson, though, left the hotel forever in the 1980s when she was outraged by what? Was it, A, an act down in the Plaza 9 Cabaret in the hotel called Eloise - All Grown Up and Ready to Party? (LAUGHTER) SAGAL: B, the owner of the hotel saying to the New York Times, of course, in reality, I doubt that little girl could afford to stay here. Or C, they asked her to pay for her room. PLAZA: C? SAGAL: Yes, you're right. (SOUNDBITE OF BELL) SAGAL: Kay Thompson, author of \"Eloise.\" You know the Eloise books? Did you grow up on that? PLAZA: Yeah. SAGAL: Yeah, yeah. Well, she got to live in the Plaza for free for many years because she gave so much publicity to the hotel through those Eloise books, and they sold merchandise. And then they realized it wasn't paying the bills, and somebody said, Ms. Thompson, maybe you could pay for your room? And she left in a huff and never came back. To this day, the hotel has an Eloise suite decorated in the style of the books by Kay Thompson. One important thing happened in the Eloise suite - A, Charlie Sheen had his epic bender with a prostitute there. (LAUGHTER) SAGAL: B, President John F. Kennedy first met Marilyn Monroe, per her request. Or, C, the first Jell-O shot was invented. (LAUGHTER) BURBANK: Some of those could have happened on the same night. SAGAL: Yeah. (LAUGHTER) PLAZA: A? SAGAL: Charlie Sheen? You're right. That's... PLAZA: Oh, my God. (SOUNDBITE OF BELL) SAGAL: Remember that? (APPLAUSE) PLAZA: No. That's horrible. SAGAL: Remember that whole thing - the woman calling down at the desk yelling, help, Charlie Sheen has me locked in the closet, and he's going berserk - the Eloise suite, ladies and gentlemen. SALIE: (Laughter). SAGAL: Last question - we have to mention that our president, Donald Trump, bought the hotel in 1988, and he owned it into the mid-'90s. He hired his wife Ivana to oversee the redecoration of the property, and she did such a fantastic job that what then happened? A, the king of Saudi Arabia was so impressed that he ordered his third-favorite palace decorated in just the same way. B, Brian De Palma used it as the set for the home of the drug lord in \"Scarface.\" Or C, Donald himself used the grand ballroom to marry the woman he left Ivana for. (LAUGHTER) PLAZA: C? SAGAL: Yes. (LAUGHTER, APPLAUSE) SAGAL: Of course. That's where Donald Trump had his second wedding to Marla Maples, the woman he'd been fooling around when he was married to Ivana. Bill, how did Aubrey Plaza do on our quiz? KURTIS: She did a perfect job. PLAZA: Thanks. KURTIS: You are a winner. (APPLAUSE) KURTIS: Thank you. SAGAL: Aubrey Plaza is a comedian and actress. You've seen her in \"Parks And Rec\" and the TV show \"Legion.\" Her new movie, \"The Little Hours,\" is out now. Aubrey Plaza, thank you so much for joining us. (APPLAUSE) PLAZA: Thanks for having me. SAGAL: Aubrey Plaza, ladies and gentlemen. (SOUNDBITE OF FRANKY FASTFINGERS FLINT'S \"FAME AND FORTUNE\") Transcript provided by NPR, Copyright NPR. TweetShareGoogle+Email","contentWithMarkup":"Copyright 2018 NPR. To see more, visit BILL KURTIS: From NPR and WBEZ Chicago, this is WAIT WAIT... DON'T TELL ME, the NPR News quiz. I'm Bill Kurtis, and here is your host at the Chase Bank Auditorium in Chicago, Peter Sagal. PETER SAGAL, HOST: Thank you, Bill. (APPLAUSE) SAGAL: So we're outside...<div class=\"feedflare\">\n<a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=t_1eb43k9FA:Wv7nuj_NrXs:I9og5sOYxJI\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?d=I9og5sOYxJI\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=t_1eb43k9FA:Wv7nuj_NrXs:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?d=qj6IDK7rITs\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=t_1eb43k9FA:Wv7nuj_NrXs:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?i=t_1eb43k9FA:Wv7nuj_NrXs:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=t_1eb43k9FA:Wv7nuj_NrXs:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?d=yIl2AUoC8zA\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/GPBNewsFeed/~4/t_1eb43k9FA\" height=\"1\" width=\"1\" alt=\"\"/>","tags":[],"publishedDate":"2018-06-02T12:49:00Z","harvestDate":"2018-06-02T21:22:57Z","estimatedPublishedDate":"2018-06-02T12:49:00Z","url":"http://ct.moreover.com/?a=34207105965&p=1u0&v=1&x=Odujwb3k6_6eyqEc-5Acpg","originalUrl":"http://gpbnews.org/post/not-my-job-we-quiz-aubrey-plaza-plaza-hotel-0","outboundUrls":["https://ondemand.npr.org/npr-mp4/npr/waitwait/2018/06/20180602_waitwait_04.mp4?orgId=1&d=526&p=35&story=615975713&ft=nprml&f=615975713","http://twitter.com/intent/tweet?url=http%3A%2F%2Fwww.tinyurl.com%2Fybkppwuk&text=Not%20My%20Job%3A%20We%20Quiz%20Aubrey%20Plaza%20On%20The%20Plaza%20Hotel%20","http://facebook.com/sharer.php?u=http%3A%2F%2Fwww.tinyurl.com%2Fybkppwuk&t=Not%20My%20Job%3A%20We%20Quiz%20Aubrey%20Plaza%20On%20The%20Plaza%20Hotel%20","https://plus.google.com/share?url=http%3A%2F%2Fwww.tinyurl.com%2Fybkppwuk","http://www.npr.org/","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=t_1eb43k9FA:Wv7nuj_NrXs:I9og5sOYxJI","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=t_1eb43k9FA:Wv7nuj_NrXs:qj6IDK7rITs","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=t_1eb43k9FA:Wv7nuj_NrXs:F7zBnMyn0Lo","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=t_1eb43k9FA:Wv7nuj_NrXs:yIl2AUoC8zA"],"wordCount":"1746","dataFormat":"text","duplicateGroupId":"34196717784","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Hospitality industry news","group":"Industry"}],"companies":[{"name":"New York Times Co","symbol":"NYT","exchange":"BER","isin":"US6501111073","titleCount":0,"contentCount":1,"primary":true},{"name":"New York Times Co","symbol":"NYT","exchange":"STU","isin":"US6501111073","titleCount":0,"contentCount":1,"primary":true},{"name":"New York Times Co","symbol":"NYT","exchange":"DUS","isin":"US6501111073","titleCount":0,"contentCount":1,"primary":true},{"name":"New York Times Co","symbol":"NYT","exchange":"MUN","isin":"US6501111073","titleCount":0,"contentCount":1,"primary":true},{"name":"New York Times Co","symbol":"NYT","exchange":"FRA","isin":"US6501111073","titleCount":0,"contentCount":1,"primary":true},{"name":"New York Times Co","symbol":"NYT","exchange":"NYS","isin":"US6501111073","titleCount":0,"contentCount":1,"primary":true},{"name":"New York Times Co","symbol":"NYTAB","exchange":"PINX","isin":"US6501114044","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"editor","publishingPlatform":{}},"licenses":[],"source":{"name":"GPB News Feed","homeUrl":"http://gpbnews.org","location":{},"feed":{"id":"186192773","name":"GPB News Feed","mediaType":"Blog","publishingPlatform":"NPR","generator":"NPR Digital Services RSS Generator 0.94","description":"Georgia Public Broadcasting gives you the latest statewide news, features, sights and sounds, all through our redesigned website at http://www.gpb.org/news!","tags":["News & Politics"],"imageUrl":"http://www.npr.org/images/stations/redesign/wjsp_fm.gif","copyright":"℗ & © 2010 Georgia Public Broadcasting","language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"27391","inboundLinkCount":"19"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990145}