{"sequenceId":"845361965146","id":"34207103438","language":"English","title":"Yellow Warblers And A Green-tailed Towhee","content":"Yellow Warblers And A Green-tailed Towhee By Ron Dudley, on June 2nd, 2018\tFor me photographing Yellow Warblers is usually an exercise in frustration. Because of their preferred habitat of wet, deciduous thickets they’ve been described as “a brief splash of yellow in a patch of willow” and they seldom give me time to get my lens on them. When I succeed there’s usually obstructing branches, shadows on the bird or poor light. And they seldom hold still long enough for me to get the shot I’m after.   1/2000, f/6.3, ISO 800, Canon 7D Mark II, Canon EF 500mm f/4L IS II USM + EF 1.4 III Extender, not baited, set up or called in But 3 days ago I had some limited success with them in the Wasatch Mountains. I caught this one in the open, it gave me a nice head turn and there was good light on most of the bird. I’m not happy with the shadows on the wings and tail but with this species I rarely have everything come together and I still like the photo.     1/3200, f/6.3, ISO 800, Canon 7D Mark II, Canon EF 500mm f/4L IS II USM + EF 1.4 III Extender, not baited, set up or called in Four minutes later another warbler on a similar perch allowed me a few shots. This time there are no shadows on the bird but there was a small piece of bright branch in the upper left corner of the frame that I found very distracting so I zapped it. The leaves poking into the frame at lower left don’t bother me much but that bright branch sure did.     1/3200, f/6.3, ISO 800, Canon 7D Mark II, Canon EF 500mm f/4L IS II USM + EF 1.4 III Extender, not baited, set up or called in About an hour later I found this Green-tailed Towhee perched in a profusion of flowers. Serviceberry abounds in this canyon and occasionally I’ll find a bird perched on it while it’s flowering. In this case the flowers, leaves and branches almost overwhelm the bird but it’s such a pretty setting I can largely overlook that.   On an unrelated note: Some readers have recently been frustrated because auto-fill no longer works so they have to completely fill in their name and email address before posting a comment on my blog. This is almost certainly due to the recent implementation of GDPR (General Data and Protection Regulation) and privacy compliances on the internet that became enforceable on May 25. I have the same problem on several sites I visit regularly although it doesn’t seem to be universal. If there’s a work-around I haven’t been able to find it. Sorry… Ron     June 2nd, 2018 | Tags: gdpr, general data and protection regulation, green-tailed towhee, utah, yellow warbler | Category: Birds, Green-tailed Towhees, Yellow-rumped Warbler","contentWithMarkup":"For me photographing Yellow Warblers is usually an exercise in frustration. [...]","tags":["Birds","Green-tailed Towhees","Yellow-rumped Warbler","gdpr","general data and protection regulation","green-tailed towhee","utah","yellow warbler"],"publishedDate":"2018-06-02T11:12:02Z","harvestDate":"2018-06-02T21:22:28Z","estimatedPublishedDate":"2018-06-02T11:12:02Z","url":"http://ct.moreover.com/?a=34207103438&p=1u0&v=1&x=MWaRR9K2_4KnCPL6P7L6Tw","originalUrl":"http://www.featheredphotography.com/blog/2018/06/02/yellow-warblers-and-a-green-tailed-towhee/","commentsUrl":"http://www.featheredphotography.com/blog/2018/06/02/yellow-warblers-and-a-green-tailed-towhee/#comments","outboundUrls":["https://en.wikipedia.org/wiki/General_Data_Protection_Regulation"],"wordCount":"456","dataFormat":"text","duplicateGroupId":"34207103438","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Ron Dudley","publishingPlatform":{}},"licenses":[],"source":{"name":"Feathered Photography","homeUrl":"http://www.featheredphotography.com/blog","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"381211584","name":"Feathered Photography","mediaType":"Blog","publishingPlatform":"WordPress","generator":"https://wordpress.org/?v=4.5.1","description":"Ron Dudley's blog, devoted primarily to bird photography and bird behaviors","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"29163","inboundLinkCount":"17"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990039}