{"sequenceId":"845361801887","id":"34207097632","language":"English","title":"Let's talk about the c-word -- and why it's so taboo","content":"Comedians are foul-mouthed. The use of profanity in comedy is so commonplace that it's almost expected. But there still are a few vulgarities so offensive, so crude that even comedians usually avoid them, particularly when hurling a personal insult. On Wednesday night (May 30), Samantha Bee stunned audiences, angered advertisers and infuriated the White House when she attacked the president's daughter Ivanka using the c-word. She uttered the vulgar expletive on her TBS show \"Full Frontal\" while criticizing the Trump administration's immigration crackdown. She pointed out a tweet from Ivanka Trump that included a photo of her and her younger son, posted around the same time as reports (many not entirely accurate) that the U.S. government \"lost track\" of nearly 1,500 migrant children last year. \"You know, Ivanka, that's a beautiful photo of you and your child,\" Bee said during her show. \"Let me just say, one mother to another, do something about your dad's immigration practices, you feckless c---. He listens to you.\" The criticism was intense and, in many cases, bipartisan. The White House on Thursday called Bee's language \"vile and vicious.\" A usually unapologetic Bee apologized profusely, saying the expletive was \"inappropriate and inexcusable. I crossed a line, and I deeply regret it.\" Across social media, scores of others agreed that Bee went too far. After all, the word she used is considered one of the ugliest in the dictionary, among the worst vulgarities a person can direct at a woman. But then, some unexpected reactions emerged. One came from the award-winning actress Sally Field, known for roles such as Mary Todd Lincoln and Forrest Gump's beloved mother. \"I like Samantha Bee a lot, but she is flat wrong to call Ivanka\" the c-word, Field tweeted. Her reasoning was seen by some as surprising. The c-word, Field said, is \"powerful, beautiful, nurturing and honest.\" Her view puzzled some. After all, when was the last time you heard someone use the word as a compliment? The actress Minnie Driver weighed in with an unexpected tweet. \"That was the wrong word for Samantha Bee to have used,\" Driver said. \"But mostly because (to paraphrase the French) Ivanka has neither the warmth nor the depth.\" That was the wrong word for Samantha Bee to have used . But mostly because ( to paraphrase the French ) Ivanka has neither the warmth nor the depth. -- Minnie Driver (@driverminnie) May 31, 2018 They argued, it seemed, that because the c-word describes a woman's sexual organs, it should carry a positive meaning - not a negative one. While the actresses drew criticism on social media for their messages, their arguments are not new or unique. For years, many writers, feminists, gender studies scholars and others have argued that women should reclaim the c-word, assigning it a meaning that empowers women. When viewed as a positive term, in reference to the anatomy that unites women, \"the negative power of c- falls in upon itself,\" writes Inga Muscio in her 2009 book about the c-word, which she calls \"an ancient title of respect for women.\" Such writings raise the question, why is the c-word so much more taboo than other foul and forbidden words? After all, early forms of the word referred neutrally to the female genitalia, with related forms in Old Norse kunta, Old Frisian and Middle Low German kunte, and Middle Dutch conte, as Kate Burridge, professor of linguistics at Monash University wrote in the Conversation. But the c-word \"fell from grace,\" and early dictionaries help track its evolution. The word appeared among 4,000 vulgarities in Captain Francis Grose's \"Dictionary of the Vulgar Tongue,\" first published in 1785. The definition was \"a nasty word for a nasty thing.\" \"It was around this time that . . . (the c-word) then became truly invisible - banished to the 'dark continent of the world of words,' \" Burridge wrote. It didn't reappear in general dictionaries until the 1960s. Shakespeare simply alluded to the word in his writing, and the fact that he didn't blatantly use the word indicates it was probably a taboo during his time. Darin Flynn, a linguistics professor at the University of Calgary, said in an interview with The Washington Post that the word's negative connotation could be rooted in even earlier times, linked to the biblical Garden of Eden story positing that Eve, the woman, led to the fall of mankind. Negative notions of female sexuality, or notions of uncleanliness associated with menstruating women, may have all contributed to the word's taboo nature. Constant usage solely in the context of diminishing a woman takes over from there. Like other words that might once have been benign or at least neutral, it is now a prisoner of parlance. And the current use of the word, Flynn argues, is rooted in misogyny. In one scene of the show \"30 Rock,\" Tina Fey's character Liz Lemon tries to fire an employee after she overhears him calling her the c-word. \"I'm not upset by cursing! I mean, I love cursing. I love it. But this word is not acceptable,\" she says. \"You know, because there's nothing you can call a guy back. There is no male equivalent to that word.\" There are, indeed, words for male genitalia that have negative connotations, such as the one beginning with \"pr\" that rhymes with the one beginning with \"di.\" But those words are not nearly as loaded or offensive as the c-word. And then there are words for male private parts that have evolved into positive adjectives, indicating power, dominance, swagger. \"I just get tired of people saying, 'That's so ballsy,' \" Leila J. Rupp, a professor of feminist studies at the University of California at Santa Barbara, said in an interview with The Post. Why aren't the female equivalents used as compliments, she asks. Flynn, of the University of Calgary, argues that it's because society has not yet accepted positive uses of the words. Silpa Kovvali wrote in Salon that the c-word and negative slang words for male genitals are examples of \"a bizarre linguistic tendency to use gendered terminology where non-gendered words would most certainly do.\" But the reason male-gendered words cause less \"pearl clutching,\" she argues, has to do with an association between femininity and defenselessness. \"A corollary to the notion that women ought not be vulgar and aggressive - or do so at the risk of being labeled a (c-word) to begin with - is the belief that vulgar aggression directed at women is inherently misogynistic,\" Kovvali writes. While there are many words for female genitalia, the c-word is by far the worst. Linguists note that other terms are euphemistic or diminutive, while the c-word is more straightforward in its definition, as Slate noted in 2013. The c-word also has one syllable, and packs a similar punch as some other vulgar words, like the f-word, for example, Flynn told The Post. Juliet Williams, a professor of gender studies at UCLA, said in an email to The Post that the implication of the c-word was \"fundamentally different when Samantha Bee uses it than . . . if, say, John Oliver had.\" Flynn explained this concept as \"in group\" versus \"out group.\" It's the rationale behind why it might be viewed as acceptable for black people to use the n-word. In this case, Bee, as a woman, is part of the \"in group,\" he said. But because she used the word to attack Ivanka Trump, someone she is clearly opposed to, \"they can't cut her any slack there.\" Other English-speaking cultures see the word as far less taboo. Amid the Samantha Bee controversy Thursday, British observers on Twitter noted that the word is nowhere near as offensive in some parts of Britain, though it's more often applied to men. As Keith Allan and Kate Burridge, of Monash University, wrote: \"It is generally accepted that (the c-word) is the most tabooed word in English. But the same is not true of its cognates in other languages,\" such as the French con and Spanish cono. \"It reminds us too that the origin of a word doesn't really matter. It's how people use it,\" Flynn said. Perhaps another reason the c-word is so taboo is that it simply isn't used as often, at least in public. Unlike the f-word, for example, which now seems ubiquitous despite its vulgarity, it still has shock value, it still provokes gasps and indicates deep disdain. \"Linguistic, psychological and neurological studies all confirm that it's forbidden words that are the most arousing, memorable and evocative of all language stimuli,\" Burridge wrote in the Conversation. \"They also confirm that this effect depletes with word repetition.\" \"If you want to diminish its potency,\" Burridge said, \"just use the word, and frequently.\" Samantha Schmidt wrote this story, (c) 2018 The Washington Post.","contentWithMarkup":"Samantha Bee isn't under fire for swearing. It's for her choice of swears.","tags":["tag:entertainment","tag:full frontal","tag:homepage","tag:Ivanka trump","tag:samantha bee","tag:tbs","tag:tv"],"publishedDate":"2018-06-02T20:42:50Z","harvestDate":"2018-06-02T21:21:06Z","estimatedPublishedDate":"2018-06-02T20:42:50Z","url":"http://ct.moreover.com/?a=34207097632&p=1u0&v=1&x=Nv9s1hlwCUNaSZWbxvPo7Q","originalUrl":"http://www.nola.com/national_politics/2018/06/why_is_the_c-word_taboo_06022018.html","outboundUrls":["https://twitter.com/sally_field/status/1002264847449550848","https://twitter.com/driverminnie/status/1002270163058610176","https://twitter.com/driverminnie/status/1002270163058610176?ref_src=twsrc%5Etfw"],"wordCount":"1440","dataFormat":"text","duplicateGroupId":"34201247704","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"Oliver Corp","symbol":"7959","exchange":"NGO","isin":"JP3200600009","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"The Washington Post","publishingPlatform":{}},"licenses":[],"source":{"name":"NOLA River","homeUrl":"http://blog.nola.com/nola_river/","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"304532292","name":"NOLA River","mediaType":"Blog","publishingPlatform":"Movable Type","generator":"Movable Type Enterprise 4.29-advance http://www.sixapart.com/movabletype/","tags":[],"language":"English","dataFormat":"Image","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86989862}