{"sequenceId":"845362072374","id":"34207106702","language":"English","title":"Cinders","content":"by Angela Wright     I never really wanted to marry Prince Charming, and have to admit to feelings of annoyance and discomfiture when the glass slipper fitted my petite and well shaped foot. Although it was highly amusing to watch my ugly stepsisters try to squeeze their huge bunioned tootsies into the slippers, part of me would have loved to have pawned the Prince off on to one of them. His vanity and arrogance, and their ugliness and stupidity would have gone well together.  However, he was a means to an end. He fell hook, line and sinker for the sob story I told him of being cruelly used by my stepmother and stepsisters. Rubbish and lies of course, as they doted on me, captivated as much as the Prince by my extreme beauty and charisma.  I should never have agreed to his proposal, except his extreme wealth was such an overwhelmingly strong temptation. Married life is a huge yawn − stifling etiquette and rigid court rules. I have already born him the son required of me, who shows every promise of being as tedious and vain as his father. However, I have planned my escape. My husband will awaken tomorrow morning to discover that he has lost not only his wife, but a substantial portion of his jewels and gold. So long, Prince Boring!","contentWithMarkup":"by Angela Wright\n\n \n\nI never really wanted to marry Prince Charming, and have to admit to feelings of annoyance and discomfiture when the glass slipper fitted my petite and well shaped foot. Although it was highly amusing to watch my ugly stepsisters try to squeeze their huge bunioned tootsies into the slippers, part of me would have loved to have pawned the Prince off on to one of them. His vanity and arrogance, and their ugliness and stupidity would have gone well together.\n\nHowever, he was a means to an end. He fell hook, line and sinker for the sob story I told him of being cruelly used by my stepmother and stepsisters. Rubbish and lies of course, as they doted on me, captivated as much as the Prince by my extreme beauty and charisma.\n\nI should never have agreed to his proposal, except his extreme wealth was such an overwhelmingly strong temptation. Married life is a huge yawn − stifling etiquette and rigid court rules. I have already born him the son required of me, who shows every promise of being as tedious and vain as his father. However, I have planned my escape. My husband will awaken tomorrow morning to discover that he has lost not only his wife, but a substantial portion of his jewels and gold. So long, Prince Boring!","tags":["Responses","Angela Wright"],"publishedDate":"2018-06-02T21:23:09Z","harvestDate":"2018-06-02T21:23:11Z","estimatedPublishedDate":"2018-06-02T21:23:09Z","url":"http://ct.moreover.com/?a=34207106702&p=1u0&v=1&x=RAhfZ_oldDUTkuqUKa-7-w","originalUrl":"https://palmsizedprompts.wordpress.com/2018/06/02/cinders/","outboundUrls":[],"wordCount":"223","dataFormat":"text","duplicateGroupId":"34207106702","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"1188"},"adultLanguage":"false","topics":[],"companies":[{"name":"Story-I Ltd","symbol":"SRY","exchange":"ASX","isin":"AU000000SRY9","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"E.M. Killaley","publishingPlatform":{"userId":"24138728"}},"licenses":[],"source":{"name":"Palm-Sized Press","homeUrl":"https://palmsizedprompts.wordpress.com","location":{"country":"United Kingdom","countryCode":"GB","region":"Europe","subregion":"Northern Europe"},"feed":{"id":"524668955","name":"Palm-Sized Press","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"82376937","generator":"http://wordpress.com/","description":"Indie Press and Online Flash Fiction Writing Community","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"9","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990168}