{"sequenceId":"845367329198","id":"34207263345","language":"English","title":"Use the Power of Thought","content":"We are the product of our thoughts provided we are standing away from the crowd and do not follow the herd. Our thoughts have no real value if we are part of the crowd. We all are tired of our grueling, mundane and laborious lives. Even when we are well aware that we are leading a meaningless life, we stick with it to avoid getting into a world of unpredictability. But occasionally our thoughts meander into areas which are exciting and thrilling. But as we want to be part of the crowd, we hush those thoughts. But such thoughts are powerful and they keep reminding us about our mundane life. We wash those thoughts away with alcohol or cover them up with the blanket of responsibilities. But these suppressed thoughts will explode one day. When we attempt to remain the same forever, we suffer. Therefore thoughts which are positive and offers a change should be welcomed. We should not shut them up. Self belief is necessary to follow your dreams. Use your thoughts to understand your motivations and triggers. Use thoughts to understand your own self. Believe in your passions, dreams, motivations and aspirations. Sometimes we have destructive thoughts. Most of them are a reaction to a particular situation. Such thoughts should be quelled. Such thoughts cause irreparable and irreversible physical and mental damage. There are both good and bad thoughts. Those thoughts that are unproductive, only give instant pleasure, and do not add value to our life are bad thoughts. Those thoughts that give meaningful direction to our life by providing happiness and satisfaction are positive thoughts. Spending sometime daily in channelizing our thoughts in the right direction is very much necessary especially when we are surrounded by social media and never-ending breaking news. Live and learn using your thoughts. Have some experience of your own. Do not go around seeking advice. It is worthwhile to take some risk in life. www.hindu-blog.com Abhilash","contentWithMarkup":"We are the product of our thoughts provided we are standing\naway from the crowd and do...<br/>\n<br/>\n[Visit original source www.hindu-blog.com to read the entire content and more such articles.]<img src=\"http://feeds.feedburner.com/~r/hindublog/~4/JRvOGFHFM7I\" height=\"1\" width=\"1\" alt=\"\"/>","tags":["Hindu Blogs","Quotes"],"publishedDate":"2018-06-02T21:38:06Z","harvestDate":"2018-06-02T22:00:19Z","estimatedPublishedDate":"2018-06-02T21:38:06Z","url":"http://ct.moreover.com/?a=34207263345&p=1u0&v=1&x=BQz_hX2CwEl595GUzwexVQ","originalUrl":"https://www.hindu-blog.com/2018/06/use-power-of-thought.html","outboundUrls":[],"wordCount":"324","dataFormat":"text","duplicateGroupId":"34207202810","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Abhilash Rajendran","publishingPlatform":{}},"licenses":[],"source":{"name":"Hindu Blog","homeUrl":"http://www.hindu-blog.com/","location":{"country":"India","countryCode":"IN","region":"Asia","subregion":"Southern Asia"},"feed":{"id":"27701959","name":"Hindu Blog","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"Hindu Spiritual and Religion Blog: Exploring Hinduism, the Sanatana Dharma","tags":["Quotes","Hindu Stories","Interesting Facts","Daily Hindu Calendar","Shiva","Hindu Temples","Hinduism","Hindu Goddess","Hindu Blogs","Ramayana","books","Hindu Rituals","Magh Month","Astrology","Bhagavad Gita","internet","Mahabharat","Prayers","Hindu Issues","Nakshatra","Tamil Nadu","India","Hanuman"],"imageUrl":"http://creativecommons.org/images/public/somerights20.gif","language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"27391","inboundLinkCount":"19"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994827}