{"sequenceId":"845365488687","id":"34207217892","language":"English","title":"How a bittersweet coming-of-age love story became the Light House's longest running film ever","content":"Just last week it became our longest running film so we're saying goodbye to it this Thursday night. We were thinking we should give a peach to everyone who attends. https://t.co/h5XZUf79Dw— Light House Cinema (@LightHouseD7) May 29, 2018 Source: Light House Cinema/Twitter A COMING-OF-age drama centred on a romance between the two lead male characters was set to have its last showing this week at Dublin’s Light House Cinema, after becoming its longest running film of all time. Call Me By Your Name first came to the Light House in October, and has been running at the cinema in Smithfield ever since, with at least one showing a week. Set in 1983, it tells the story of 17-year-old Elio (Timothée Chalamet) and the experience of his first love while spending the summer at his family’s holiday home in Italy. This love comes in the form of Oliver (Armie Hammer), a doctoral student hired to assist Elio’s father in his research. Their relationship develops but with a bittersweet edge in this coming-of-age drama. The film received critical acclaim and a number of award nominations, including nominations for best picture, best adapted screenplay and best actor for Chalamet at this year’s Academy Awards. Chalamet (left) and Hammer in the film Source: Sony Pictures Classics/Youtube But why has it so gripped Irish audiences that they kept coming to see the film week after week?   Charlene Lydon, programmer for the cinema, told TheJournal.ie that they was general awareness that they had a really good film on their hands, but didn’t believe it would do as well as it did. She said: “It’s been going on for 30 weeks now. We all had an instinct it’d do very well. It became clear once we were doing one or two shows during the week well into the New Year that it was something special. Lydon said that a community had developed around the film, and that staff at the cinema often see the same faces returning to see it again and again. “We also realised people were going to see it for the fifth or sixth time,” she said. “I know a lot of people thought it was good, but it really is a beautiful film experience. You’re watching people fall in love. Visually, it’s a nice space to be in… And so many different types of people come to see it. It’s obviously had a positive reaction in the LGBT community but it’s not just that. It’s a love story. Lydon added that the awful weather during the winter and early spring may have played a part in drawing more people into the cinema generally. The previous longest running film at the 10-year-old cinema had been Manchester By The Sea, which ran for weeks and months after its release at the end of 2016. That plot of this focuses on Lee Chandler (Casey Affleck), who becomes the guardian of his temperamental nephew Patrick, when his brother dies of a heart attack. That ran for 26 weeks and Lydon said a similar community grew up around that film. “We’d have it every Sunday at 10 o’clock,” she said. “We kept seeing the same people, and some even made friends with each other over the film. It was nice to see.” Looking ahead, it could be take time before a film eclipses Call Me By Your Name in terms of longevity on the cinema listings, but Lydon had a few recommendations if you’re heading to the cinema but steering clear of the blockbusters this summer. “There’s the new documentary about Alexander McQueen which is a fantastic watch,” she said. “There’s Dublin Oldschool coming out at the end of June, and then a lovely horror film called Hereditary out in the middle of the month.”","contentWithMarkup":"Call Me By Your Name was a hit with Irish audiences, running for 30 weeks in the Smithfield cinema.","tags":["timothee chalamet"],"publishedDate":"2018-06-02T20:15:38Z","harvestDate":"2018-06-02T21:50:42Z","estimatedPublishedDate":"2018-06-02T20:15:38Z","url":"http://ct.moreover.com/?a=34207217892&p=1u0&v=1&x=f21F2keaZGCuP4sk6Nn3iA","originalUrl":"http://www.thejournal.ie/call-me-by-your-name-4042534-Jun2018/?utm_source=shortlink","commentsUrl":"http://www.thejournal.ie/call-me-by-your-name-4042534-Jun2018/#comments","outboundUrls":["https://t.co/h5XZUf79Dw","https://twitter.com/LightHouseD7/status/1001426177339412480?ref_src=twsrc%5Etfw","https://twitter.com/LightHouseD7","https://www.youtube.com/watch?v=Z9AYPxH5NTM","https://t.co/h5XZUf79Dw&mdash;"],"wordCount":"620","dataFormat":"text","duplicateGroupId":"34206828106","media":{"audio":[],"images":[{"url":"http://c1.thejournal.ie/media/2018/05/call-me-by-your-name-2-230x150.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"Oliver Corp","symbol":"7959","exchange":"NGO","isin":"JP3200600009","titleCount":0,"contentCount":1,"primary":true}],"author":{"publishingPlatform":{}},"licenses":[],"source":{"name":"TheJournal.ie","homeUrl":"http://www.thejournal.ie/","location":{"country":"Ireland","countryCode":"IE","region":"Europe","subregion":"Northern Europe"},"feed":{"id":"155237192","name":"TheJournal.ie","mediaType":"Blog","publishingPlatform":"WordPress","generator":"http://wordpress.org/?v=3.0","description":"Ireland's Internet Newspaper","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"3","autoRankOrder":"9188","inboundLinkCount":"100"},"inWhiteList":"true","autoTopics":[]}},"es_id":86993721}