{"sequenceId":"845367306279","id":"34207262588","language":"English","title":"LeBron James Cracked A Bryan Colangelo Joke When Asked About A Dan Gilbert Twitter Thread","content":"The NBA has made it a point to be the most social media-friendly sports league in the United States. Of course, when the league made the decision to embrace social media, it almost certainly did not consider that a gigantic Twitter scandal involving the general manager of one of its teams would occur.  But unfortunately for the league, that has happened, as all eyes are on how the Philadelphia 76ers will handle the allegations that executive Bryan Colangelo (or, possibly, someone close to him) was using five burner Twitter accounts to smack talk players and other executives, share sensitive information, and much more.  It's been such a big story that even LeBron James, who is in the midst of his annual social media blackout for the postseason, is fully aware of what's going on. James was asked about a series of tweets Cavaliers owner Dan Gilbert sent prior Game 1 of the NBA Finals that praised everyone for getting to this point, and while he said he didn't see them, he couldn't help but make a Colangelo joke.   https://twitter.com/nbaontnt/status/1003016059643834368?s=21  So let's get the obvious out of the way: It is very good when superduperstar athletes remind everyone that no matter how famous you are, no one can resist a good dad joke, especially one that gives them the flexibility to do a fake rimshot.   But digging deeper, this is kind of fascinating, as the Sixers are one of the teams that are viewed as a contender to acquire James if he becomes a free agent this summer. There was one report that \"at least one high-ranking Sixers official is fighting to save Colangelo’s job,\" but if the team wants to acquire James' services, does this kind of imply they can't do that and keep their embattled general manager around?  Reports indicate a decision will be made in Philly sometime soon, but that's more of a subplot here. What is far more apparent is that LeBron James is quite the jokester, even as his team is facing a 1-0 series deficit in the NBA Finals.","contentWithMarkup":"<!--pagetitle:-->\n\n\nThe NBA has made it a point to be the most social media-friendly sports league in the United States. Of course, when the league made the decision to embrace social media, it almost certainly did not consider that a gigantic Twitter scandal involving the general manager of one of its teams would occur.\n\nBut unfortunately for the league, that has happened, as all eyes are on how the Philadelphia 76ers will handle the allegations that executive Bryan Colangelo (or, possibly, someone close to him) was using five burner Twitter accounts to smack talk players and other executives, share sensitive information, and much more.\n\nIt's been such a big story that even LeBron James, who is in the midst of his annual social media blackout for the postseason, is fully aware of what's going on. James was asked about a series of tweets Cavaliers owner Dan Gilbert sent prior Game 1 of the NBA Finals that praised everyone for getting to this point, and while he said he didn't see them, he couldn't help but make a Colangelo joke.\n<!--pagetitle:-->\n\nhttps://twitter.com/nbaontnt/status/1003016059643834368?s=21\n\nSo let's get the obvious out of the way: It is very good when superduperstar athletes remind everyone that no matter how famous you are, no one can resist a good dad joke, especially one that gives them the flexibility to do a fake rimshot. \n\nBut digging deeper, this is kind of fascinating, as the Sixers are one of the teams that are viewed as a contender to acquire James if he becomes a free agent this summer. <a href=\"https://www.usatoday.com/story/sports/nba/2018/06/01/wife-76-ers-bryan-colangelo-could-behind-twitter-accounts/665037002/\" target=\"_blank\">There was one report</a> that \"at least one high-ranking Sixers official is fighting to save Colangelo’s job,\" but if the team wants to acquire James' services, does this kind of imply they can't do that and keep their embattled general manager around?\n\nReports indicate a decision <a href=\"https://uproxx.com/dimemag/sixers-bryan-colangelo-future-twenty-four-hours/\" target=\"_blank\">will be made in Philly sometime soon</a>, but that's more of a subplot here. What is far more apparent is that LeBron James is quite the jokester, even as his team is facing a 1-0 series deficit in the NBA Finals.","tags":["DimeMag","Home Page","Sports","2018 NBA Playoffs","Bryan Colangelo","CLEVELAND CAVALIERS","DAN GILBERT","LeBron James","PHILADELPHIA 76ERS"],"publishedDate":"2018-06-02T22:00:00Z","harvestDate":"2018-06-02T22:00:08Z","estimatedPublishedDate":"2018-06-02T22:00:00Z","url":"http://ct.moreover.com/?a=34207262588&p=1u0&v=1&x=n7b47qaETIPVBzhBth8k8Q","originalUrl":"http://uproxx.com/dimemag/lebron-james-bryan-colangelo-joke-video-dan-gilbert/","outboundUrls":["https://www.usatoday.com/story/sports/nba/2018/06/01/wife-76-ers-bryan-colangelo-could-behind-twitter-accounts/665037002/","https://twitter.com/nbaontnt/status/1003016059643834368?s=21"],"wordCount":"342","dataFormat":"text","duplicateGroupId":"34207262588","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"401315186"},"adultLanguage":"false","topics":[{"name":"Blogging news","group":"Internet"}],"companies":[],"author":{"name":"Bill DiFilippo","publishingPlatform":{"userId":"61098018"}},"licenses":[],"source":{"name":"UPROXX","homeUrl":"http://uproxx.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"444032561","name":"UPROXX","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"60970621","generator":"http://wordpress.com/","description":"The Culture Of Now","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"3","autoRankOrder":"7956","inboundLinkCount":"123"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994792}