{"sequenceId":"845362377985","id":"34207117479","language":"English","title":"Pan-seared Tofu with Creamy Yogurt-chard Sauce","content":"Ingredients  350 g package extra-firm tofu 2 tsp garam masala, divided 1/2 tsp salt, divided 1/4 tsp black pepper 1 bunch Swiss chard 1 Tbsp + 2 tsp grapeseed or sunflower oil 1 medium yellow onion, chopped 3 garlic cloves, minced 2 Tbsp finely chopped ginger 1 tsp cumin seeds 1 tsp mustard seeds 1/2 tsp turmeric 1/4 tsp crushed red pepper flakes 3/4 cup plain Greek yogurt 1/4 cup half-and-half cream 1 Tbsp fresh lemon juice 1/2 cup sliced roasted almonds  Method  Line cutting board with a couple sheets of paper towel. Top with tofu, a couple more sheets of towel, and another cutting board. Press to extract excess liquid. Slice tofu into 3/4 in blocks and toss with 1 tsp garam masala, 1/4 tsp salt, and black pepper. Slice off stems from chard leaves and thinly slice stems. Roughly chop chard leaves and then soak them in large bowl of cool water, swishing to loosen any grit clinging to them. Drain and squeeze out excess water, or use a salad spinner to remove excess water. Chop greens into smaller pieces. In large skillet over medium-high, heat 1 Tbsp oil. Add tofu and cook, tossing the cubes occasionally, until golden brown all over, about 8 minutes. Remove tofu from pan and set aside. Heat remaining 2 tsp oil in pan. Add onion, chard stems, and 1/4 tsp salt. Cook until onion has softened and browned, about 5 minutes. Add garlic and ginger to pan. Cook for 2 minutes. Add 1 tsp garam masala, cumin seeds, mustard seeds, turmeric, and red pepper flakes in pan. Cook for 30 seconds. Add chopped chard leaves in batches and cook, stirring often, until wilted, about 2 minutes. Remove pan from heat and let cool for about 2 minutes. Stir in yogurt, 1/4 cup at a time, and then stir in cream. Gently stir in tofu and lemon juice. Serve topped with almonds.   Makes 4 servings.  Source: Alive magazine","contentWithMarkup":"<img src=\"http://cookwithkathy.files.wordpress.com/2018/06/c02531.jpg\"/>\n\n<b>Ingredients</b>\n<img src=\"http://cookwithkathy.files.wordpress.com/2012/01/clip.jpg\" align=\"right\"/>\n350 g package extra-firm tofu\n2 tsp garam masala, divided\n1/2 tsp salt, divided\n1/4 tsp black pepper\n1 bunch Swiss chard\n1 Tbsp + 2 tsp grapeseed or sunflower oil\n1 medium yellow onion, chopped\n3 garlic cloves, minced\n2 Tbsp finely chopped ginger\n1 tsp cumin seeds\n1 tsp mustard seeds\n1/2 tsp turmeric\n1/4 tsp crushed red pepper flakes\n3/4 cup plain Greek yogurt\n1/4 cup half-and-half cream\n1 Tbsp fresh lemon juice\n1/2 cup sliced roasted almonds\n\n<b>Method</b>\n<ol>\n<li>Line cutting board with a couple sheets of paper towel. Top with tofu, a couple more sheets of towel, and another cutting board. Press to extract excess liquid. Slice tofu into 3/4 in blocks and toss with 1 tsp garam masala, 1/4 tsp salt, and black pepper.\n</li><li>Slice off stems from chard leaves and thinly slice stems. Roughly chop chard leaves and then soak them in large bowl of cool water, swishing to loosen any grit clinging to them. Drain and squeeze out excess water, or use a salad spinner to remove excess water. Chop greens into smaller pieces.\n</li><li>In large skillet over medium-high, heat 1 Tbsp oil. Add tofu and cook, tossing the cubes occasionally, until golden brown all over, about 8 minutes. Remove tofu from pan and set aside.\n</li><li>Heat remaining 2 tsp oil in pan. Add onion, chard stems, and 1/4 tsp salt. Cook until onion has softened and browned, about 5 minutes.\n</li><li>Add garlic and ginger to pan. Cook for 2 minutes.\n</li><li>Add 1 tsp garam masala, cumin seeds, mustard seeds, turmeric, and red pepper flakes in pan. Cook for 30 seconds. Add chopped chard leaves in batches and cook, stirring often, until wilted, about 2 minutes.\n</li><li>Remove pan from heat and let cool for about 2 minutes. Stir in yogurt, 1/4 cup at a time, and then stir in cream. Gently stir in tofu and lemon juice. Serve topped with almonds.\n</li></ol>\n\nMakes 4 servings.\n\n<i>Source: Alive magazine</i>","tags":["Dairy","Herb","Nut","Recipe Clipping","Tofu","Vegetable"],"publishedDate":"2018-06-02T21:25:43Z","harvestDate":"2018-06-02T21:25:55Z","estimatedPublishedDate":"2018-06-02T21:25:43Z","url":"http://ct.moreover.com/?a=34207117479&p=1u0&v=1&x=Mghz7Vz8Na1A2ZsdymbnCg","originalUrl":"https://cookwithkathy.wordpress.com/2018/06/02/c02531/","outboundUrls":[],"wordCount":"291","dataFormat":"text","duplicateGroupId":"34207117479","media":{"audio":[],"images":[{"url":"http://cookwithkathy.files.wordpress.com/2018/06/c02531.jpg"},{"url":"http://cookwithkathy.files.wordpress.com/2012/01/clip.jpg"}],"video":[],"logo":[]},"publishingPlatform":{"itemId":"54582"},"adultLanguage":"false","topics":[],"companies":[{"name":"Nokwon Commercials & Industries Inc","symbol":"065560","exchange":"KRX","isin":"KR7065560005","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"cookwithkathy","publishingPlatform":{"userId":"8074765"}},"licenses":[],"source":{"name":"Cooking with Kathy Man","homeUrl":"https://cookwithkathy.wordpress.com","location":{},"feed":{"id":"96312110","name":"Cooking with Kathy Man","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"7778613","generator":"http://wordpress.com/","description":"Celebrating delicious and healthy food","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":["ugc food feeds","ugc health feeds"]}},"es_id":86990572}