{"sequenceId":"845362000195","id":"34207104222","language":"English","title":"NBC’s Chuck Todd blames President Trump for comedian Samantha Bee’s vile comment on first daughter","content":"NBC host Chuck Todd claims President Donald Trump is partly responsible for the attack by comedian Samantha Bee on the first daughter. Todd said Ivanka Trump can partially thank her father in Bee’s comment that she is “feckless c***.” There is no defending Bee’s comment, Todd said Thursday on MSNBC’s “Meet the Press Daily.” Then he said Trump played a role in Bee’s comment. “You can’t help and say it starts at the top. He regularly berates and mocks the looks of any of us,” Todd said. Trump has long called the TV host “Sleepy-Eyed Chuck Todd.” “There’s no defending Samantha Bee and yet it’s hard to ever empathize with President Trump when they’re asking, you know, for empathy since he torches people all the time too,” Todd explained. He continued: “But at the end of the day, I mean, you know, it’s like, how is it that the president is not responsible for this tone? You know, you can’t help and say it starts at the top. He regularly berates and mocks the looks of any of us. I’ve been one. And so when he expresses, I can’t believe they said that about me, it’s hard to feel sorry for him.” Only Trump is allowed to cross these kinds of lines, Todd said, adding: It is interesting to me. Everybody else in our society has been punished for things Donald Trump doesn’t get punished for. Roseanne Barr, he has said statements that many people have found racist, he hasn’t paid a price. Roseanne Barr has paid a price. He’s used vile, awful, ugly language, he didn’t pay a price. Samantha Bee is paying a price. Everybody else pays a price for the same behavior, not him. Every time we have a culture war fight, the president smiles, doesn’t he? Like, at the end of the day, it doesn’t matter. On Thursday, Bee issued an apology, calling her remarks about the first daughter “inappropriate and inexcusable.”I would like to sincerely apologize to Ivanka Trump and to my viewers for using an expletive on my show to describe her last night. It was inappropriate and inexcusable. I crossed a line, and I deeply regret it. — Samantha Bee (@iamsambee) May 31, 2018    via TheBlaze https://ift.tt/2HhyfwI","contentWithMarkup":"<p>NBC host Chuck Todd claims President Donald Trump is partly responsible for the attack by comedian Samantha Bee on the first daughter.</p><p>Todd said Ivanka Trump can partially thank her father in Bee’s comment that she is “feckless c***.”</p><p>There is no defending Bee’s comment, Todd said Thursday on MSNBC’s “Meet the Press Daily.” Then he said Trump played a role in Bee’s comment.</p><p>“You can’t help and say it starts at the top. He regularly berates and mocks the looks of any of us,” Todd said.</p><p>Trump has long called the TV host “Sleepy-Eyed Chuck Todd.”</p><p>“There’s no defending Samantha Bee and yet it’s hard to ever empathize with President Trump when they’re asking, you know, for empathy since he torches people all the time too,” Todd explained.</p><p>He continued: “But at the end of the day, I mean, you know, it’s like, how is it that the president is not responsible for this tone? You know, you can’t help and say it starts at the top. He regularly berates and mocks the looks of any of us. I’ve been one. And so when he expresses, I can’t believe they said that about me, it’s hard to feel sorry for him.”</p><p>Only Trump is allowed to cross these kinds of lines, Todd said, adding:</p><blockquote><p>It is interesting to me. Everybody else in our society has been punished for things Donald Trump doesn’t get punished for. Roseanne Barr, he has said statements that many people have found racist, he hasn’t paid a price. Roseanne Barr has paid a price.</p><p>He’s used vile, awful, ugly language, he didn’t pay a price. Samantha Bee is paying a price. Everybody else pays a price for the same behavior, not him. Every time we have a culture war fight, the president smiles, doesn’t he? Like, at the end of the day, it doesn’t matter.</p></blockquote><p>On Thursday, Bee issued an apology, calling her remarks about the first daughter “inappropriate and inexcusable.”</p><blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\" xml:lang=\"en\">I would like to sincerely apologize to Ivanka Trump and to my viewers for using an expletive on my show to describe her last night. It was inappropriate and inexcusable. I crossed a line, and I deeply regret it.</p><p>— Samantha Bee (@iamsambee) <a href=\"https://twitter.com/iamsambee/status/1002252496532856832?ref_src=twsrc%5Etfw\">May 31, 2018</a></p></blockquote><p><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\" type=\"text/javascript\"></script></p><p><iframe title=\"MRC TV video player\" width=\"650\" height=\"366\" src=\"https://www.mrctv.org/embed/530233\" frameborder=\"0\" allowfullscreen=\"\"></iframe></p><br /><br />via TheBlaze https://ift.tt/2HhyfwI","tags":["IFTTT","TheBlaze"],"publishedDate":"2018-06-02T15:08:24Z","harvestDate":"2018-06-02T21:22:35Z","estimatedPublishedDate":"2018-06-02T15:08:24Z","url":"http://ct.moreover.com/?a=34207104222&p=1u0&v=1&x=miwU8wWLqm95SsV2OI-SKQ","originalUrl":"http://theirontimes.blogspot.com/2018/06/nbcs-chuck-todd-blames-president-trump.html","commentsUrl":"http://theirontimes.blogspot.com/2018/06/nbcs-chuck-todd-blames-president-trump.html#comment-form","outboundUrls":["https://twitter.com/iamsambee/status/1002252496532856832?ref_src=twsrc%5Etfw","https://ift.tt/2HhyfwI"],"wordCount":"371","dataFormat":"text","duplicateGroupId":"34205430425","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Television industry news","group":"Media"}],"companies":[],"author":{"name":"Vince Wylde","publishingPlatform":{}},"licenses":[],"source":{"name":"The Iron Times","homeUrl":"http://theirontimes.blogspot.com/","location":{},"feed":{"id":"372465404","name":"The Iron Times","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","tags":["IFTTT","TheBlaze","Breaking News","OneNewsNow.com Front Page Stories","TheBlaze.com - Blog","Poor Richard's News","Poor Richards News","Poor Richard's News  RSS Feed","TheBlaze.com","Obamacare","Affordable Healthcare","Liberalism","Obama","Terrorism","Democrats","Extremism","Extremist I"],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990066}