{"sequenceId":"845367343171","id":"34207263842","language":"English","title":"Social Innovation to Help Refugees","content":"Facebook Twitter Google+ Pinterest Print or Email Read in: Español “We’re seeing what happens when you have a network and an infrastructure of a global institution, brought together by shared faith and values, that is able to respond to a problem that’s global in scale.”  NCR national correspondent Heidi Schlumpf highlights how some of our Vincentian Family is using Catholic Social Innovation to address the refugee crisis: Catholic social innovation tends to repurpose existing resources and draw on existing relationships to address issues such as the refugee crisis, the study found. Innovative Catholic programs also are inspired by Catholic social teaching, according to the report, which highlighted 64 projects, more than half of which are affiliated with Catholic sisters. One is the training and skills centers run by the Daughters of Charity of St. Vincent de Paul in Tunisia. Many African and Middle Eastern migrants trying to make their way to Europe have gotten stranded in Tunisia, located in the northernmost point in Africa. Without marketable skills, they often turn to exploitative illegal work, said Sr. Mary Louise Stubbs, executive director of the order’s International Project Services, which provides development assistance to sisters working in 64 countries. Local Daughters of Charity were already providing emergency assistance in Tunisia, but realized the migrants needed to learn skills that could provide income to support their families. So, in addition to offering medical care and children’s education, the sisters started providing training in tailoring, welding, hairdressing, shoe repair, bread making and computer work for adults. Dearing (Tiziana Dearing, co-director of Boston College’s Center for Social Innovation and the lead researcher for “Catholic Social Innovation in Today’s Global Refugee Crisis.”) said the training program illustrates two trends in innovative service to refugees: an emphasis on self-sufficiency and what’s called a “two-gen” approach that addresses entire families. But its innovation goes beyond that. When Stubbs learned that the Ladies of Charity, an associate group to the Daughters of Charity, was looking for new ways to fundraise for their charity work, she remembered the beautiful backpack made by one of the refugees in the Tunisian training program. Stubbs helped set up a collaboration to create the “Mission Marketplace,” in which the Ladies of Charity will purchase in bulk items made by the refugees in Tunisia for resale in the United States. “Innovation could be our middle name,” said Stubbs, noting that the Daughters of Charity have had to be creative since their founding in the 17th century. Dearing agrees that sisters, as well as priests and brothers, were some of the earliest social innovators. “We have a long history of nuns starting hospitals, orphanages, schools and other services. They’ve always been at the forefront of transformational social justice,” she said. Other projects highlighted in the report feature similar collaboration, long-term focus and creative repurposing of existing relationships or resources: In Pennsylvania, Sisters of Charity of Nazareth moved out of their home and consolidated with other sisters so the building could be used as a transitional facility for resettled refugees, repurposing an existing resource and demonstrating what Dearing called “radical hospitality.” In Australia, 155 religious orders of sisters, brothers and priests collaborated to prevent human trafficking of refugees and others as part of the Australian Catholic Religious Against Trafficking in Humans, or ACRATH. In Bolivia and Chile, the Sisters of the Good Shepherd addressed a root cause of migration by providing job training for women at risk for becoming migrants. All the women found jobs, preventing more than half of them from having to leave. “We’re seeing what happens when you have a network and an infrastructure of a global institution, brought together by shared faith and values, that is able to respond to a problem that’s global in scale,” Dearing said. This report is the first in the three-year project. FADICA (Foundations and Donors Interested in Catholic Activities) members, who chose refugees as the topic for the first year, will vote on the next issue to be studied, said Alexia Kelley, FADICA’s president and CEO. Within our Vincentian Family branches, are there any existing social innovation programs that need to be shared with the rest of our family? Are there any ways this idea can be applied to our homelessness initiative? Source: National Catholic Reporter Related Tags: refugees","contentWithMarkup":"Catholic social innovation tends to repurpose existing resources and draw on existing relationships to address issues such as the refugee crisis,<br/>\n<br/>\nThis is a summary only. Click on the Title to read the entire article.<div class=\"feedflare\">\n<a href=\"http://feeds.feedburner.com/~ff/FamvinEnglish?a=fMgncT_KW-U:4WBoAX9K1lg:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/FamvinEnglish?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/FamvinEnglish?a=fMgncT_KW-U:4WBoAX9K1lg:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/FamvinEnglish?i=fMgncT_KW-U:4WBoAX9K1lg:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/FamvinEnglish?a=fMgncT_KW-U:4WBoAX9K1lg:DN0H40_Ym5U\"><img src=\"http://feeds.feedburner.com/~ff/FamvinEnglish?d=DN0H40_Ym5U\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/FamvinEnglish?a=fMgncT_KW-U:4WBoAX9K1lg:V-t1I-SPZMU\"><img src=\"http://feeds.feedburner.com/~ff/FamvinEnglish?d=V-t1I-SPZMU\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/FamvinEnglish/~4/fMgncT_KW-U\" height=\"1\" width=\"1\" alt=\"\"/>","tags":["Formation","Reflections","refugees"],"publishedDate":"2018-06-02T21:00:23Z","harvestDate":"2018-06-02T22:00:26Z","estimatedPublishedDate":"2018-06-02T21:00:23Z","url":"http://ct.moreover.com/?a=34207263842&p=1u0&v=1&x=2i_mNI6cQ6BadOqX2EBCkw","originalUrl":"https://famvin.org/en/2018/06/02/social-innovation-to-help-refugees/","commentsUrl":"https://famvin.org/en/2018/06/02/social-innovation-to-help-refugees/#respond","outboundUrls":["http://www.facebook.com/sharer.php?u=https%3A%2F%2Ffamvin.org%2Fen%2F2018%2F06%2F02%2Fsocial-innovation-to-help-refugees%2F&#038;t=Social%20Innovation%20to%20Help%20Refugees","http://twitter.com/share?text=Social%20Innovation%20to%20Help%20Refugees&#038;url=https%3A%2F%2Ffamvin.org%2Fen%2F2018%2F06%2F02%2Fsocial-innovation-to-help-refugees%2F&#038;via=famvin","https://plus.google.com/share?url=https%3A%2F%2Ffamvin.org%2Fen%2F2018%2F06%2F02%2Fsocial-innovation-to-help-refugees%2F&#038;t=Social%20Innovation%20to%20Help%20Refugees","http://www.printfriendly.com/print?url=https%3A%2F%2Ffamvin.org%2Fen%2F2018%2F06%2F02%2Fsocial-innovation-to-help-refugees%2F&#038;title=Social%20Innovation%20to%20Help%20Refugees","https://www.fadica.org/images/resources/FADICA_Catholic%20Social%20Innovation_Refugee%20Crisis_Executive%20Summary_3.30.18.pdf","https://www.fadica.org/","https://www.ncronline.org/news/people/catholic-groups-seek-social-innovation-help-refugees","http://feeds.feedburner.com/~ff/FamvinEnglish?a=fMgncT_KW-U:4WBoAX9K1lg:yIl2AUoC8zA","http://feeds.feedburner.com/~ff/FamvinEnglish?a=fMgncT_KW-U:4WBoAX9K1lg:F7zBnMyn0Lo","http://feeds.feedburner.com/~ff/FamvinEnglish?a=fMgncT_KW-U:4WBoAX9K1lg:DN0H40_Ym5U","http://feeds.feedburner.com/~ff/FamvinEnglish?a=fMgncT_KW-U:4WBoAX9K1lg:V-t1I-SPZMU"],"wordCount":"709","dataFormat":"text","duplicateGroupId":"34207263842","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Matt &#38; Elizabeth Astridge","publishingPlatform":{}},"licenses":[],"source":{"name":"FAMVIN NewsEN","homeUrl":"https://famvin.org/en","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"79435473","name":"FAMVIN NewsEN","mediaType":"Blog","publishingPlatform":"WordPress","generator":"https://wordpress.org/?v=4.7.2","description":"Seeing Christ in the face of the poor","tags":[],"imageUrl":"http://famvin.org/en/wp-content/uploads/2008/04/logo-idea.jpg","language":"English","dataFormat":"text","rank":{"autoRank":"4","autoRankOrder":"22522","inboundLinkCount":"26"},"inWhiteList":"true","autoTopics":["ugc technology feeds"]}},"es_id":86994858}