{"sequenceId":"845367069390","id":"34207256393","language":"English","title":"PRESIDENT TRUMP KNOWS ACCURATE HISTORY - Q WANTS YOU TO KNOW...","content":"The New World Order Cabal fears what Trump will do with his knowledge of real events.   The evil haters of humanity that head the cabal that hides in the swamp will stop at nothing to win. The game has been played since the garden of Eden, and is now in its final episode on the world stage. Many have tried to expose them only to be labeled crazy, tin foil hat or killed by henchmen of the same cabal who will stop at nothing to complete their world disorder. Many homicides have been declared accidents, while most have been cloaked in a vast darkness of suicide names.  Today, people are opening their eyes and a mysterious \"Q\" is showing many how to be and investigative reporter and others simply learning how to see through the cabals evil veil.  The following excerpt is from Investigative Reporter - Don Nicoloff, regarding  past President, George Bush Senior, of who Nicoloff has proof, was actually George Sherf Jr., changed to Sherff with two \"f's\" upon coming to America to avoid  being easily traced in background checks, as his German name is spelled with one \"f\".  Later after WWII, George was paper-clipped to be George W Bush Senior. Yes, he worked for Hitler and supported the NAZI party.  (Whew, that was a mouth full.  In summary - A BUSH is a shrub you can hide behind on the grassy knoll, not the real name of a past president.)    GEORGE HERBERT SHERF II/ GEORGE HERBERT WALKER BUSH, to his dismay, also appears in a photograph taken at the Texas School Book Depository, Dallas, Texas, on November 22, 1963, after the assassination of President John F. Kennedy. Despite his admitted “failure to recall his whereabouts” on that fateful day, he (as an agent with the CIA) was debriefed by FBI Director J. Edgar Hoover the following day.     In 1993, a little-known document surfaced which described, not only this debriefing, but GHSII/GHWB involvement with the CIA as early as 1960 (Recall Skorzeny’s statement in 1999 that he co-founded the CIA with “George H.W. Bush” at the end of WW II). Incredibly, another “George Bush” who worked at the CIA caused the “confusion,” so GHSII/GHWB escaped suspicion as a participant in the assassination. Again, when the JFK assassination topic resurfaced in the Nixon Watergate tapes from 1974, there was a recorded discussion referring to “photographs” that would have implicated the CIA and GHSII/GHWB.   GHSII/GHWB, who had worked on Nixon’s election campaign, had also made a telephone call to the Houston office of the FBI, after the assassination, attempting to frame a James Parrott, “possibly a student at the University of Houston,” by stating that “one James Parrott has been talking of killing the President when he comes to Houston.” GHSII/GHWB then gave the FBI the names of two Harris County Republican Party Headquarters staffers, a “Mrs. Farley” and “Arlene Smith,” as two sources of “additional information regarding the identity of Parrot.”    Here we have three individuals with information regarding the potential assassination of JFK, who knew about this “fact” weeks before the assassination—and the FBI was not notified until hours after the event? From this perspective, GHSII/GHWB’s inability to recall where he was the day JFK was assassinated is not believable (doesn’t everyone recall where they were the day JFK was assassinated?)  GHSII/GHWB apparently forgave Parrott sometime later when Parrott worked on GHSII/GHWB’s presidential campaign when he ran against Bill Clinton in 1992. The FBI document speaks for itself, as does the photo taken in front of the book depository. Similar to the dropping of \"Trading With the Enemy Act\" charges against GHSI/PSB In 1942, this is yet another example of a federal “investigation” involving a member of the “Scherf” clan, designed to give the illusion that the agency was “doing its homework.” These facts also support the contention that both the FBI and the CIA are controlled by entities capable of “taking out” anyone—including a sitting president in broad daylight with thousands of witnesses—who fails to conform to the “master plan.” President Kennedy had announced his intention to dissolve the Federal Reserve, dismantle the CIA and bust organized crime; President Kennedy was a major threat to the master plan. Prior to GHSII/GHWB’s meteoric rise in politics, it can be assumed he supervised the drug smuggling operations from the Far East. Numerous accounts from soldiers, military advisors and intelligence officers place him in close proximity to covert operations serving generating seed money for assassinations, the overthrow of foreign governments and to fund secret black-ops programs.     [gallery ids=\"47464,47463\" type=\"rectangular\"] GHSII/GHWB, still using his \"Bush\" alias, ran for public office in Texas, obtaining a seat in the House of Representatives from 1967-1971.  Less than two months after the resignation of President Richard Nixon, GHSII/GHWB, then Chairman of the Republican National Committee (RNC), was quickly ushered from public scrutiny and appointed Chief of the Liaison Office in Beijing, China, a position he held until Pearl Harbor Day, 1975. He was then promoted to Director of the CIA, the agency for which GHSII/GHWB claims “he had never worked.” GHSII/GHWB was CIA director from January 30, 1976 through January 20, 1977, or a total of 355 days. Not unlike his stint in Asia during the war in Vietnam, his presence in China probably involved drug smuggling and had little to do with diplomatic relations, outside of drug payoffs, assassinations and money laundering. His return to the U.S. was rewarded with a chairmanship at the First International Bank of Houston, a probable destination for illicit Asian profits.   In 1981, GHSII/GHWB became the vice-President under President Ronald Reagan and knew of the massive funds gathered by Ambassador Leo Emil Wanta’s Ameritrust Groupe, Inc., under the direction of President Reagan, during the financial implosion of the Soviet Union in the late-1980s. GHSII/GHWB then became the 41st president in 1989. During his presidency, President Scherf... er, uh... (aka) President George H.W. Bush, traveled to Hong Kong, demanding trillions of dollars from Wanta and his Chinese partner, Howe Kwong-Kok.  https://www.youtube.com/watch?v=DlikNveCUaQ Howe died of poisoning 10 days later, due to their refusal to turn over the money (amassed under Presidential Order 12333) which was slated to be returned to the U.S. Treasury. Today in 2007, the $4.5 trillion tagged settlement funds are currently being used as a financial ping-pong ball in money laundering, Ponzi schemes, derivatives, trusts, pension funds, and offshore accounts, with Bank of America, Wachovia Bank, CitiBank Group, JPMorganChase, Goldman Sachs and Co., Bank of Nova Scotia, Chemical Bank, First Union Bank, banks in Germany, Spain, Holland, England, Grenada, North Vietnam, India, U.S. Treasury Secretary Henry M. Paulson, Department of Homeland Security Secretary Michael Chertoff, a host of Cabinet members, former President Bill Clinton, Senator Hillary Clinton, Vice-President Richard Cheney and President George W. Bush taking turns holding the paddle.    Conclusions Based upon the “deathbed confession” of Hitler’s bodyguard and master spy/assassin Otto Skorzeny, we were given a clue that George Herbert Walker Bush and his father Prescott Sheldon Bush were not who they pretended to be. By following the clue, we found other clues that began to support the claims of Skorzeny: That PSB is really GHSI and GHWB is really GHSII. The result of this connect-the-dots research campaign is that the “master plan” for world domination has been exposed beyond a reasonable doubt. Much more can now be researched and written since the master planners are no longer able to hide In the fictitious realms of their propagandized history books and family biographies. When will those who are “sworn to uphold the law” do so? When will our so-called American patriots finally find the backbone to confront these realities and demand an end to this madness? Whether we realize it or not, the world is watching, America. What we decide to do about these issues will not only determine our fate, but the fate of the rest of the world. Are we to be led, like sheep, to our slaughter? Or will we finally wake up, get mad, and say, “Enough is enough!” - Don Nicoloff.    According to Otto Skorzeny, pictured is the Scherff family and a few friends (circa 1938). Holding “Mother\" Scherff’s hand at left is Martin Bormann. In front is Reinhardt Gehlen. In back is Joseph Mengele and to his right is Skorzeny as a young man. At center right (in the German navy uniform) is George H. Scherff, Jr. and his father George H. Scherff, Sr. Bormann became Hitler’s second in command. Reinhardt Gehlen was a chief SS officer and assassin who was smuggled out of Germany under Operation Paperclip. Skorzeny was Hitler's bodyguard and SS spy/assassin who came to the U.S. after the war under Project Paperclip. Skorzeny and GHW Bush were instrumental in merging Nazi (SS) intelligence with the OSI to form the CIA with \"Wild Bill\" Donovan and Allen Dulles. These guys were also part of CIA mind control experiments such as MK-ULTRA. SS officer and physician Joseph Mengele, the notoriously sadistic “Angel of Death” of Auschwitz, escaped Germany to South America.  After the war. George H. Scherff, Jr., became the 41st President of the United States as GHW Bush and George H. Scherff, Sr. (the same man), was Nicola Tesla’s “trusted assistant.”  Also known in the famous cartoon strip of the time as \"Curious George\" representing Tesla as the professor, and George Sherff, Jr. as the monkey.  Tesla would always catch him monkeying around in his lab and nicknamed him \"Curious George\".  Now, you know President Trump's uncle worked with Tesla and knew all about this and now you know why Mr. Trump when running for President told crowds of people at his political rallies that his Uncle was a inventive genius and knew Tesla, and when Tesla died, his uncle was called in to gather his documents and interpret them.  He was letting the Bush family and his usurped circle of clansmen know he knew everything.  https://www.youtube.com/watch?v=UQpSdKxd5bg  Information given to the masses by the \"Q\" is not coming from the evil order that want to rule the world and destroy all righteous people.  It is not coming from those who are hiding true history.  It is coming from \"Q\" source that is here to open your eyes to the lies and rewritten history designed to keep you asleep, while they slowly kill us all off.  As our dear Lord told the disciples, \"And if Satan cast out Satan, he is divided against himself; how shall then his kingdom stand?\"  But, Satan would divide the house of the truth seekers.  That makes more sense now doesn't it?  Dianne  COMPLETE ARTICLE: Click Here to Read \"Deathbed confessions, photos support claims that George H. Scherf(f), Jr., was the 41st U.S. president\"","contentWithMarkup":"<h1>The New World Order Cabal fears what Trump will do with his knowledge of real events.</h1>\n<img class=\"alignnone size-full wp-image-47459\" src=\"https://themarshallreport.files.wordpress.com/2018/06/trump1_opener-superjumbo.jpg\" alt=\"trump1_opener-superJumbo\" width=\"2048\" height=\"1365\" />\n\nThe evil haters of humanity that head the cabal that hides in the swamp will stop at nothing to win. The game has been played since the garden of Eden, and is now in its final episode on the world stage. Many have tried to expose them only to be labeled crazy, tin foil hat or killed by henchmen of the same cabal who will stop at nothing to complete their world disorder. Many homicides have been declared accidents, while most have been cloaked in a vast darkness of suicide names.  Today, people are opening their eyes and a mysterious \"Q\" is showing many how to be and investigative reporter and others simply learning how to see through the cabals evil veil.\n\nThe following <strong>excerpt</strong> is from Investigative Reporter - <strong>Don Nicoloff</strong>, regarding  past President, George Bush Senior, of who Nicoloff has proof, was actually George Sherf Jr., changed to Sherff with two \"f's\" upon coming to America to avoid  being easily traced in background checks, as his German name is spelled with one \"f\".  Later after WWII, George was paper-clipped to be George W Bush Senior. Yes, he worked for Hitler and supported the NAZI party.  (Whew, that was a mouth full.  In summary - A BUSH is a shrub you can hide behind on the grassy knoll, not the real name of a past president.)\n\n<img class=\"alignnone size-full wp-image-47450\" src=\"https://themarshallreport.files.wordpress.com/2018/06/bushbunchlittlenoses.jpg\" alt=\"bushBunchlittlenoses\" width=\"400\" height=\"308\" />\n\nGEORGE HERBERT SHERF II/ GEORGE HERBERT WALKER BUSH, to his dismay, also appears in a photograph taken at the Texas School Book Depository, Dallas, Texas, on November 22, 1963, after the assassination of President John F. Kennedy. Despite his <img class=\" size-full wp-image-47462 alignright\" src=\"https://themarshallreport.files.wordpress.com/2018/06/bushjfk-photo-george-h-w-bush-at-tsbd-1-1.jpg\" alt=\"bushJFK-photo-GEORGE-H-W-BUSH-at-TSBD-1-1\" width=\"367\" height=\"505\" />admitted “failure to recall his whereabouts” on that fateful day, he (as an agent with the CIA) was debriefed by FBI Director J. Edgar Hoover the following day.\n\n \n\nIn 1993, a little-known document surfaced which described, not only this debriefing, but GHSII/GHWB involvement with the CIA as early as 1960 (Recall Skorzeny’s statement in 1999 that he co-founded the CIA with “George H.W. Bush” at the end of WW II). Incredibly, another “George Bush” who worked at the CIA caused the “confusion,” so GHSII/GHWB escaped suspicion as a participant in the assassination.\nAgain, when the JFK assassination topic resurfaced in the Nixon Watergate tapes from 1974, there was a recorded discussion referring to “photographs” that would have implicated the CIA and GHSII/GHWB.\n\n<img class=\" size-full wp-image-47455 alignleft\" src=\"https://themarshallreport.files.wordpress.com/2018/06/bush-imageszy351qei.jpg\" alt=\"bush imagesZY351QEI\" width=\"225\" height=\"225\" />\nGHSII/GHWB, who had worked on Nixon’s election campaign, had also made a telephone call to the Houston office of the FBI, after the assassination, attempting to frame a James Parrott, “possibly a student at the University of Houston,” by stating that “one James Parrott has been talking of killing the President when he comes to Houston.”\nGHSII/GHWB then gave the FBI the names of two Harris County Republican Party Headquarters staffers, a “Mrs. Farley” and “Arlene Smith,” as two sources of “additional information regarding the identity of Parrot.”\n\n<img class=\"alignnone size-full wp-image-47451\" src=\"https://themarshallreport.files.wordpress.com/2018/06/bush-sr-statement.jpg\" alt=\"bush-sr-statement\" width=\"720\" height=\"558\" />\n\nHere we have three individuals with information regarding the potential assassination of JFK, who knew about this “fact” weeks before the assassination—and the FBI was not notified until hours after the event?\nFrom this perspective, GHSII/GHWB’s inability to recall where he was the day JFK was assassinated is not believable (doesn’t everyone recall where they were the day JFK was assassinated?)<img class=\"alignnone size-full wp-image-47456\" src=\"https://themarshallreport.files.wordpress.com/2018/06/bush-maxresdefault.jpg\" alt=\"bush maxresdefault\" width=\"1280\" height=\"720\" />\n\nGHSII/GHWB apparently forgave Parrott sometime later when Parrott worked on GHSII/GHWB’s presidential campaign when he ran against Bill Clinton in 1992. The FBI document speaks for itself, as does the photo taken in front of the book depository.\nSimilar to the dropping of \"Trading With the Enemy Act\" charges against GHSI/PSB In 1942, this is yet another example of a federal “investigation” involving a member of the “Scherf” clan, designed to give the illusion that the agency was “doing its homework.”\nThese facts also support the contention that both the FBI and the CIA are controlled by entities capable of “taking out” anyone—including a sitting president in broad daylight with thousands of witnesses—who fails to conform to the “master plan.” President Kennedy had announced his intention to dissolve the Federal Reserve, dismantle the CIA and bust organized crime; President Kennedy was a major threat to the master plan.\nPrior to GHSII/GHWB’s meteoric rise in politics, it can be assumed he supervised the drug smuggling operations from the Far East. Numerous accounts from soldiers, military advisors and intelligence officers place him in close proximity to covert operations serving generating seed money for assassinations, the overthrow of foreign governments and to fund secret black-ops programs.\n\n \n\n[gallery ids=\"47464,47463\" type=\"rectangular\"]\nGHSII/GHWB, still using his \"Bush\" alias, ran for public office in Texas, obtaining a seat in the House of Representatives from 1967-1971.\n\nLess than two months after the resignation of President Richard Nixon, GHSII/GHWB, then Chairman of the Republican National Committee (RNC), was quickly ushered from public scrutiny and appointed Chief of the Liaison Office in Beijing, China, a position he held until Pearl Harbor Day, 1975. He was then promoted to Director of the CIA, the agency for which GHSII/GHWB claims “he had never worked.”\nGHSII/GHWB was CIA director from January 30, 1976 through January 20, 1977, or a total of 355 days. Not unlike his stint in Asia during the war in Vietnam, his presence in China probably involved drug smuggling and had little to do with diplomatic relations, outside of drug payoffs, assassinations and money laundering. His return to the U.S. was rewarded with a chairmanship at the First International Bank of Houston, a probable destination for illicit Asian profits.\n\n<img class=\"alignnone size-full wp-image-47461\" src=\"https://themarshallreport.files.wordpress.com/2018/06/bushslide621.jpg\" alt=\"bushSlide62\" width=\"960\" height=\"720\" />\nIn 1981, GHSII/GHWB became the vice-President under President Ronald Reagan and knew of the massive funds gathered by Ambassador Leo Emil Wanta’s Ameritrust Groupe, Inc., under the direction of President Reagan, during the financial implosion of the Soviet Union in the late-1980s. GHSII/GHWB then became the 41st president in 1989. During his presidency, President Scherf... er, uh... (aka) President George H.W. Bush, traveled to Hong Kong, demanding trillions of dollars from Wanta and his Chinese partner, Howe Kwong-Kok.\n\nhttps://www.youtube.com/watch?v=DlikNveCUaQ\nHowe died of poisoning 10 days later, due to their refusal to turn over the money (amassed under Presidential Order 12333) which was slated to be returned to the U.S. Treasury. Today in 2007, the $4.5 trillion tagged settlement funds are currently being used as a financial ping-pong ball in money laundering, Ponzi schemes, derivatives, trusts, pension funds, and offshore accounts, with Bank of America, Wachovia Bank, CitiBank Group, JPMorganChase, Goldman Sachs and Co., Bank of Nova Scotia, Chemical Bank, First Union Bank, banks in Germany, Spain, Holland, England, Grenada, North Vietnam, India, U.S. Treasury Secretary Henry M. Paulson, Department of Homeland Security Secretary Michael Chertoff, a host of Cabinet members, former President Bill Clinton, Senator Hillary Clinton, Vice-President Richard Cheney and President George W. Bush taking turns holding the paddle.\n\n<img class=\"alignnone size-full wp-image-47453\" src=\"https://themarshallreport.files.wordpress.com/2018/06/bushfamilyhelpedhitlerrisetopower-1.jpg\" alt=\"BushFamilyHelpedHitlerRisetoPower-1\" width=\"1500\" height=\"1500\" />\n\n<strong>Conclusions</strong>\nBased upon the “deathbed confession” of Hitler’s bodyguard and master spy/assassin Otto Skorzeny, we were given a clue that George Herbert Walker Bush and his father Prescott Sheldon Bush were not who they pretended to be. By following the clue, we found other clues that began to support the claims of Skorzeny: That PSB is really GHSI and GHWB is really GHSII.\nThe result of this connect-the-dots research campaign is that <strong>the “master plan” for world domination has been exposed beyond a reasonable doubt.</strong> Much more can now be researched and written since the master planners are no longer able to hide In the fictitious realms of their propagandized history books and family biographies.\nWhen will those who are “sworn to uphold the law” do so? When will our so-called American patriots finally find the backbone to confront these realities and demand an end to this madness?\nWhether we realize it or not, the world is watching, America. What we decide to do about these issues will not only determine our fate, but the fate of the rest of the world. Are we to be led, like sheep, to our slaughter? Or will we finally wake up, get mad, and say, “Enough is enough!” - Don Nicoloff.\n\n<img class=\"alignnone size-full wp-image-47448\" src=\"https://themarshallreport.files.wordpress.com/2018/06/bush.jpg\" alt=\"bush\" width=\"600\" height=\"480\" />\n\nAccording to Otto Skorzeny, pictured is the Scherff family and a few friends (circa 1938). Holding “Mother\" Scherff’s hand at left is Martin Bormann. In front is Reinhardt Gehlen. In back is Joseph Mengele and to his right is Skorzeny as a young man.<strong> At center right (in the German navy uniform) is George H. Scherff, Jr. and his father George H. Scherff, Sr. Bormann became Hitler’s second in command.</strong> Reinhardt Gehlen was a chief SS officer and assassin who was smuggled out of Germany under Operation Paperclip. Skorzeny was Hitler's bodyguard and SS spy/assassin who came to the U.S. after the war under Project Paperclip.<strong> Skorzeny and GHW Bush were instrumental in merging Nazi (SS) intelligence with the OSI to form the CIA with \"Wild Bill\" Donovan and Allen Dulles.</strong> <strong>These guys were also part of CIA mind control experiments such as MK-ULTRA. SS officer and physician Joseph Mengele, the notoriously sadistic “Angel of Death” of Auschwitz,</strong> escaped Germany to South America.\n\nAfter the war. <strong>George H. Scherff, Jr., became the 41st President of the United States as GHW Bush and George H. Scherff, Sr. (the same man), was Nicola Tesla’s “trusted assistant.”</strong>  Also known in the famous cartoon strip of the time as \"Curious George\" representing Tesla as the professor, and George Sherff, Jr. as the monkey.  Tesla would always catch him monkeying around in his lab and nicknamed him \"Curious George\".  Now, you know President Trump's uncle worked with Tesla and knew all about this and now you know why Mr. Trump when running for President told crowds of people at his political rallies that his Uncle was a inventive genius and knew Tesla, and when Tesla died, his uncle was called in to gather his documents and interpret them.  He was letting the Bush family and his usurped circle of clansmen know he knew everything.\n\nhttps://www.youtube.com/watch?v=UQpSdKxd5bg\n\nInformation given to the masses by the \"Q\" is not coming from the evil order that want to rule the world and destroy all righteous people.  It is not coming from those who are hiding true history.  It is coming from \"Q\" source that is here to open your eyes to the lies and rewritten history designed to keep you asleep, while they slowly kill us all off.  As our dear Lord told the disciples, \"And if Satan cast out Satan, he is divided against himself; how shall then his kingdom stand?\"  But, Satan would divide the house of the truth seekers.  That makes more sense now doesn't it?\n\nDianne\n\nCOMPLETE ARTICLE: <a href=\"http://www.proliberty.com/observer/20070405.htm\">Click Here to Read</a>\n\"Deathbed confessions, photos support claims that George H. Scherf(f), Jr., was the 41st U.S. president\"","tags":[],"publishedDate":"2018-06-02T21:58:35Z","harvestDate":"2018-06-02T21:59:02Z","estimatedPublishedDate":"2018-06-02T21:58:35Z","url":"http://ct.moreover.com/?a=34207256393&p=1u0&v=1&x=EPoRSl7a5uHLZuyYh_0cBg","originalUrl":"https://themarshallreport.wordpress.com/2018/06/02/president-trump-knows-accurate-history-q-wants-you-to-know/","outboundUrls":["http://www.proliberty.com/observer/20070405.htm","https://www.youtube.com/watch?v=DlikNveCUaQ","https://www.youtube.com/watch?v=UQpSdKxd5bg"],"wordCount":"1756","dataFormat":"text","duplicateGroupId":"34207256393","media":{"audio":[],"images":[{"url":"https://themarshallreport.files.wordpress.com/2018/06/bush-imageszy351qei.jpg"},{"url":"https://themarshallreport.files.wordpress.com/2018/06/bush.jpg"},{"url":"https://themarshallreport.files.wordpress.com/2018/06/bushjfk-photo-george-h-w-bush-at-tsbd-1-1.jpg"},{"url":"https://themarshallreport.files.wordpress.com/2018/06/bushslide621.jpg"},{"url":"https://themarshallreport.files.wordpress.com/2018/06/bushbunchlittlenoses.jpg"},{"url":"https://themarshallreport.files.wordpress.com/2018/06/bush-maxresdefault.jpg"},{"url":"https://themarshallreport.files.wordpress.com/2018/06/bush-sr-statement.jpg"},{"url":"https://themarshallreport.files.wordpress.com/2018/06/trump1_opener-superjumbo.jpg"},{"url":"https://themarshallreport.files.wordpress.com/2018/06/bushfamilyhelpedhitlerrisetopower-1.jpg"}],"video":[],"logo":[]},"publishingPlatform":{"itemId":"47447"},"adultLanguage":"false","topics":[],"companies":[{"name":"Bank of America Corporation","symbol":"NCB","exchange":"MUN","isin":"US0605051046","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"NCB","exchange":"BER","isin":"US0605051046","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"NCB","exchange":"HAN","isin":"US0605051046","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"NCB","exchange":"FRA","isin":"US0605051046","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"NCB","exchange":"DUS","isin":"US0605051046","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"NCB","exchange":"HAM","isin":"US0605051046","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"NCB","exchange":"STU","isin":"US0605051046","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"8648","exchange":"TKS","isin":"US0605051046","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"NCB","exchange":"ETR","isin":"US0605051046","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BAC","exchange":"SWX","isin":"US0605051046","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BAC","exchange":"NYS","isin":"US0605051046","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BACRP","exchange":"PINX","isin":"US0605052036","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BAC","exchange":"BSE","isin":"US0605051046","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BAC","exchange":"LIM","isin":"US0605051046","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BA.C","exchange":"BUE","isin":"ARDEUT112851","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BAC","exchange":"SGO","isin":"US0605051046","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BOAC34","exchange":"BSP","isin":"BRBOACBDR004","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BAC","exchange":"MEX","isin":"US0605051046","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"0Q16","exchange":"LTS","isin":"US0605051046","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BACpY","exchange":"NYS","isin":"US0605053109","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BACpA","exchange":"NYS","isin":"US0605052606","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BACpW","exchange":"NYS","isin":"US0605053448","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BACpC","exchange":"NYS","isin":"US0605052861","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BMLpL","exchange":"NYS","isin":"US0605055831","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BMLpI","exchange":"NYS","isin":"US0605056177","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BACpE","exchange":"NYS","isin":"US0605058157","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BMLpJ","exchange":"NYS","isin":"US0605055914","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BMLpH","exchange":"NYS","isin":"US0605056250","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BACpD","exchange":"NYS","isin":"US0605058314","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BMLpG","exchange":"NYS","isin":"US0605056334","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BACpL","exchange":"NYS","isin":"US0605056821","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BACpI/CL","exchange":"NYS","isin":"US0605057407","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of America Corporation","symbol":"BACpB","exchange":"NYS","isin":"US0605052291","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BKN","exchange":"FRA","isin":"CA0641491075","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BKN","exchange":"STU","isin":"CA0641491075","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BKN","exchange":"MUN","isin":"CA0641491075","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BNS.PR.C","exchange":"TSE","isin":"CA0641496850","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BNS.PR.B","exchange":"TSE","isin":"CA0641497197","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BNS","exchange":"TSE","isin":"CA0641491075","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BNS","exchange":"NYS","isin":"CA0641491075","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BNS.PR.Q","exchange":"TSE","isin":"CA0641497270","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BNS.PR.Y","exchange":"TSE","isin":"CA0641496363","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BNS.PR.R","exchange":"TSE","isin":"CA0641496934","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BNS.PR.Z","exchange":"TSE","isin":"CA0641496108","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BNS.PR.D","exchange":"TSE","isin":"CA0641496280","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BNS.PR.E","exchange":"TSE","isin":"CA0641495522","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BNS","exchange":"MEX","isin":"CA0641491075","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BNS.PR.F","exchange":"TSE","isin":"CA0641495944","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BNS.PR.G","exchange":"TSE","isin":"CA0641512029","titleCount":0,"contentCount":1,"primary":true},{"name":"Bank of Nova Scotia","symbol":"BNS.PR.H","exchange":"TSE","isin":"CA0641511112","titleCount":0,"contentCount":1,"primary":true},{"name":"Homeland Security Corp","symbol":"HSCC","exchange":"PINX","isin":"US43741T1007","titleCount":0,"contentCount":1,"primary":true},{"name":"IDS","symbol":"MLIDS","exchange":"PAR","isin":"FR0000079691","titleCount":0,"contentCount":1,"primary":true},{"name":"Union Bank","symbol":"UBNC","exchange":"PINX","isin":"US90520V1035","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"ASTRO-DURANCE BUNGEE SYSTEMS","publishingPlatform":{"userId":"58818784"}},"licenses":[],"source":{"name":"THE  MARSHALL  REPORT","homeUrl":"https://themarshallreport.wordpress.com","location":{},"feed":{"id":"557696159","name":"THE  MARSHALL  REPORT","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"99701476","generator":"http://wordpress.com/","description":"Exposing The Establishment Daily","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"37877","inboundLinkCount":"11"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994628}