{"sequenceId":"845363678642","id":"34207159700","language":"English","title":"Age Pressure","content":"Oh wow, congratulations! 2 posts in 2 weeks, I should definitely give myself some credit as I know just like old times, this might be my last blog of the year. Anyways, I came across a video about age pressure by Jenn Im, if you are interested, here's the video: I have never heard of age pressure ever before but after watching this video, I couldn't help agree that maybe because of the society, we have like certain \"targets\" to achieve at a certain age and will kinda feel guilty or left out if we don't.. I have certainly set several typical targets for myself which I guess not many of them were fulfilled because I made them without knowing the reality how to get it fulfilled. It seems to me like, when the time comes, a solution will just miraculously fall down from the sky and everything will be alright. NOT! and to be frank, I kinda forgot what were the targets I have made for myself besides getting wheels and a roof. Let's not talk about life before work because we know what we have to do at  those ages, age 12, pass UPSR, age 17 pass SPM, age 18 start college or university, age 20s graduate.. I used to have some what to achieve before i reach 30 list but i guess, i was too stressed out, i don't remember what are those anymore.. Anyway, as mentioned a the video, in some places, women are considered \"expired\" if they don't get married by 30. I guess because women have to give birth so maybe it's our internal organs that are expiring?? If that's not the reason, then this whole married by 30 thing is just bull.. Why is there an age limit to get married? Especially Asians, when you reach a certain age, having a significant one becomes the hot topic of the century.. You have lived more than 20 years working hard to be who you are but to other people, all that matters is whether do you have a significant one and when are you planning to settle down... I am not going to lie, regardless whether I have a significant other or not, I feel super irritated when people asked me when do i plan to settle down. To make things worse, whenever I say i have a lot of plans but settling down will not happen in the near future, i get responses like, \"are you aware that you are getting older?\", \"what are you waiting for?\", \"why aren't you planning on settling down, you are 30 already?\"....... \"SO?\" unless you are worried about me having trouble conceiving when I get older, other than that, why do you even care?? I do have a lot of plans for my future.. Speaking of plans.. I may not be affected by the age pressure for relationships.... or maybe I am since i am writing this.. anyway, reaching a certain age does make you question your direction in life.. so I have to admit, i do face the age pressure when it comes to career. When I started working, i did vow to be an employee forever, since i'm not a risk taker nor do i have a brain for business so being an employee promises a fixed monthly salary and benefits that i might or might not get with my own \"business\".. But now, i reconsidered my decision.. Working isn't fun,, i can't say for everybody but it has lost its fun for me.. I am having second thoughts about what i vowed to be several years ago. What am i supposed to do now? Should I start a business?? but i don't know how.. I have been toying around with some plans and never actually executed any because of fear.. fear of failing.. people said to me, if i don't find what i'm doing fun, why am i still there? life is short, too short for people to just bear with it.. but what about life? my bills aren't gonna settle themselves, the roof i dream of aren't gonna build itself.. these need chips, and chips are what i get for getting up at 6.30am every weekday, thumb print myself in and out. And, you see it right, i am not a risk taker.. i can't just let go my supply of chips just because it's not fun anymore, i need a plan.. a plan to find the same amount or more chips elsewhere.. but i am still swimming blindly.. unsure if i'm heading the right direction or am i just wandering around the sea of chances not knowing what to grab hold of.. I see friends who started out from the same starting line has now seem to have done a few laps and are on track with what they are doing.. Oh well, that's the downside of social media, everyone seems to be so happy, so fulfilled, leading such meaningful lives while people who are watching or reading it feel like failures.. well, i have to admit this too, i am affected by social media.. which i will write another blog post someday about this. Anyway.. at this age, there are so much that should have been done in the typical world that haven't been done and it stressed me out.. BUT, some people would say... you live your own life so you get to control what come first and what to do at which time of your life.. true though.. i am still trying to fit the bits and pieces together to hopefully form a whole for my future career whatever it may be.. at least that's what i think i should be doing at this point of time.. I hope that nobody gets affected by the age pressure like I am but if you are, no worries, you are not alone, you may leave a comment and we can share our stress and maybe help each other out.. Signing off for now Toodles!","contentWithMarkup":"Oh wow, congratulations! 2 posts in 2 weeks, I should definitely give myself some credit as I know just like old times, this might be my last blog of the year. Anyways, I came across a video about age pressure by Jenn Im, if you are interested, here's the video:<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><iframe width=\"320\" height=\"266\" class=\"YOUTUBE-iframe-video\" data-thumbnail-src=\"https://i.ytimg.com/vi/Eahfc86YTlk/0.jpg\" src=\"https://www.youtube.com/embed/Eahfc86YTlk?feature=player_embedded\" frameborder=\"0\" allowfullscreen></iframe></div><br />I have never heard of age pressure ever before but after watching this video, I couldn't help agree that maybe because of the society, we have like certain \"targets\" to achieve at a certain age and will kinda feel guilty or left out if we don't..<br /><br />I have certainly set several typical targets for myself which I guess not many of them were fulfilled because I made them without knowing the reality how to get it fulfilled. It seems to me like, when the time comes, a solution will just miraculously fall down from the sky and everything will be alright. NOT! and to be frank, I kinda forgot what were the targets I have made for myself besides getting wheels and a roof.<br /><br />Let's not talk about life before work because we know what we have to do at  those ages, age 12, pass UPSR, age 17 pass SPM, age 18 start college or university, age 20s graduate.. I used to have some what to achieve before i reach 30 list but i guess, i was too stressed out, i don't remember what are those anymore.. <br /><br />Anyway, as mentioned a the video, in some places, women are considered \"expired\" if they don't get married by 30. I guess because women have to give birth so maybe it's our internal organs that are expiring?? If that's not the reason, then this whole married by 30 thing is just bull.. Why is there an age limit to get married? Especially Asians, when you reach a certain age, having a significant one becomes the hot topic of the century.. You have lived more than 20 years working hard to be who you are but to other people, all that matters is whether do you have a significant one and when are you planning to settle down... I am not going to lie, regardless whether I have a significant other or not, I feel super irritated when people asked me when do i plan to settle down. To make things worse, whenever I say i have a lot of plans but settling down will not happen in the near future, i get responses like, \"are you aware that you are getting older?\", \"what are you waiting for?\", \"why aren't you planning on settling down, you are 30 already?\"....... \"SO?\" unless you are worried about me having trouble conceiving when I get older, other than that, why do you even care?? I do have a lot of plans for my future..<br /><br />Speaking of plans.. I may not be affected by the age pressure for relationships.... or maybe I am since i am writing this.. anyway, reaching a certain age does make you question your direction in life.. so I have to admit, i do face the age pressure when it comes to career. When I started working, i did vow to be an employee forever, since i'm not a risk taker nor do i have a brain for business so being an employee promises a fixed monthly salary and benefits that i might or might not get with my own \"business\".. But now, i reconsidered my decision.. Working isn't fun,, i can't say for everybody but it has lost its fun for me.. I am having second thoughts about what i vowed to be several years ago. What am i supposed to do now? Should I start a business?? but i don't know how.. I have been toying around with some plans and never actually executed any because of fear.. fear of failing.. people said to me, if i don't find what i'm doing fun, why am i still there? life is short, too short for people to just bear with it.. but what about life? my bills aren't gonna settle themselves, the roof i dream of aren't gonna build itself.. these need chips, and chips are what i get for getting up at 6.30am every weekday, thumb print myself in and out. And, you see it right, i am not a risk taker.. i can't just let go my supply of chips just because it's not fun anymore, i need a plan.. a plan to find the same amount or more chips elsewhere.. but i am still swimming blindly.. unsure if i'm heading the right direction or am i just wandering around the sea of chances not knowing what to grab hold of.. I see friends who started out from the same starting line has now seem to have done a few laps and are on track with what they are doing.. Oh well, that's the downside of social media, everyone seems to be so happy, so fulfilled, leading such meaningful lives while people who are watching or reading it feel like failures.. well, i have to admit this too, i am affected by social media.. which i will write another blog post someday about this.<br /><br />Anyway.. at this age, there are so much that should have been done in the typical world that haven't been done and it stressed me out.. BUT, some people would say... you live your own life so you get to control what come first and what to do at which time of your life.. true though.. i am still trying to fit the bits and pieces together to hopefully form a whole for my future career whatever it may be.. at least that's what i think i should be doing at this point of time..<br /><br />I hope that nobody gets affected by the age pressure like I am but if you are, no worries, you are not alone, you may leave a comment and we can share our stress and maybe help each other out..<br /><br />Signing off for now<br />Toodles! <br /><br /><br />","tags":["blabbing...","confessing....","frustrating...","tiring...","work..."],"publishedDate":"2018-06-02T14:57:37Z","harvestDate":"2018-06-02T21:36:38Z","estimatedPublishedDate":"2018-06-02T14:57:37Z","url":"http://ct.moreover.com/?a=34207159700&p=1u0&v=1&x=LCT7nPigZAMtLRTnVOWLNw","originalUrl":"http://pandaspace.blogspot.com/2018/06/age-pressure.html","commentsUrl":"http://www.blogger.com/comment.g?blogID=35481922&postID=7569998599749523792&isPopup=true","outboundUrls":[],"wordCount":"993","dataFormat":"text","duplicateGroupId":"34207159700","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Panda","publishingPlatform":{}},"licenses":[],"source":{"name":"Panda's space","homeUrl":"http://pandaspace.blogspot.com/","location":{"country":"Malaysia","countryCode":"MY","region":"Asia","subregion":"South-Eastern Asia"},"feed":{"id":"148579752","name":"Panda's space","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"Hear the life of a broadcasting graduate, leading a life where she tries to be as different from her fellows as possible... （061004）\n\nPlease bear with my short form languages and broken english...\nenglish has however never been my best subject...","tags":["blabbing...","school stuff....","holidays....","Yay yay yay......","frustrating...","Quizzes","depressing...","crazy...","New year","confessing....","presentation","haha...","internship...","taggy","Shooting","holidays.... HK-Macau2012","outings...","work...","Birthdays","mv shooting....","favo"],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86991974}