{"sequenceId":"845363662665","id":"34207159138","language":"English","title":"Corpus Christi Year B, 03.06.2018","content":"Exodus 24:3-8 / Hebrews 9:11-15 / Mark 14:12-16, 22-26 Whenever we talk about horses, we would image those elegant, swift-footed creatures that heroes sit on in action movies. Of course some might think of the Turf Club and all those kind of things. Whenever we talk about donkeys, we will think of all those donkey jokes, name-calling (calling someone a donkey isn’t much of a compliment), dull and stubborn beasts-of-burden, without much graciousness or elegance. Now what happens when a donkey and a horse come together, the offspring is called a mule. A mule is a cross-breed of a male donkey and a female horse. Mules are reputed to be more patient and hardy than horses and are less obstinate and a bit more intelligent than donkeys. It is difficult to say whether a mule is the best of both worlds, or the less of both worlds. Mules are not featured much in stories, but here is one and it is in a way connected with the feast of Corpus Christi. But before bringing in the mule, let us talk about St. Anthony of Padua. He is often invoked as the Patron Saint of lost articles. But actually it is more like he is the Patron Saint of the lost, meaning to say, those who have lost their faith, or lost in obstinate thinking. St. Anthony lived during the 13th century, and he had a great zeal for the Real Presence of Jesus in the Holy Eucharist. During his travels through a city called Rimini, Saint Anthony engaged in a conversation with a particularly stubborn heretic called Bononillo.  This man obstinately refused to admit the mystery of the Real Presence in the Eucharist. In vain, St. Anthony presented proofs drawn from both Scripture and Church teaching. When his efforts failed before the stubborn obstinacy of Bononillo, he decided to change his strategy. St. Anthony said to him, “You possess a mule that you ride often. I will present a consecrated host to it; if it falls on its knees before the Blessed Sacrament, will you recognize the Real Presence of the Saviour under His Eucharistic appearance?” “Certainly,” responded the unbeliever, who felt confident that the outcome would be to the shame of the saint. The two men agreed to meet again in the market square three days later. They then went their separate ways, each to prepare for the spiritual showdown in his own way. Bononillo, in order to insure victory, deprived his mule from all food for the three days. St. Anthony  prepared with prayer and fasting. At the set day and time, St. Anthony left the Church, carrying a ciborium in his hands. Bononillo arrived leading the famished mule by the bridle. A considerable crowd had gathered on the square, curious to attend such a remarkable sight. With a smile on his lips, Bononillo, believing victory already to be his, set a sack of oats and hay before the mule. As all watched in breathless anticipation, the hungry mule turned away from the food and turned toward the Sacred Host held high by St. Anthony. With a graceful motion uncharacteristic of its breed, the mule bowed low to the ground, giving due reverence to its Creator. It did not straighten or stand up again until it had received permission from the St. Anthony to do so. As much as this story is inspiring, it makes us wonder who is more stubborn? Man or mule? Today as the Church celebrates the feast of Corpus Christi, we are reminded again of the Real Presence of Jesus Christ in the Eucharist. The Eucharistic presence of Jesus can be said to be miraculous as well as supernatural. By miraculous, it is meant that the laws of nature take an exception, that although the forms of bread and wine remained unchanged, the essence of is changed and the essence takes on the presence of Christ. By supernatural, it is meant that this is the work of God, and not the reasoning of man, and faith in the divinity of Jesus is required to believe that He is truly present in the consecrated host and wine. The gospel passage recounts for us what Jesus said at the Last Supper when He took the bread and said “This is My Body”, and then He took the wine and said “This is My Blood”. And we hear in the words of consecration, “This is my body, which is given up for you” and “This is the chalice of my blood, which is poured out for you” and “Do this in memory of me”. So we come to the Eucharist, and we remember what Jesus did to save us, and we partake of His Body and Blood. And as we come forward to receive Holy Communion, the priest will hold up the consecrated Host and say “The Body of Christ” and we respond with “Amen”. We have to say “Amen” because it is an act of faith. We don’t have to shout it out loud, but still we have to say it with affirmation and conviction. Now when it comes to the Body of Christ, it may sound like a crude and silly question to ask “Which part of the Body of Christ is it?” It may sound crude, but a further reflection will lead us to the realization that this Body of Christ is none other than the Heart of Christ! So in short, the Eucharist is an invitation to come into communion with Jesus and to enter into His Heart.  And that’s why we have distributed these “Jesus Invites”. Jesus is inviting us to come to the triduum and to the feast of the Sacred Heart so that we can come into union with Him and at the same time to put the things of our hearts into His Sacred Heart through the petition slips that are in these “Jesus Invites”. Indeed the Eucharist is a miracle and it is supernatural. Jesus gives us His Heart so that He can make our hearts like His. He answers our petitions so that we can continue to believe. The horse, the donkey and the mule may not understand this, but they can sense the divine presence. Whereas we can understand it. Not only can we understand, but let us also believe and adore the Real Presence of Jesus in the Eucharist.","contentWithMarkup":"<span style=\"font-size: large;\">Exodus 24:3-8 / Hebrews 9:11-15 / Mark 14:12-16, 22-26</span><br /><span style=\"font-size: large;\">Whenever we talk about horses, we would image those elegant, swift-footed creatures that heroes sit on in action movies. Of course some might think of the Turf Club and all those kind of things.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">Whenever we talk about donkeys, we will think of all those donkey jokes, name-calling (calling someone a donkey isn’t much of a compliment), dull and stubborn beasts-of-burden, without much graciousness or elegance.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">Now what happens when a donkey and a horse come together, the offspring is called a mule. A mule is a cross-breed of a male donkey and a female horse. Mules are reputed to be more patient and hardy than horses and are less obstinate and a bit more intelligent than donkeys.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">It is difficult to say whether a mule is the best of both worlds, or the less of both worlds. Mules are not featured much in stories, but here is one and it is in a way connected with the feast of Corpus Christi.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">But before bringing in the mule, let us talk about St. Anthony of Padua. He is often invoked as the Patron Saint of lost articles. But actually it is more like he is the Patron Saint of the lost, meaning to say, those who have lost their faith, or lost in obstinate thinking.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">St. Anthony lived during the 13th century, and he had a great zeal for the Real Presence of Jesus in the Holy Eucharist. During his travels through a city called Rimini, Saint Anthony engaged in a conversation with a particularly stubborn heretic called Bononillo.  This man obstinately refused to admit the mystery of the Real Presence in the Eucharist.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">In vain, St. Anthony presented proofs drawn from both Scripture and Church teaching. When his efforts failed before the stubborn obstinacy of Bononillo, he decided to change his strategy.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">St. Anthony said to him, “You possess a mule that you ride often. I will present a consecrated host to it; if it falls on its knees before the Blessed Sacrament, will you recognize the Real Presence of the Saviour under His Eucharistic appearance?” “Certainly,” responded the unbeliever, who felt confident that the outcome would be to the shame of the saint.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">The two men agreed to meet again in the market square three days later. They then went their separate ways, each to prepare for the spiritual showdown in his own way.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">Bononillo, in order to insure victory, deprived his mule from all food for the three days. St. Anthony  prepared with prayer and fasting. At the set day and time, St. Anthony left the Church, carrying a ciborium in his hands. Bononillo arrived leading the famished mule by the bridle.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">A considerable crowd had gathered on the square, curious to attend such a remarkable sight. With a smile on his lips, Bononillo, believing victory already to be his, set a sack of oats and hay before the mule.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">As all watched in breathless anticipation, the hungry mule turned away from the food and turned toward the Sacred Host held high by St. Anthony. With a graceful motion uncharacteristic of its breed, the mule bowed low to the ground, giving due reverence to its Creator. It did not straighten or stand up again until it had received permission from the St. Anthony to do so.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">As much as this story is inspiring, it makes us wonder who is more stubborn? Man or mule?</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">Today as the Church celebrates the feast of Corpus Christi, we are reminded again of the Real Presence of Jesus Christ in the Eucharist.</span><br /><span style=\"font-size: large;\">The Eucharistic presence of Jesus can be said to be miraculous as well as supernatural. By miraculous, it is meant that the laws of nature take an exception, that although the forms of bread and wine remained unchanged, the essence of is changed and the essence takes on the presence of Christ.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">By supernatural, it is meant that this is the work of God, and not the reasoning of man, and faith in the divinity of Jesus is required to believe that He is truly present in the consecrated host and wine.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">The gospel passage recounts for us what Jesus said at the Last Supper when He took the bread and said “This is My Body”, and then He took the wine and said “This is My Blood”.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">And we hear in the words of consecration, “This is my body, which is given up for you” and “This is the chalice of my blood, which is poured out for you” and “Do this in memory of me”.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">So we come to the Eucharist, and we remember what Jesus did to save us, and we partake of His Body and Blood.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">And as we come forward to receive Holy Communion, the priest will hold up the consecrated Host and say “The Body of Christ” and we respond with “Amen”. We have to say “Amen” because it is an act of faith. We don’t have to shout it out loud, but still we have to say it with affirmation and conviction.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">Now when it comes to the Body of Christ, it may sound like a crude and silly question to ask “Which part of the Body of Christ is it?”</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">It may sound crude, but a further reflection will lead us to the realization that this Body of Christ is none other than the Heart of Christ!</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">So in short, the Eucharist is an invitation to come into communion with Jesus and to enter into His Heart. </span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">And that’s why we have distributed these “Jesus Invites”. Jesus is inviting us to come to the triduum and to the feast of the Sacred Heart so that we can come into union with Him and at the same time to put the things of our hearts into His Sacred Heart through the petition slips that are in these “Jesus Invites”.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">Indeed the Eucharist is a miracle and it is supernatural. Jesus gives us His Heart so that He can make our hearts like His. He answers our petitions so that we can continue to believe.</span><br /><span style=\"font-size: large;\"><br /></span><span style=\"font-size: large;\">The horse, the donkey and the mule may not understand this, but they can sense the divine presence. Whereas we can understand it. Not only can we understand, but let us also believe and adore the Real Presence of Jesus in the Eucharist.</span>","tags":[],"publishedDate":"2018-06-02T14:49:19Z","harvestDate":"2018-06-02T21:36:30Z","estimatedPublishedDate":"2018-06-02T14:49:19Z","url":"http://ct.moreover.com/?a=34207159138&p=1u0&v=1&x=kmhZtXbtSB48WT2ArMY_cw","originalUrl":"http://frstephenyim.blogspot.com/2018/06/corpus-christi-year-b-03062018.html","outboundUrls":[],"wordCount":"1058","dataFormat":"text","duplicateGroupId":"34206230214","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Rev Fr Stephen Yim","publishingPlatform":{}},"licenses":[],"source":{"name":"Sunday Homilies","homeUrl":"http://frstephenyim.blogspot.com/","location":{"country":"Singapore","countryCode":"SG","region":"Asia","subregion":"South-Eastern Asia"},"feed":{"id":"135218766","name":"Sunday Homilies","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86991951}