{"sequenceId":"845367331443","id":"34207263431","language":"English","title":"Jay Gonzalez, former Deval Patrick budget chief, wins nomination at 2018 Mass. Democratic convention","content":"Jay Gonzalez, a former aide to ex-Gov. Deval Patrick, won the support of most delegates at the 2018 Massachusetts Democratic Convention as the party seeks to re-take the governor's office from Republican Charlie Baker. Bob Massie, an environmental activist, picked up enough support to qualify for the ballot. The Democratic primary is Tuesday, Sept. 4, and the winner is expected to face off against Baker, who faces his own primary challenge in controversial pastor Scott Lively. Quentin Palfrey, a former Obama administration official, and comedian Jimmy Tingle, two candidates running for lieutenant governor, also qualified for the Sept. 4 ballot.  Both Gonzalez and Massie took swipes at Baker and Lt. Gov. Karyn Polito during the convention, saying the Republican administration should be taking a stronger stance against President Donald Trump. Gonzalez, who received 70 percent of delegates' support, charged that Baker \"hides behind the chaos that Trump creates\" while failing to fix state government. \"Not being crazy is not good enough,\" Gonzalez said, while Massie hit Baker for not appearing at marches opposing Trump. A moderate Republican, Baker maintains high approval ratings as he seeks a second term, touting a solid working relationship with a state Legislature dominated by Democrats. Days before party activists headed to Worcester for the state convention, Baker was surrounded by smiling Democrats as he signed a $1.8 billion borrowing bill focused on modernizing public housing and expanding affordable housing. After the Saturday afternoon vote, Gonzalez blasted Baker for a \"cautious\" approach in taking positions on hot topics. Gonzalez also voiced support for raising taxes.  \"It' s not taking a position if you have to, not doing anything if you don't have to, and that's going to end,\" Gonzalez said. \"And when I'm governor, people are going to know where I stand, and yes, if we need additional revenue to do some of things we need to do, so that Massachusetts isn't falling behind, and we lift regular people up in this state then we're going to do it.\" The chair of the Massachusetts GOP, in a statement during the convention, pointed to recent scandals among Democratic leaders, including former Senate President Stan Rosenberg stepping down after his husband Bryon Hefner allegedly sexually assaulted several victims and meddled in Senate business, and former Sen. Brian Joyce, who is facing a corruption trial. \"Democrats are in chaos, and they're proving to the public that they cannot be trusted to keep their own house in order, let alone manage more of our tax dollars,\" Kristen Hughes, the MassGOP chair, said. \"From a slew of corruption reports, to the fact that the party's candidates for governor have lost touch with reality when it comes to their outlandish new spending proposals, it's not surprising that voters have lost faith in the Democrats,\" she added.","contentWithMarkup":"Jay Gonzalez, a former aide to ex-Gov. Deval Patrick, won the support of most delegates at the 2018 Massachusetts Democratic Convention as the party seeks to re-take the governor's office from Republican Charlie Baker.","tags":["cat:Politics","tag:bob-massie","tag:boston","tag:charlie-baker","tag:dcu-center","tag:jay-gonzalez","tag:jimmy-tingle","tag:massachusetts-politics","tag:politics","tag:quentin-palfrey","tag:worcester"],"publishedDate":"2018-06-02T21:30:30Z","harvestDate":"2018-06-02T22:00:20Z","estimatedPublishedDate":"2018-06-02T21:30:30Z","url":"http://ct.moreover.com/?a=34207263431&p=1u0&v=1&x=8tUlQBklNEbXxyumXfDBKg","originalUrl":"http://www.masslive.com/news/index.ssf/2018/06/jay_gonzalez_former_deval_patr.html","outboundUrls":[],"wordCount":"459","dataFormat":"text","duplicateGroupId":"34207176947","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"US politics news","group":"Society"}],"companies":[],"author":{"name":"Gintautas Dumcius | gdumcius@masslive.com","publishingPlatform":{}},"licenses":[],"source":{"name":"News","homeUrl":"http://www.masslive.com/news/index.ssf/","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"71945125","name":"News","mediaType":"Blog","publishingPlatform":"Movable Type","generator":"Movable Type Enterprise 4.29-advance http://www.sixapart.com/movabletype/","tags":[],"language":"English","dataFormat":"Image","rank":{"autoRank":"1","autoRankOrder":"1065","inboundLinkCount":"2294"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994830}