{"sequenceId":"845367410357","id":"34207266473","language":"English","title":"Deadpool 2","content":"I can forgive a lot of things in a Deadpool movie that would bother me if the story was meant to be taken seriously. I can forgive a slapdash plot where trying to follow the logic of what the antagonist makes zero sense (Cable not going back into the prison, for example). I can forgive the failure to make the story driving the plot in any way interesting or engaging. I can forgive using the only major female characters in the film as basically a plot-pushing angel and superpowered girls who are kind of along for the ride. I can accept the cast of secondary characters built up by the first film and some interesting new additions to the cast being totally underused. If, and only if, the film is funny. The problem was that it just wasn’t that entertaining. Recent Marvel movies have done a great job of being laugh-out-loud funny. The Guardians of the Galaxy movies, Thor: Ragnarok and even the recent Avengers: Age of Ultron all managed to be really funny, slip in a whole lot of pop culture references and still switch to serious mode when required. Deadpool absolutely needs to set itself apart by not only being more irreverent and adult than these other comic book films, it needs to be the funniest of the bunch. And it just isn’t. There were a lot of jokes that left me smirking – repeating the dig about not being able to afford a decent number of X-Men only for them all to be glimpsed watching in disapproval; a really big-name star playing an invisible character; calling out X-Men as a dated analogy for racism in the 60s and making cracks at Black Tom Cassidy not being black. They all got a little smile from me. But I only actually laughed once, and that was the dig at Rob Liefeld and his inability to draw feet (which is actually how I first became aware of him, when people were ranting about his art). And of course that was the point nobody else in the theatre laughed. The humour just doesn’t work as well as the character-based humour in the other Marvel movies is working. Firstly, the film makes a point of trying to give Deadpool depth by making a good third of the movie a miserable rumination on mortality and being left alone if you’re basically immortal. Which obviously isn’t especially funny. It then sets up a gag where X-Force don’t last longer than a few minutes, and while it’s a little funny it doesn’t work that well after all this pontificating about how losing a loved one can have such a harrowing affect. Don’t Bedlam and Zeitgeist have any loved ones? A lot of the issue is timing. I feel like a lot of the humour is in the vein of Parker and Stone vein – build something up as important then tear it down. The ‘Holy shit balls’ song for the Juggernaut was definitely very South Park. But I feel like they would have handled the parachute sequence so much better to make the bathos actually funny. Same with the opening credits – they’re a funny parody of James Bond with Flashdance thrown in there, but they’re at a point in the movie that’s just left the audience on a downswing so the humour just isn’t prepped right. Russell and Cable also don’t work very well. Russell is very unlikeable, even for a kid who is destined for terrible things Looper-style. His storyline also leads Deadpool to making a whole lot of paedo jokes that just didn’t sit well with me because nobody’s gonna find them especially funny or edgy and child abuse is not really something to make light of. Cable just wasn’t very interesting either, seeming not especially driven or edgy. Also, a little ironically after seeing Brolin as Thanos, I just don’t think he was physically big enough for Cable, who is meant to be huge. A huge human, obviously, not huge like the Juggernaut – who I have to say was a highlight here and unfortunately underused. Overall, I was pretty disappointed. The film only worked if it was actually funny, and for me it fell short. It was sometimes clever, sometimes impressive and sometimes very up-to-the-minute with what it chose to skewer, and thinking back on how the whole publicity campaign was done the concept is amusing, but it needed to actually make me laugh and it didn’t. It didn’t even try to for way too much of the movie. I didn’t particularly like the first film either, but I feel like it at least made me chuckle. Hopefully any future sequels will do better.  ","contentWithMarkup":"<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><br /><div class=\"verCharCharCharCharCharCharCharCharChar\"><br /></div><div class=\"verCharCharCharCharCharCharCharCharChar\">I can forgive a lot of things in a <i style=\"mso-bidi-font-style: normal;\">Deadpool </i>movie that would bother me if the story was meant to be taken seriously. I can forgive a slapdash plot where trying to follow the logic of what the antagonist makes zero sense (Cable not going back into the prison, for example). I can forgive the failure to make the story driving the plot in any way interesting or engaging. I can forgive using the only major female characters in the film as basically a plot-pushing angel and superpowered girls who are kind of along for the ride. I can accept the cast of secondary characters built up by the first film and some interesting new additions to the cast being totally underused. If, and only if, the film is funny. <o:p></o:p></div><div class=\"verCharCharCharCharCharCharCharCharChar\"><br /></div><div class=\"verCharCharCharCharCharCharCharCharChar\">The problem was that it just wasn’t that entertaining. Recent Marvel movies have done a great job of being laugh-out-loud funny. The <i style=\"mso-bidi-font-style: normal;\">Guardians of the Galaxy </i>movies, <i style=\"mso-bidi-font-style: normal;\">Thor: Ragnarok </i>and even the recent <i style=\"mso-bidi-font-style: normal;\">Avengers: Age of Ultron </i>all managed to be really funny, slip in a whole lot of pop culture references and still switch to serious mode when required. <i style=\"mso-bidi-font-style: normal;\">Deadpool </i>absolutely needs to set itself apart by not only being more irreverent and adult than these other comic book films, it needs to be the funniest of the bunch. <o:p></o:p></div><div class=\"verCharCharCharCharCharCharCharCharChar\"><br /></div><div class=\"verCharCharCharCharCharCharCharCharChar\">And it just isn’t. There were a lot of jokes that left me smirking – repeating the dig about not being able to afford a decent number of X-Men only for them all to be glimpsed watching in disapproval; a really big-name star playing an invisible character; calling out X-Men as a dated analogy for racism in the 60s and making cracks at Black Tom Cassidy not being black. They all got a little smile from me. But I only actually laughed once, and that was the dig at Rob Liefeld and his inability to draw feet (which is actually how I first became aware of him, when people were ranting about his art). And of course that was the point nobody else in the theatre laughed. <o:p></o:p></div><div class=\"verCharCharCharCharCharCharCharCharChar\"><br /></div><div class=\"verCharCharCharCharCharCharCharCharChar\">The humour just doesn’t work as well as the character-based humour in the other Marvel movies is working. Firstly, the film makes a point of trying to give Deadpool depth by making a good third of the movie a miserable rumination on mortality and being left alone if you’re basically immortal. Which obviously isn’t especially funny. It then sets up a gag where X-Force don’t last longer than a few minutes, and while it’s a little funny it doesn’t work that well after all this pontificating about how losing a loved one can have such a harrowing affect. Don’t Bedlam and Zeitgeist have any loved ones? <o:p></o:p></div><div class=\"verCharCharCharCharCharCharCharCharChar\"><br /></div><div class=\"verCharCharCharCharCharCharCharCharChar\">A lot of the issue is timing. I feel like a lot of the humour is in the vein of Parker and Stone vein – build something up as important then tear it down. The ‘Holy shit balls’ song for the Juggernaut was definitely very <i style=\"mso-bidi-font-style: normal;\">South Park</i>. But I feel like they would have handled the parachute sequence so much better to make the bathos actually funny. Same with the opening credits – they’re a funny parody of <i style=\"mso-bidi-font-style: normal;\">James Bond</i> with <i style=\"mso-bidi-font-style: normal;\">Flashdance </i>thrown in there, but they’re at a point in the movie that’s just left the audience on a downswing so the humour just isn’t prepped right. <o:p></o:p></div><div class=\"verCharCharCharCharCharCharCharCharChar\"><br /></div><div class=\"verCharCharCharCharCharCharCharCharChar\">Russell and Cable also don’t work very well. Russell is very unlikeable, even for a kid who is destined for terrible things <i style=\"mso-bidi-font-style: normal;\">Looper</i>-style. His storyline also leads Deadpool to making a whole lot of paedo jokes that just didn’t sit well with me because nobody’s gonna find them especially funny or edgy and child abuse is not really something to make light of. Cable just wasn’t very interesting either, seeming not especially driven or edgy. Also, a little ironically after seeing Brolin as Thanos, I just don’t think he was physically big enough for Cable, who is meant to be huge. A huge human, obviously, not huge like the Juggernaut – who I have to say was a highlight here and unfortunately underused. <o:p></o:p></div><div class=\"verCharCharCharCharCharCharCharCharChar\"><br /></div><div class=\"verCharCharCharCharCharCharCharCharChar\">Overall, I was pretty disappointed. The film only worked if it was actually funny, and for me it fell short. It was sometimes clever, sometimes impressive and sometimes very up-to-the-minute with what it chose to skewer, and thinking back on how the whole publicity campaign was done the concept is amusing, but it needed to actually make me laugh and it didn’t. It didn’t even try to for way too much of the movie. I didn’t particularly like the first film either, but I feel like it at least made me chuckle. Hopefully any future sequels will do better. <span style=\"mso-spacerun: yes;\"> </span><o:p></o:p></div><br /></div>","tags":[],"publishedDate":"2018-06-02T18:46:54Z","harvestDate":"2018-06-02T22:00:53Z","estimatedPublishedDate":"2018-06-02T18:46:54Z","url":"http://ct.moreover.com/?a=34207266473&p=1u0&v=1&x=IT7YOiDy_DKViwqZebRzjQ","originalUrl":"http://adzfilm.blogspot.com/2018/06/deadpool-2.html","commentsUrl":"http://adzfilm.blogspot.com/2018/06/deadpool-2.html#comment-form","outboundUrls":[],"wordCount":"780","dataFormat":"text","duplicateGroupId":"34207266473","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Entertainment: superhero news","group":"Entertainment"}],"companies":[],"author":{"name":"Adziu","publishingPlatform":{}},"licenses":[],"source":{"name":"Adziu's Film, Theatre and Gig Reviews","homeUrl":"http://adzfilm.blogspot.com/","location":{"country":"United Kingdom","countryCode":"GB","region":"Europe","subregion":"Northern Europe"},"feed":{"id":"296882559","name":"Adziu's Film, Theatre and Gig Reviews","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994943}