{"sequenceId":"845362195233","id":"34207111073","language":"English","title":"Walking With and Without Ginger","content":"Yesterday, I arrived at work shortly before 5PM, and my initial task was to help the tail end of the day shift lock up the joint after the tourists left. Oddly enough, everybody was out shortly after 5, rather than the usual 5:30 weekday exodus. After everybody left, I decided I'd spend some quality time with my beloved Ginger. I had to do an inspection tour of the site, and Ginger usually trots along behind me as I make sure everything is ship-shape. About halfway through my walkabout, Ginger decided to plop herself down on a convenient perch. I suspect that she was reluctant to follow me through a section of the property occupied by about twenty or thirty geese. Most of the geese onsite are overly tame, but Ginger, being small and a predator, would probably have faced a gauntlet of angry birds. I perambulated the property and at one of the distant corners, I ran into a critter which probably would have been scared off by Ginger: It was a relief not to have to deal with death and dismemberment, though this cottontail was probably big enough to challenge my feline associate. I walked back the way I had come, through the gauntlet of geese, and reconnected with my precious kitty: What a precious, precious kitty! It being a muggy day, I decided to groom Ginger a bit, merely using my fingers to comb some excess fur off of her muscular form. Ginger is one of those easily distracted cats, she typically never sat still long enough to brush, but I learned my lesson, and decided to apply operant conditioning. If you want the cat to behave in a particular manner, reward that behavior... a handful of kibble, a small mountain of fur, and Ginger was as pretty as a picture.","contentWithMarkup":"Yesterday, I arrived at work shortly before 5PM, and my initial task was to help the tail end of the day shift lock up the joint after the tourists left.  Oddly enough, everybody was out shortly after 5, rather than the usual 5:30 weekday exodus.  After everybody left, I decided I'd spend some quality time with my beloved Ginger.  I had to do an inspection tour of the site, and Ginger usually trots along behind me as I make sure everything is ship-shape.<br /><br />About halfway through my walkabout, Ginger decided to plop herself down on a convenient perch. I suspect that she was reluctant to follow me through a section of the property occupied by about twenty or thirty geese.  Most of the geese onsite are overly tame, but Ginger, being small and a predator, would probably have faced a gauntlet of <a href=\"https://bigbadbaldbastard.blogspot.com/2012/03/bird-in-hand.html\">angry birds</a>.  I perambulated the property and at one of the distant corners, I ran into a critter which probably would have been scared off by Ginger:<br /><br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-SMCu-dIi-gA/WxKEGuc8lhI/AAAAAAAACYY/8XnP48eKb3IRJR_0ZdOU_YN6xBVpBMmQwCLcBGAs/s1600/IMG_0016.JPG\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-SMCu-dIi-gA/WxKEGuc8lhI/AAAAAAAACYY/8XnP48eKb3IRJR_0ZdOU_YN6xBVpBMmQwCLcBGAs/s400/IMG_0016.JPG\" width=\"300\" height=\"400\" data-original-width=\"1200\" data-original-height=\"1600\" /></a></div><br /><br />It was a relief not to have to deal with death and dismemberment, though this cottontail was probably big enough to challenge my feline associate.<br /><br />I walked back the way I had come, through the gauntlet of geese, and reconnected with my precious kitty:<br /><br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-zpj0s34QlgA/WxKEtumnZVI/AAAAAAAACYg/P5MH3F_1PdQr-7GTySIPBAyDaGOKU9_qACLcBGAs/s1600/IMG_0017.JPG\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-zpj0s34QlgA/WxKEtumnZVI/AAAAAAAACYg/P5MH3F_1PdQr-7GTySIPBAyDaGOKU9_qACLcBGAs/s400/IMG_0017.JPG\" width=\"300\" height=\"400\" data-original-width=\"1200\" data-original-height=\"1600\" /></a></div><br /><br />What a precious, precious kitty!  It being a muggy day, I decided to groom Ginger a bit, merely using my fingers to comb some excess fur off of her muscular form.  Ginger is one of those easily distracted cats, she typically never sat still long enough to brush, but I learned my lesson, and decided to apply <a href=\"https://www.simplypsychology.org/operant-conditioning.html\">operant conditioning</a>.  If you want the cat to behave in a particular manner, reward that behavior... a handful of kibble, a small mountain of fur, and Ginger was as pretty as a picture.<br />","tags":[],"publishedDate":"2018-06-02T20:30:07Z","harvestDate":"2018-06-02T21:24:27Z","estimatedPublishedDate":"2018-06-02T20:30:07Z","url":"http://ct.moreover.com/?a=34207111073&p=1u0&v=1&x=4ZeNTHV3W5vvDC5spaddtg","originalUrl":"http://bigbadbaldbastard.blogspot.com/2018/06/walking-with-and-without-ginger.html","commentsUrl":"http://www.blogger.com/comment.g?blogID=8526498499129692237&postID=392232488566698329&isPopup=true","outboundUrls":["https://2.bp.blogspot.com/-SMCu-dIi-gA/WxKEGuc8lhI/AAAAAAAACYY/8XnP48eKb3IRJR_0ZdOU_YN6xBVpBMmQwCLcBGAs/s1600/IMG_0016.JPG","https://1.bp.blogspot.com/-zpj0s34QlgA/WxKEtumnZVI/AAAAAAAACYg/P5MH3F_1PdQr-7GTySIPBAyDaGOKU9_qACLcBGAs/s1600/IMG_0017.JPG","https://www.simplypsychology.org/operant-conditioning.html"],"wordCount":"301","dataFormat":"text","duplicateGroupId":"34207111073","media":{"audio":[],"images":[{"url":"https://2.bp.blogspot.com/-SMCu-dIi-gA/WxKEGuc8lhI/AAAAAAAACYY/8XnP48eKb3IRJR_0ZdOU_YN6xBVpBMmQwCLcBGAs/s400/IMG_0016.JPG"},{"url":"https://1.bp.blogspot.com/-zpj0s34QlgA/WxKEtumnZVI/AAAAAAAACYg/P5MH3F_1PdQr-7GTySIPBAyDaGOKU9_qACLcBGAs/s400/IMG_0017.JPG"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Big Bad Bald Bastard","publishingPlatform":{}},"licenses":[],"source":{"name":"Big Bad Bald Bastard","homeUrl":"http://bigbadbaldbastard.blogspot.com/","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"114429740","name":"Big Bad Bald Bastard","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"40009","inboundLinkCount":"10"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990343}