{"sequenceId":"845362182029","id":"34207110670","language":"English","title":"Received Ideas in Quotes 10","content":"In Ireland, it's said that you leave a bit of your soul trapped in everything you crochet. So to avoid this, you should always work in a hidden mistake so that your soul can escape. (Liza Frank @lilithepunk) The Earl of Morton was executed in 1581 on a guillotine he had himself imported from France. (Twitter) NEWSPAPER is the abbreviation for *NORTH , EAST , WEST , SOUTH , PAST And PRESENT EVENTS  REPORT. (Twitter) \"Pinny\" comes from pinafore, referring to the old method of pinning an apron into place on the chest. (Lucy Adlington, Stitches in Time) By 1868 the design [of the Plimsoll shoe] included a horizontal line around the sole, reminiscent of the lines newly marked on British ships, thanks to the 1876 Merchant Shipping Act (these were to show the limit of displacement, following scandals of overloading)... The Act had been introduced by Samuel Plimsoll, who therefore indirectly gave his name to the shoes, now affectionately known as plimsolls or plimmies, regardless of whether or not they have the line. (Lucy Adlington, Stitches in Time) There is a widespread belief that \"daps\" [for Plimsolls] is taken from a factory sign – \"Dunlop Athletic Plimsoles\" which was called \"the DAP factory\". (Wikipedia It also says that they’re called “sand shoes” because wearing them is like walking on sand. And they are really \"plimsoles\" because you wear them on your soles.) The two-tone co-respondent shoes of the 1920s and 1930s were so named because they were associated with the sort of person who would be named as a co-respondent in a divorce petition. Divorcee Wallis Simpson, future bride of Edward VIII, wore them – and that was enough to give a taint of scandal to the style. (Lucy Adlington, Stitches in Time) ‘Reticule’ is supposedly a contraction of ridiculous, which was the alleged male response to this frivolous accessory. (Lucy Adlington, Stitches in Time It's from Latin rēticulum, diminutive of rēte, says the dictionary. Reticules were sometimes called “ridicules”, but that was a joke.) Haversack, which was originally a soldier’s bag to carry haver-cakes – oat rations. (Lucy Adlington, Stitches in Time It does derive from \"oat bag\".) The first cravats are widely supposed to have been introduced to France and England by dashing Croatian mercenaries in the early 17th century, but there are other less romantic etymologies that suggest mangled forms of Turkish and Hungarian words – kyrabacs and korbacs – both of which mean a long, slender object. The French cravache, or horsewhip, is another source given for the English term ‘cravat’. (Lucy Adlington, Stitches in Time Croatia is Hrvatska.) She had read somewhere that if you ate pigeon every day for forty days you would die. (A Tale of Two Families, Dodie Smith) Beau Brummell spent nine hours a day in the preparation of his toilet, sent his laundry to France, and wiped his razor on pages from first editions of the classics. (Cecil Beaton, Glass of Fashion) Digestive biscuits are called “digestives” because it was believed that the large amount of baking soda they contained would act as an antacid. (Passport.topix.com They contain bran and wheatgerm, and large amounts of baking soda would make them inedible.) Barbers used to double as surgeons, “which is why surgeons today take the title Mr rather than Dr - being a doctor used to be a much more respectable profession than a surgeon.” (RM) Aldi checkouts are the fastest, but “How does Aldi propose to hurry up those dozy shoppers who take an age to produce their wallet/purse/card at the end...? It’s almost as if having to pay shocks some people anew each time.\" (Carol Midgley in The Times lifts an old slur from Bill Bryson's Notes from a Small Island, 1995.) The story is widely told that the borough council demanded that Wren should insert additional columns within the covered area [of the Windsor Guildhall], in order to support the weight of the heavy building above; Wren, however, was adamant that these were not necessary. Eventually the council insisted and, in due course, the extra supporting columns were built, but Wren made them slightly short, so that they do not quite touch the ceiling, hence proving his claim that they were not necessary. In fact, the gaps are filled with tiles smaller than the capitals. (Wikipedia) That story is told of St Paul’s Cathedral too. (HC) I was told that was done later, when the building was beginning to show its age.  My other memory is them ageing the new paintwork by adding layer of carefully formulated grime. (JP) The London Underground was deliberately designed to bar the disabled. At the time of its Victorian design there were great numbers of disabled soldiers and there were concerns that their invalid carriages would clog the carriages and tunnels. (Via FB, source possibly Londonist) The name HAND OF GLORY comes probably from French \"main-de-gloire\", a corruption of \"mandragora\" (ie. mandrake). (JN) More here, and links to the rest.","contentWithMarkup":"In Ireland, it's said that you leave a bit of your soul trapped in everything you crochet. So to avoid this, you should always work in a hidden mistake so that your soul can escape. (Liza Frank @lilithepunk)\n\nThe Earl of Morton was executed in 1581 on a guillotine he had himself imported from France. (Twitter)\nNEWSPAPER is the abbreviation for *NORTH , EAST , WEST , SOUTH , PAST And PRESENT <img src=\"http://feeds.feedburner.com/~r/blogspot/oFFuY/~4/jXZABRX0CPI\" height=\"1\" width=\"1\" alt=\"\"/>","tags":["cliches","everybody knows","old wives' tales","received ideas","received wisdom"],"publishedDate":"2018-06-02T19:07:28Z","harvestDate":"2018-06-02T21:24:22Z","estimatedPublishedDate":"2018-06-02T19:07:28Z","url":"http://ct.moreover.com/?a=34207110670&p=1u0&v=1&x=YL5qSU2066CRc4tFUCrJag","originalUrl":"http://wordcount-richmonde.blogspot.com/2018/06/received-ideas-in-quotes-10.html","commentsUrl":"http://wordcount-richmonde.blogspot.com/2018/06/received-ideas-in-quotes-10.html#comment-form","outboundUrls":["https://4.bp.blogspot.com/-gwrv9Md66U4/WxLqygyW-HI/AAAAAAAAF50/_XUGj8PJLN0Huxbqv7FisJa9Tg568-ejwCLcBGAs/s1600/unique-irish-crochet-wedding-dress-custom-made.jpg"],"wordCount":"815","dataFormat":"text","duplicateGroupId":"34207110670","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"TONE Co Ltd","symbol":"5967","exchange":"TKS","isin":"JP3860800006","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"Lucy R. Fisher","publishingPlatform":{}},"licenses":[],"source":{"name":"The Art of Words","homeUrl":"http://wordcount-richmonde.blogspot.com/","location":{},"feed":{"id":"98056505","name":"The Art of Words","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"Ramblings about words, art, books, the media and Golden Age detective stories","tags":["quotes","cliches","mantras","English","inspiration","writing","euphemisms","good English","grammar","words","art","advice","metaphors","bad English","figures of speech","Agatha Christie","poetry","whatever happened to","London","haiku","bygones","inspirational quotes","platitudes","adages","buzz words"],"language":"English","dataFormat":"text","rank":{"autoRank":"7","autoRankOrder":"121620","inboundLinkCount":"1"},"inWhiteList":"true","autoTopics":["ugc food feeds","ugc media feeds"]}},"es_id":86990321}