{"sequenceId":"845367381098","id":"34207265079","language":"English","title":"ColourPop Filter Concealer","content":"Where I got it: I got this from the ColouPop website for USD$6.00 each. I have seen these compared to the Tarte ShapeTape and some beauty YouTubers really like these. Also, they are so affordable, what’s not to like? I ordered these on 30/4 and they arrived on 10/5 along with the Supernova Eyeshadows I ordered (exxxcited!!). What I got: I have shade 10 and 14 of the ColourPop Filter Concealer. Our lightweight, creamy concealer was formulated with soft blurring pigments to give you a crease-proof, matte finish. No filter needed. Fair 10 was also known as Fair 5. It is suitable for light skin with golden undertones. Fair 14 was also known as Light Neutral 15. It is suitable for light skin with neutral undertones. ColourPop Filter Concealer ColourPop Filter Concealer How I find it: These have been compared to the cult favourite ShapeTape and the likes of Too Face Born This Way concealers in regards to how pigmented, blendable and high coverage they are. The first impression on a swatch on the back of my hand, it is really creamy and not streaky at all. It is really high coverage and a little goes a long way. It has this new style of doe-foot applicator where both side is flat, so I think they take the product from the tube better. The tube is clear so you can clearly see the shade inside. So with the shade, I have chosen from the website, you can filter the shades of the concealer by your skin lightness/darkness (Fair, light, medium, medium dark, dark, deep dark) and then by the undertone (warm and cool). I have chosen Fair 14 as my concealer shade and based on this shade the website recommends Fair 10 as my highlighting shade. Honestly, Fair 14 and Fair 10 are quite different in undertones, so I’m not too sure how they are complementing each other. Fair 10 has an obvious warm undertone even though it is much lighter than Fair 14 and Fair 14 looks almost pink right beside Fair 10. It’s not crazily pink, but when placed side by side, there is a stark difference. ColourPop Filter Concealer ColourPop Filter Concealer Overall: The first time I wore this concealer I didn’t really think much about it and went about it as I usually do. I apply the concealer directly to my under eye area and blend it out with a mini damp blending sponge. It was really patchy to the point that I had to remove it! Goodness me! I tried again after applying a bit of eye cream to the area first, then the concealer and it worked much better. I definitely thing that you need plenty of hydration and moisture to the area you want to use it on and don’t use a thick layer. It is definitely full coverage and can be a bit drying on the skin. Both shades are quite light and I find myself using Light 14 more than Light 10 because Light 1 really is quite fair on me. I needed to use Light 10 much sparingly to pull it off. As for a comparison with the Tarte ShapeTape, I prefer Tarte because it is much creamier than ColourPop. I also find Tarte is a bit easier to blend without getting streaky or patchy. Both crease on me so I will need to set it with powder or bake under my eyes. However, with this price, I don’t think it’s much to complain about! You may also enjoy: Rimmel Insta Fix & Go 2 in 1 Primer & Setting … Maybelline Pure Mineral Oil-Serum BB Too Faced Born This Way Concealer Wet n Wild Hello Halo Liquid Highlighter","contentWithMarkup":"<p><img src=\"http://www.bellyrubzbeauty.com/wp-content/uploads/2018/05/snapseed-16-800x800.jpg\" alt=\"ColourPop Filter Concealer\" width=\"320\" /></p>\n<p>Where I got it: I got this from the ColouPop website for USD$6.00 each. I have seen these compared to the Tarte ShapeTape and some beauty YouTubers really like these. Also, they are so affordable, what’s not to like? I ordered…</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.bellyrubzbeauty.com/2018/06/03/colourpop-filter-concealer/\">ColourPop Filter Concealer</a> appeared first on <a rel=\"nofollow\" href=\"http://www.bellyrubzbeauty.com\">- - Bellyrubz Beauty - -</a>.</p>","tags":["Makeup review","ColourPop","concealer","full coverage concealer","makeup","no filter concealer","review"],"publishedDate":"2018-06-02T22:00:21Z","harvestDate":"2018-06-02T22:00:41Z","estimatedPublishedDate":"2018-06-02T22:00:21Z","url":"http://ct.moreover.com/?a=34207265079&p=1u0&v=1&x=m-0qWz1VbF7hNbxc3d6IEQ","originalUrl":"http://www.bellyrubzbeauty.com/2018/06/03/colourpop-filter-concealer/","commentsUrl":"http://www.bellyrubzbeauty.com/2018/06/03/colourpop-filter-concealer/#respond","outboundUrls":[],"wordCount":"594","dataFormat":"text","duplicateGroupId":"34207265079","media":{"audio":[],"images":[{"url":"http://www.bellyrubzbeauty.com/wp-content/uploads/2018/05/snapseed-16-800x800.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Kitty Tam","publishingPlatform":{}},"licenses":[],"source":{"name":"– – Bellyrubz Beauty – –","homeUrl":"http://www.bellyrubzbeauty.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"436177016","name":"– – Bellyrubz Beauty – –","mediaType":"Blog","publishingPlatform":"WordPress","generator":"https://wordpress.org/?v=4.9.6","description":"Skincare and makeup reviews by Kitty Tam","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"9","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":["ugc health feeds"]}},"es_id":86994901}