{"sequenceId":"845362270194","id":"34207113571","language":"English","title":"Shots fired at Bronx mosque","content":"[ooyala player_id=\"71fea79861d14fce867bc2d59a66edd8\" auto=\"true\" width=\"1920\" height=\"1080\" pcode=\"hpOTQyOnmbX84Mb9rpsdJwTfN9uo\" code=\"ZmdjRoZjE6pC83YgUtA9WHLI9TsWmZc9\"]  MOTT HAVEN, the Bronx — For the second straight year Masjid Ebun Abass on Alexander Avenue in the Bronx has been shot at during Ramadan.  A hail of pellets fired from a BB gun blew out the front glass door of the Islamic Cultural Center during a prayer service.  Deputy Imam Mamadou Kamara said he told worshippers not be deterred by these cowardly acts of terrorism.  \"Don't be afraid nobody can take your faith from you,\" he said.  Kamara showed PIX 11 the blown out door that shattered when pellets shot from a BB gun sprayed the front of this mosque earlier in the week.  It happened during a 10 p.m. prayer service.  A teenager who was praying was struck in the hand, the injury was not serious.  \"We don't know what he has in the back of his head, and he can't do this because this is a hate crime,\" said Kamara  Prayers services continue, but are now under heavy 24-hour police presence.  Damage from previous attacks on the mosque is still visible.  You can see holes in the glass from one of the four times the mosque was shot at during Ramadan last year.  \"We have to come together and work together. It doesn't matter what religion you're from or what you're background is, if we have an issue come forward, and we can sit down and talk,\" said the deputy Imam.  Kamara said he is willing to forgive the gunman.  \"I already forgive him because this mosque is about forgiveness. So we have to forgive this type of person because he doesn't know what he is doing,\" he said.","contentWithMarkup":"[ooyala player_id=\"71fea79861d14fce867bc2d59a66edd8\" auto=\"true\" width=\"1920\" height=\"1080\" pcode=\"hpOTQyOnmbX84Mb9rpsdJwTfN9uo\" code=\"ZmdjRoZjE6pC83YgUtA9WHLI9TsWmZc9\"]\n\nMOTT HAVEN, the Bronx — For the second straight year Masjid Ebun Abass on Alexander Avenue in the Bronx has been shot at during Ramadan.\n\nA hail of pellets fired from a BB gun blew out the front glass door of the Islamic Cultural Center during a prayer service.\n\nDeputy Imam Mamadou Kamara said he told worshippers not be deterred by these cowardly acts of terrorism.\n\n\"Don't be afraid nobody can take your faith from you,\" he said.\n\nKamara showed PIX 11 the blown out door that shattered when pellets shot from a BB gun sprayed the front of this mosque earlier in the week.\n\nIt happened during a 10 p.m. prayer service.\n\nA teenager who was praying was struck in the hand, the injury was not serious.\n\n\"We don't know what he has in the back of his head, and he can't do this because this is a hate crime,\" said Kamara\n\nPrayers services continue, but are now under heavy 24-hour police presence.\n\nDamage from previous attacks on the mosque is still visible.\n\nYou can see holes in the glass from one of the four times the mosque was shot at during Ramadan last year.\n\n\"We have to come together and work together. It doesn't matter what religion you're from or what you're background is, if we have an issue come forward, and we can sit down and talk,\" said the deputy Imam.\n\nKamara said he is willing to forgive the gunman.\n\n\"I already forgive him because this mosque is about forgiveness. So we have to forgive this type of person because he doesn't know what he is doing,\" he said.","tags":["Bronx","News"],"publishedDate":"2018-06-02T21:24:44Z","harvestDate":"2018-06-02T21:24:51Z","estimatedPublishedDate":"2018-06-02T21:24:44Z","url":"http://ct.moreover.com/?a=34207113571&p=1u0&v=1&x=iKhoa3FKAJ3K1DwqjsQ3Mg","originalUrl":"http://pix11.com/2018/06/02/shots-fired-at-bronx-mosque/","outboundUrls":[],"wordCount":"276","dataFormat":"text","duplicateGroupId":"34207113571","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"527737"},"adultLanguage":"false","topics":[{"name":"Religion news","group":"Society"}],"companies":[],"author":{"name":"Kristine Garcia","publishingPlatform":{"userId":"75639475"}},"licenses":[],"source":{"name":"WPIX 11 New York","homeUrl":"http://pix11.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"322730879","name":"WPIX 11 New York","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"41640108","generator":"http://wordpress.com/","description":"New York News, Weather, Entertainment, Transit and More","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"1","autoRankOrder":"610","inboundLinkCount":"5745"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990455}