{"sequenceId":"845366370369","id":"34207240699","language":"English","title":"Working On A \"Families Of The Dump\" Presentation","content":"Over the last month I have been working on a presentation of the \"Families of the Dump\" project. It will include a biography of myself (requested) as well as section detailing fundraising. The entire presentation needs to be completed by this coming Tuesday. I will then send it down East to my contact, Bob C in Toronto. Hopefully this will lead to an exhibition in Toronto during the Scotiabank Contact Photography Festival 2019. There might also be a fund raiser to help the the families and the potential for more than one exhibition, possibly multiple exhibitions in Ontario and Quebec. Will see how this all goes down, lots of loose strings, not sure if any good things will happen or if it will all lead to nothing. We can only try to do our best, and hope for a positive outcome!!","contentWithMarkup":"<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">Over the last month I have been working on a presentation of the \"Families of the Dump\" project. It will include a biography of myself (requested) as well as section detailing fundraising. The entire presentation needs to be completed by this coming Tuesday. I will then send it down East to my contact, Bob C in Toronto. Hopefully this will lead to an exhibition in Toronto during the Scotiabank Contact Photography Festival 2019. There might also be a fund raiser to help the the families and the potential for more than one exhibition, possibly multiple exhibitions in Ontario and Quebec.<br /><br />Will see how this all goes down, lots of loose strings, not sure if any good things will happen or if it will all lead to nothing. We can only try to do our best, and hope for a positive outcome!!</div><img src=\"http://feeds.feedburner.com/~r/YaumsPhotoDiary/~4/SYmrwUnE2vo\" height=\"1\" width=\"1\" alt=\"\"/>","tags":[],"publishedDate":"2018-06-02T13:28:54Z","harvestDate":"2018-06-02T21:56:16Z","estimatedPublishedDate":"2018-06-02T13:28:54Z","url":"http://ct.moreover.com/?a=34207240699&p=1u0&v=1&x=GMIVRH5kyQ4EeeQJBpP5GQ","originalUrl":"http://gerryyaum.blogspot.com/2018/06/working-on-families-of-dump-presentation.html","outboundUrls":[],"wordCount":"140","dataFormat":"text","duplicateGroupId":"34205035016","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Gerry Yaum","publishingPlatform":{}},"licenses":[],"source":{"name":"YAUM's PHOTO DIARY","homeUrl":"http://gerryyaum.blogspot.com/","location":{"country":"Canada","countryCode":"CA","region":"Americas","subregion":"Northern America"},"feed":{"id":"126886681","name":"YAUM's PHOTO DIARY","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","tags":["8","ba","e","he","javascript:void(0)","t","t tr","thing","v","ๅ"],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994319}