{"sequenceId":"845367207615","id":"34207259462","language":"English","title":"Letters to the Editor | Your Opinions","content":"Why is the prom always on Good Friday? Dear Editor: When I moved to Walterboro 30 years ago, it quickly became very apparent that this was a Christian community. There are numerous churches in town, as well as every few miles on the roads in the country. Some people proudly profess their Christianity in many ways every day. To me, Christian means you believe in Jesus Christ. He is important, not because He was born and we celebrate that at Christmas, but because He rose from the dead. But before He was able to rise, He died for our sins. We mark this event on Good Friday. It is a solemn day for Christians. And that is followed by Easter, when we celebrate the risen Christ, our redeemer. So explain to me why no ministers, no Christians, have objected to the Junior-Senior Prom at the local high school being held on Good Friday. That is traditionally the beginning of spring break and allows participants to go to the beach for the week of spring break. Which means families are not together for Easter. This year, that schedule didn’t really work out for the beach because it was cold. The break was the first week in April. Next year, spring break is scheduled three weeks later — starting on the 22nd, with the prom presumably on the 19th. My next question is “Why is spring break tied to Easter?” As a former teacher, I know teachers will be ready for a break around the second week of April, not the fourth. And how close will this be to testing? I think parents and ministers should pay attention to the school calendar and discourage the practice of having prom on Good Friday. Even if you don’t acknowledge this day, some of the florists and hairdressers and tux renters might. I think if you support the prom on Good Friday, you should give up the name Christian, because you are ignoring something very important about being a Christian.  Carol Ferrari Walterboro Evidence proves abortion is wrong Dear Editor: The author of a recent opinion piece in the newspaper celebrated her party’s successful filibuster in preventing a vote on the Personhood Bill which was before the State Senate. It is my understanding that this bill was being offered knowing full well that it would end up in the U.S. Supreme Court, thereby challenging the wrongfully decided case in 1973 of Roe v. Wade. In 1973 the U.S. Supreme Court decided that since there was no consensus as to when life begins, then abortion must be permitted for any reason a woman chooses until the child becomes viable. After viability, an abortion must still be permitted if an abortion doctor deems the abortion necessary to protect a woman’s “health” defined by the court in another ruling issued the same day as “all factors — physical, emotional, psychological, familial, and the woman’s age — relevant to the well-being of the patient.” And it was in this way that the court created a right to abort a child at any time. The fallacy of this illogical decision was the court denied life to the child in the womb, even after admitting they did not know when life begins. Science, medicine and technology have come a long way since 1973. For instance, we now know that: n When the egg and sperm come together, a totally new, unique and distinct creation (zygote) occurs as evidenced by a DNA that is different than the mother or the father. n We also know that at this point the zygote already contains all it needs to develop into a fetus and then a newborn and then an adolescent and ultimately an adult. n We know the cardiovascular system is the first major system to function. At about 18-22 days after conception the child’s heart begins beating, circulating his own blood, which is unique to that of his mother. n We now know that at just six weeks from conception, the child’s eyes and eyelids, nose, mouth and tongue are formed. n We now know that electrical brain activity can be detected at 6-7 weeks from conception, and by the 8th week, the child, now known as a fetus, has developed all of his organs and bodily structures. n Dr. Vincent J. Collins, author of the medical teaching text Principles of Anesthesiology, argues the unborn may experience pain as early as nine weeks, but certainly by 13 weeks. n We now know that by 10 weeks from conception the child can make bodily movements. n Due to advances in technology, we can now watch the active life in real-time video of a child at 20 weeks from conception — clasping his hands, sucking his thumb, yawning, stretching, getting the hiccups, covering his ears due to loud sound nearby and even smiling. n Fetal surgery being conducted today is just another example of a child being a distinct and unique human person. Life was designed to be a continuum that begins at conception and ends in natural death. It is evident that there are only four differences between the unborn and the newborn, none of which provide any relevant distinction between them. n Size – The unborn are smaller that newborns, but when does one’s size determine a person’s rights? n Level of Development – The unborn are less developed than newborns but newborns are less developed that toddlers and toddlers are less developed than adolescents and adolescents are less developed than adults. n Environment – The unborn is in a different location than the newborn but how does being in a different location suddenly change what some believe to be a non-human entity into a human entity? Clearly where one is does not determine who one is. n Degree of Dependency – If viability determines personhood, then all those on kidney machines or have heart pacemakers or take insulin must not be persons either. There is no ethical difference between an unborn child who is plugged into and dependent on his mother and a kidney patient plugged into and dependent upon a kidney machine. Thankfully, the minds of Americans are changing regarding the issue of abortion. A 2003 survey of women conducted by the Center for Gender Equality (being run at that time by former Planned Parenthood President Faye Wattleton) revealed that a majority of women, 51%, believe abortion should either never be permitted or permitted only for rape, incest or life endangerment. That means a majority of women believe abortion should only be permitted in extreme circumstances. Also in the last 25 years the Guttmacher Institute (Research Group for Planned Parenthood) has conducted two major studies asking women why they chose abortion and their answers have remained the same. Only 7% of women reported that their abortion was because of a health reason or a possible health problem with the baby, and less than one-half percent reported that their abortion was because they became pregnant as a result of rape. Since 1973, we have witnessed dramatic advances in medicine and technology that have brought the issue of when life begins into much clearer focus, resulting in the changing of many people’s attitudes and positions as the truth has been revealed. Some will try and make you believe that abortion is about a woman’s right to control her own body, or an imposition of morality, or a right of privacy, or timing, or convenience, or rape, or incest. And while these issues are important, they pale in comparison to the real issue of whether a child lives or dies. I pray this piece has brought you to a greater understanding of this important issue and I pray that we will always value life more than our own prideful and selfish desires. And what message are we sending our young people when we don’t value the lives of those yet to be born and how is it shaping their lives? I can’t help but wonder if one of the primary roots for young people’s lack of value for life is the result of our lack of value for the unborn. Roe v. Wade is dead wrong and must be changed for the sake of future generations. Genesis 1:26-27: “And God said, Let us make man in our image, after our likeness … So God created man in His own image, in the image of God created He him; male and female created He them.” KJV. Psalm 139:13-16 (David’s praise of God): “For Thou hast possessed my reins: Thou hast covered me in my mother’s womb. I will praise Thee; for I am fearfully and wonderfully made: marvelous are Thy works; and that my soul knoweth right well. My substance was not hid from Thee, when I was made in secret, and curiously wrought in the lowest parts of the earth. Thine eyes did see my substance, yet being unperfect; and in thy book all my members were written, which in continuance were fashioned when as yet there was none of them.” KJV. When we do err, may it always be on the side of life and love of God.  Bill Walker Walterboro (The information contained herein was the result of research taken from the following authors:  Kerby Anderson – B.S. Zoology- Oregon State University; M.F.S. Science Yale University; M.A. Government Georgetown University; Kennedy Institute of Bioethics  Cathy Cleaver Ruse, esq. – B.A. Communications University of South Florida; J.D. Georgetown University; Congressional Staff Counsel -US House Judiciary Committee; Lincoln Fellow-Claremont Institute; Senior Fellow-Family Research Council….  Scott Klusendorf – Speaker, Author, Guest Lecturer -B.A. English Magna Cum Laude UCLA; M.A. Christian Apologetics-Biola University; Founder & President Life Training Institute.  God – Omniscient Creator – The Bible – God’s Inspired, Inerrant, Infallible Word.)  Collusion becomes a calamity Dear Editor: The 2016 Presidential Campaign will be recorded as one of the most controversial events in American history. Our governmental system went from three branches of government to four, and a political party tried to overthrow the election of a sitting president. The Congress, the Supreme Court and the Executive branch has formed our government for over 200 years. 2016 brought us the new branch is called “Deep State,” made up of a powerful group of people who secretly manipulate people and the news to attempt to create a coup of legally elected government. Deep State is undermining the current president by opposing him 100% of the time. They ridicule and make fun of him and his family. They use innuendos, lies, rumors and false accusations on a daily basis. They control the news media across the board and use that power to challenge every decision and broadcast negative stories about him in 90% of their newscasts. A source within CNN has revealed that Wolf Blitzer has been meeting secretly with Rush Limbaugh. A source says Wolf is trying to convince Rush to support Oprah Winfrey for president. There is an unfounded report from NBC that Hillary’s attorney contacted Muelller about the dossier they gave to Justice Department. She said it was actually a report on her husband. She also stated Bill told her to lie about Benghazi because she could get by with it because she was so popular with the media. MSNBC claims someone in Senator Chuck Shumer’s office released an email that said Shumer had contacted China about acupuncture on his cranium in order to stop his headaches. Shumer has suggested burning down one of Trump’s properties and blaming it on the Boy Scouts camping out on the grounds. NBC announced early this morning that the View was being cancelled so Joy Behar can undergo shock treatment after discovering she had the lowest IQ of the entire network. The last four statements are a few examples of how the Deep State and Democrats have operated over the past year. Fake news is dangerous to everyone.  Noel Ison Walterboro","contentWithMarkup":"Why is the prom always on Good Friday? Dear Editor: When I moved to Walterboro 30 years ago, it quickly became very apparent that this was a Christian community. There are numerous churches in town, as well as every few miles on the roads in the country. Some people proudly profess their Christianity in many ways every day. To me, Christian means you believe in Jesus Christ. He is important, not because He was born and we celebrate that at Christmas, but because He rose from the dead. But before He was able to rise, He died for our sins. We mark this event on Good Friday. It is a solemn day for Christians. And that is followed by Easter, when we celebrate the risen Christ, our redeemer. So explain to me why no ministers, no Christians, have objected to the Junior-Senior Prom at the local high school being held on Good Friday. That is traditionally the beginning of spring break and allows participants to go to the beach for the week of spring break. Which means families are not together for Easter. This year, that schedule didn’t really work out for the beach because it was cold. The break was the first week in April. Next year, spring break is scheduled three weeks later — starting on the 22nd, with the prom presumably on the 19th. My next question is “Why is spring break tied to Easter?” As a former teacher, I know teachers will be ready for a break around the second week of April, not the fourth. And how close will this be to testing? I think parents and ministers should pay attention to the school calendar and discourage the practice of having prom on Good Friday. Even if you don’t acknowledge this day, some of the florists and hairdressers and tux renters might. I think if you support the prom on Good Friday, you should give up the name Christian, because you are ignoring something very important about being a Christian.  Carol Ferrari Walterboro Evidence proves abortion is wrong Dear Editor: The author of a recent opinion piece in the newspaper celebrated her party’s successful filibuster in preventing a vote on the Personhood Bill which was before the State Senate. It is my understanding that this bill was being offered knowing full well that it would end up in the U.S. Supreme Court, thereby challenging the wrongfully decided case in 1973 of Roe v. Wade. In 1973 the U.S. Supreme Court decided that since there was no consensus as to when life begins, then abortion must be permitted for any reason a woman chooses until the child becomes viable. After viability, an abortion must still be permitted if an abortion doctor deems the abortion necessary to protect a woman’s “health” defined by the court in another ruling issued the same day as “all factors — physical, emotional, psychological, familial, and the woman’s age — relevant to the well-being of the patient.” And it was in this way that the court created a right to abort a child at any time. The fallacy of this illogical decision was the court denied life to the child in the womb, even after admitting they did not know when life begins. Science, medicine and technology have come a long way since 1973. For instance, we now know that: n When the egg and sperm come together, a totally new, unique and distinct creation (zygote) occurs as evidenced by a DNA that is different than the mother or the father. n We also know that at this point the zygote already contains all it needs to develop into a fetus and then a newborn and then an adolescent and ultimately an adult. n We know the cardiovascular system is the first major system to function. At about 18-22 days after conception the child’s heart begins beating, circulating his own blood, which is unique to that of his mother. n We now know that at just six weeks from conception, the child’s eyes and eyelids, nose, mouth and tongue are formed. n We now know that electrical brain activity can be detected at 6-7 weeks from conception, and by the 8th week, the child, now known as a fetus, has developed all of his organs and bodily structures. n Dr. Vincent J. Collins, author of the medical teaching text Principles of Anesthesiology, argues the unborn may experience pain as early as nine weeks, but certainly by 13 weeks. n We now know that by 10 weeks from conception the child can make bodily movements. n Due to advances in technology, we can now watch the active life in real-time video of a child at 20 weeks from conception — clasping his hands, sucking his thumb, yawning, stretching, getting the hiccups, covering his ears due to loud sound nearby and even smiling. n Fetal surgery being conducted today is just another example of a child being a distinct and unique human person. Life was designed to be a continuum that begins at conception and ends in natural death. It is evident that there are only four differences between the unborn and the newborn, none of which provide any relevant distinction between them. n Size – The unborn are smaller that newborns, but when does one’s size determine a person’s rights? n Level of Development – The unborn are less developed than newborns but newborns are less developed that toddlers and toddlers are less developed than adolescents and adolescents are less developed than adults. n Environment – The unborn is in a different location than the newborn but how does being in a different location suddenly change what some believe to be a non-human entity into a human entity? Clearly where one is does not determine who one is. n Degree of Dependency – If viability determines personhood, then all those on kidney machines or have heart pacemakers or take insulin must not be persons either. There is no ethical difference between an unborn child who is plugged into and dependent on his mother and a kidney patient plugged into and dependent upon a kidney machine. Thankfully, the minds of Americans are changing regarding the issue of abortion. A 2003 survey of women conducted by the Center for Gender Equality (being run at that time by former Planned Parenthood President Faye Wattleton) revealed that a majority of women, 51%, believe abortion should either never be permitted or permitted only for rape, incest or life endangerment. That means a majority of women believe abortion should only be permitted in extreme circumstances. Also in the last 25 years the Guttmacher Institute (Research Group for Planned Parenthood) has conducted two major studies asking women why they chose abortion and their answers have remained the same. Only 7% of women reported that their abortion was because of a health reason or a possible health problem with the baby, and less than one-half percent reported that their abortion was because they became pregnant as a result of rape. Since 1973, we have witnessed dramatic advances in medicine and technology that have brought the issue of when life begins into much clearer focus, resulting in the changing of many people’s attitudes and positions as the truth has been revealed. Some will try and make you believe that abortion is about a woman’s right to control her own body, or an imposition of morality, or a right of privacy, or timing, or convenience, or rape, or incest. And while these issues are important, they pale in comparison to the real issue of whether a child lives or dies. I pray this piece has brought you to a greater understanding of this important issue and I pray that we will always value life more than our own prideful and selfish desires. And what message are we sending our young people when we don’t value the lives of those yet to be born and how is it shaping their lives? I can’t help but wonder if one of the primary roots for young people’s lack of value for life is the result of our lack of value for the unborn. Roe v. Wade is dead wrong and must be changed for the sake of future generations. Genesis 1:26-27: “And God said, Let us make man in our image, after our likeness … So God created man in His own image, in the image of God created He him; male and female created He them.” KJV. Psalm 139:13-16 (David’s praise of God): “For Thou hast possessed my reins: Thou hast covered me in my mother’s womb. I will praise Thee; for I am fearfully and wonderfully made: marvelous are Thy works; and that my soul knoweth right well. My substance was not hid from Thee, when I was made in secret, and curiously wrought in the lowest parts of the earth. Thine eyes did see my substance, yet being unperfect; and in thy book all my members were written, which in continuance were fashioned when as yet there was none of them.” KJV. When we do err, may it always be on the side of life and love of God.  Bill Walker Walterboro (The information contained herein was the result of research taken from the following authors:  Kerby Anderson – B.S. Zoology- Oregon State University; M.F.S. Science Yale University; M.A. Government Georgetown University; Kennedy Institute of Bioethics  Cathy Cleaver Ruse, esq. – B.A. Communications University of South Florida; J.D. Georgetown University; Congressional Staff Counsel -US House Judiciary Committee; Lincoln Fellow-Claremont Institute; Senior Fellow-Family Research Council….  Scott Klusendorf – Speaker, Author, Guest Lecturer -B.A. English Magna Cum Laude UCLA; M.A. Christian Apologetics-Biola University; Founder & President Life Training Institute.  God – Omniscient Creator – The Bible – God’s Inspired, Inerrant, Infallible Word.)  Collusion becomes a calamity Dear Editor: The 2016 Presidential Campaign will be recorded as one of the most controversial events in American history. Our governmental system went from three branches of government to four, and a political party tried to overthrow the election of a sitting president. The Congress, the Supreme Court and the Executive branch has formed our government for over 200 years. 2016 brought us the new branch is called “Deep State,” made up of a powerful group of people who secretly manipulate people and the news to attempt to create a coup of legally elected government. Deep State is undermining the current president by opposing him 100% of the time. They ridicule and make fun of him and his family. They use innuendos, lies, rumors and false accusations on a daily basis. They control the news media across the board and use that power to challenge every decision and broadcast negative stories about him in 90% of their newscasts. A source within CNN has revealed that Wolf Blitzer has been meeting secretly with Rush Limbaugh. A source says Wolf is trying to convince Rush to support Oprah Winfrey for president. There is an unfounded report from NBC that Hillary’s attorney contacted Muelller about the dossier they gave to Justice Department. She said it was actually a report on her husband. She also stated Bill told her to lie about Benghazi because she could get by with it because she was so popular with the media. MSNBC claims someone in Senator Chuck Shumer’s office released an email that said Shumer had contacted China about acupuncture on his cranium in order to stop his headaches. Shumer has suggested burning down one of Trump’s properties and blaming it on the Boy Scouts camping out on the grounds. NBC announced early this morning that the View was being cancelled so Joy Behar can undergo shock treatment after discovering she had the lowest IQ of the entire network. The last four statements are a few examples of how the Deep State and Democrats have operated over the past year. Fake news is dangerous to everyone.  Noel Ison Walterboro","tags":[],"publishedDate":"2018-06-02T21:00:40Z","harvestDate":"2018-06-02T21:59:35Z","estimatedPublishedDate":"2018-06-02T21:00:40Z","url":"http://ct.moreover.com/?a=34207259462&p=1u0&v=1&x=o_yeQXl1tnX-aM9z-Z6yyw","originalUrl":"http://walterborolive.com/2018/06/letters-to-the-editor-your-opinions/","outboundUrls":[],"wordCount":"1946","dataFormat":"text","duplicateGroupId":"34207259462","media":{"audio":[],"images":[{"url":"http://walterborolive.com/wp-content/uploads/2017/03/letters-to-editor-logo-new-2017.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"true","topics":[],"companies":[],"author":{"publishingPlatform":{}},"licenses":[{"name":"Publicly Available"}],"source":{"name":"Walterboro Live","homeUrl":"http://walterborolive.com","category":"Local","editorialRank":"4","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America","state":"South Carolina","county":"Colleton","zipArea":"Walterboro","zipCode":"29488"},"feed":{"id":"586460659","name":"Walterboro Live","mediaType":"News","tags":[],"language":"Unassigned","dataFormat":"text","rank":{"inboundLinkCount":"23"},"inWhiteList":"true","autoTopics":[],"editorialTopics":["Geographic","Local","Standard","News"],"genre":"General"}},"es_id":86994688}