{"sequenceId":"845367364949","id":"34207264684","language":"English","title":"I Am One With The Wind And Sky.","content":"Today is Grad night, at Disneyland.  Even though I helped get it together, and helped set it up, this year the Leadership teacher elected not to have me go.  It's a surprising burn, because this year a full half (easily) of the students are from my first class at the school, and my homeroom is composed entirely of graduates.  At one point, the Leadership had fumbled the ball, and the Grad Night was going to be a Tuesday evening in early May.  I spent some real energy in getting things set so that they would be close to the real Graduation date, in this case only a few days beforehand.  I didn't think it would cross me quite as hard as it does today...not being included despite all of the efforts put in.  Many of my homeroom students were pretty disappointed, and there really wasn't anything that I could do about it.  I explained that they were just \"adult issues,\" and that I would have made it if I could.  There's a store at Downtown Disney that is all Frozen stuff, \"Anna and Elsa's Boutique.\"  It might be one of my favorite places there, and I always get a big haul of Frozen stuff from there.  I was thinking about it when I sat down to draw today, and the quick sketch above happened.  I'm spending the afternoon with my closest friends, so that's a good thing.  I think that the Frozen cast rolling out with Cap kind of represents that, because unlike the FF, they actually like her.  Cap's flying a whole lot better these days, hence the use of the \"Let It Go\" lyric for today's title.  Have a good weekend, True Believers.","contentWithMarkup":"Today is Grad night, at Disneyland.  Even though I helped get it together, and helped set it up, this year the Leadership teacher elected not to have me go.  It's a surprising burn, because this year a full half (easily) of the students are from my first class at the school, and my homeroom is composed entirely of graduates.\n\nAt one point, the Leadership had fumbled the ball, and the Grad Night was going to be a Tuesday evening in early May.  I spent some real energy in getting things set so that they would be close to the real Graduation date, in this case only a few days beforehand.  I didn't think it would cross me quite as hard as it does today...not being included despite all of the efforts put in.\n\nMany of my homeroom students were pretty disappointed, and there really wasn't anything that I could do about it.  I explained that they were just \"adult issues,\" and that I would have made it if I could.\n\nThere's a store at Downtown Disney that is all Frozen stuff, \"Anna and Elsa's Boutique.\"  It might be one of my favorite places there, and I always get a big haul of Frozen stuff from there.  I was thinking about it when I sat down to draw today, and the quick sketch above happened.\n\nI'm spending the afternoon with my closest friends, so that's a good thing.  I think that the Frozen cast rolling out with Cap kind of represents that, because unlike the FF, they actually like her.  Cap's flying a whole lot better these days, hence the use of the \"Let It Go\" lyric for today's title.\n\nHave a good weekend, True Believers.","tags":[],"publishedDate":"2018-06-02T22:00:30Z","harvestDate":"2018-06-02T22:00:35Z","estimatedPublishedDate":"2018-06-02T22:00:30Z","url":"http://ct.moreover.com/?a=34207264684&p=1u0&v=1&x=jrda8qqZXMJ2Lw8fhKuOoA","originalUrl":"https://talesofadequacy.wordpress.com/2018/06/02/i-am-one-with-the-wind-and-sky/","outboundUrls":[],"wordCount":"285","dataFormat":"text","duplicateGroupId":"34207264684","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"9787"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"talesofadequacy","publishingPlatform":{"userId":"30483639"}},"licenses":[],"source":{"name":"Tales of Adequacy!","homeUrl":"https://talesofadequacy.wordpress.com","location":{},"feed":{"id":"228928542","name":"Tales of Adequacy!","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"31027499","generator":"http://wordpress.com/","description":"Dispensing heavy handed satire since October 2011","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994881}