{"sequenceId":"845361800740","id":"34207097690","language":"English","title":"Lawsuit claims woman captured video of Harvey Weinstein assaulting her","content":"Harvey Weinstein was facing a new rape allegation on Friday, including claims that a woman captured video of Weinstein assaulting her, as part of a lawsuit alleging that he had help covering up his misconduct with women.  The lawsuit was filed in New York by three women, including one who says Weinstein raped her at a Manhattan hotel in 2011. It comes a week after Weinstein was arrested on New York state rape and criminal sex act charges.  According to the lawsuit, Melissa Thompson met with Weinstein at his Manhattan office, where she turned on her computer’s video recording capability to help demonstrate internet technology she wanted his company to buy. The lawsuit alleged that the recorded images captured some of Weinstein’s advances.  READ MORE: Harvey Weinstein indicted on charges of rape, criminal sexual act  As she showed him the technology, Weinstein asked “So am I allowed to flirt with you?” the lawsuit said. It said Thompson, feeling cornered but wanting to finish the demonstration, responded: “Ummmmm. We’ll see. A little bit.”  Weinstein became curt and when she continued with her business presentation, he ran his hands over her back, caressed her leg and moved his hand under her dress, according to the lawsuit.  At the end of the meeting, Weinstein promised to make a deal for the technology but asked her to meet for a drink later in the day at a Manhattan hotel bar, the lawsuit said.  When she met him at the bar, according to the lawsuit, Weinstein almost immediately led her to a room at the hotel and then cornered and “out-muscled” her as she tried to fight off his advances. She alleges he then held her down and raped her.  WATCH: Harvey Weinstein appears in New York court  [tp_video id=4230734]  She did not report it to law enforcement authorities because she feared for her safety and career, the lawsuit said. “She knew that Weinstein could and would destroy her if she complained about his sexual misconduct.”  Besides Thompson, two other women made new claims in the lawsuit, which seeks class-action status to represent hundreds of other women it says were victimized by Weinstein and what it described as his enablers.  The lawsuit seeks unspecified damages as well as retribution for class members’ loss of work opportunities and “devastating damage” to their careers. It alleges racketeering, witness tampering, mail and wire fraud, assault, civil battery, negligent supervision and retention and intentional infliction of emotional distress.  READ MORE: Harvey Weinstein accusers Rose McGowan, Asia Argento, others react to arrest  The lawsuit alleges that Weinstein was supported in his sexual pursuits by film companies and dozens of workers for those companies who knew he was abusing women.  Phyllis Kupferstein, a lawyer for Weinstein, likened the lawsuit to an earlier one filed by the same lawyers on behalf of a different group of women and said the case “suffers from the same lack of merit.” Weinstein has denied sexually assaulting anyone.  Following his arrest last week, Weinstein was released on $1 million bail and is required to wear an electronic monitoring bracelet.  WATCH: Weinstein accuser Argento warns others at Cannes  [tp_video id=4220893]  “Harvey Weinstein may have been put in handcuffs for his assault on two women, but we are working to see a day of justice for the hundreds of women who were exploited for Weinstein’s sexual gratification and silenced by this ring of conspirators,” said Elizabeth Fegan, an attorney who worked on Friday’s lawsuit.  In a release, Thompson said she was referred to Ben Brafman’s law firm after allegations from dozens of women made headlines last fall. Brafman, who represents Weinstein in his criminal case, said in a statement Friday that his firm has never represented Thompson and he has never met her or the other women identified in the new lawsuit.  READ MORE: Gwyneth Paltrow says Brad Pitt threatened to ‘kill’ Harvey Weinstein over alleged assault  Caitlin Dulany, a second plaintiff, was sexually assaulted, battered, threatened and falsely imprisoned in Weinstein’s hotel suite during the Cannes Film Festival in 1996, the lawsuit said.  Larissa Gomes, the third plaintiff, went to discuss work opportunities in film but ended up imprisoned in Weinstein’s hotel room, threatened, battered and assaulted, the lawsuit said.  Through her law firm, Thompson said she was comfortable with being named publicly. Dulany and Gomes have previously spoken publicly. The Associated Press does not identify alleged victims of sexual assaults unless they come forward publicly.","contentWithMarkup":"<a href=\"http://www.globalnews.ca/tag/harvey-weinstein\" target=\"_blank\" rel=\"noopener\">Harvey Weinstein</a> was facing a new rape allegation on Friday, including claims that a woman captured video of Weinstein assaulting her, as part of a lawsuit alleging that he had help covering up his misconduct with women.\n\nThe lawsuit was filed in New York by three women, including one who says Weinstein raped her at a Manhattan hotel in 2011. It comes a week after Weinstein was arrested on New York state rape and criminal sex act charges.\n\nAccording to the lawsuit, Melissa Thompson met with Weinstein at his Manhattan office, where she turned on her computer’s video recording capability to help demonstrate internet technology she wanted his company to buy. The lawsuit alleged that the recorded images captured some of Weinstein’s advances.\n\n<strong>READ MORE: <a href=\"https://globalnews.ca/news/4243470/harvey-weinstein-indicted-rape-criminal-sexual-act/\">Harvey Weinstein indicted on charges of rape, criminal sexual act</a></strong>\n\nAs she showed him the technology, Weinstein asked “So am I allowed to flirt with you?” the lawsuit said. It said Thompson, feeling cornered but wanting to finish the demonstration, responded: “Ummmmm. We’ll see. A little bit.”\n\nWeinstein became curt and when she continued with her business presentation, he ran his hands over her back, caressed her leg and moved his hand under her dress, according to the lawsuit.\n\nAt the end of the meeting, Weinstein promised to make a deal for the technology but asked her to meet for a drink later in the day at a Manhattan hotel bar, the lawsuit said.\n\nWhen she met him at the bar, according to the lawsuit, Weinstein almost immediately led her to a room at the hotel and then cornered and “out-muscled” her as she tried to fight off his advances. She alleges he then held her down and raped her.\n\n<strong>WATCH: Harvey Weinstein appears in New York court</strong>\n\n<strong>[tp_video id=4230734]</strong>\n\nShe did not report it to law enforcement authorities because she feared for her safety and career, the lawsuit said. “She knew that Weinstein could and would destroy her if she complained about his sexual misconduct.”\n\nBesides Thompson, two other women made new claims in the lawsuit, which seeks class-action status to represent hundreds of other women it says were victimized by Weinstein and what it described as his enablers.\n\nThe lawsuit seeks unspecified damages as well as retribution for class members’ loss of work opportunities and “devastating damage” to their careers. It alleges racketeering, witness tampering, mail and wire fraud, assault, civil battery, negligent supervision and retention and intentional infliction of emotional distress.\n\n<strong>READ MORE: <a href=\"https://globalnews.ca/news/4231070/harvey-weinstein-accusers-react-to-arrest/\">Harvey Weinstein accusers Rose McGowan, Asia Argento, others react to arrest</a></strong>\n\nThe lawsuit alleges that Weinstein was supported in his sexual pursuits by film companies and dozens of workers for those companies who knew he was abusing women.\n\nPhyllis Kupferstein, a lawyer for Weinstein, likened the lawsuit to an earlier one filed by the same lawyers on behalf of a different group of women and said the case “suffers from the same lack of merit.” Weinstein has denied sexually assaulting anyone.\n\nFollowing his arrest last week, Weinstein was released on $1 million bail and is required to wear an electronic monitoring bracelet.\n\n<strong>WATCH: Weinstein accuser Argento warns others at Cannes</strong>\n\n<strong>[tp_video id=4220893]</strong>\n\n“Harvey Weinstein may have been put in handcuffs for his assault on two women, but we are working to see a day of justice for the hundreds of women who were exploited for Weinstein’s sexual gratification and silenced by this ring of conspirators,” said Elizabeth Fegan, an attorney who worked on Friday’s lawsuit.\n\nIn a release, Thompson said she was referred to Ben Brafman’s law firm after allegations from dozens of women made headlines last fall. Brafman, who represents Weinstein in his criminal case, said in a statement Friday that his firm has never represented Thompson and he has never met her or the other women identified in the new lawsuit.\n\n<strong>READ MORE: <a href=\"https://globalnews.ca/news/4228396/gwyneth-paltrow-brad-pitt-threatened-to-kill-harvey-weinstein/\">Gwyneth Paltrow says Brad Pitt threatened to ‘kill’ Harvey Weinstein over alleged assault</a></strong>\n\nCaitlin Dulany, a second plaintiff, was sexually assaulted, battered, threatened and falsely imprisoned in Weinstein’s hotel suite during the Cannes Film Festival in 1996, the lawsuit said.\n\nLarissa Gomes, the third plaintiff, went to discuss work opportunities in film but ended up imprisoned in Weinstein’s hotel room, threatened, battered and assaulted, the lawsuit said.\n\nThrough her law firm, Thompson said she was comfortable with being named publicly. Dulany and Gomes have previously spoken publicly. The Associated Press does not identify alleged victims of sexual assaults unless they come forward publicly.","tags":["Crime","Entertainment","News","World","Cannes Film Festival","Harvey Weinstein","harvey weinstein rape","Metoo","Rape","sex assault","Sexual Assault","Weinstein lawsuit","harvey-weinstein"],"publishedDate":"2018-06-02T21:20:06Z","harvestDate":"2018-06-02T21:21:06Z","estimatedPublishedDate":"2018-06-02T21:20:06Z","url":"http://ct.moreover.com/?a=34207097690&p=1u0&v=1&x=eqdMYfRaOwSb2y5gQKFqBw","originalUrl":"http://globalnews.ca/news/4249364/harvey-weinstein-sexual-assault-video-lawsuit/","outboundUrls":[],"wordCount":"736","dataFormat":"text","duplicateGroupId":"34199467866","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"4249364"},"adultLanguage":"false","topics":[{"name":"Movie business news","group":"Media"},{"name":"Lawsuits news","group":"Business"}],"companies":[],"author":{"name":"globalnewsdigital","publishingPlatform":{"userId":"46970081"}},"licenses":[],"source":{"name":"Global News","homeUrl":"http://globalnews.ca","location":{"country":"Canada","countryCode":"CA","region":"Americas","subregion":"Northern America"},"feed":{"id":"347408587","name":"Global News","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"43869434","generator":"http://wordpress.com/","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"3","autoRankOrder":"4373","inboundLinkCount":"298"},"inWhiteList":"true","autoTopics":[]}},"es_id":86989860}