{"sequenceId":"845366352829","id":"34207240076","language":"English","title":"A Summer Wedding, 1952; Part 1","content":"Introduction:  When my husband's Aunt Sue passed away in 2014, we discovered a box of letters she'd kept,  some written to Sue and some to her sister Mary from 1950 to 1952. The letters told the family events of those years and they inspired me to create a story around them. While my words in \"A Summer Wedding\" are my own, every letter in the story is straight from the pages of actual letters these two sisters received from their father Henry, and on an occasion or two, their mother Catherine.  February 25 Catherine Catherine took her knitting to the living room so that she could see the mailman when he approached. No letter from Gert for two weeks, and only a skimpy paragraph from Betty Lou. Don’t my sisters know how much I depend on them for news? I hate being so far away from everyone. Her brow furrowed as she glanced over to the stairs that led to their bedroom, where Henry was napping. If only he were feeling better. It was strange to have him home in the middle of the day. Over the years, Henry had spent most of his waking hours at the office or on the road, putting the demands of International Harvester above everything else. She was accustomed to being home alone, organizing her day to suit herself. But now, Henry was ailing, his work schedule cut to almost nothing. Tiptoeing through each day, she considered how every move might affect her sick husband. Would he ever recover his strength and energy? She closed her eyes and silently prayed. Please, Mother Mary, make him well.             If only we weren’t in Spokane, so far from home. Looking out at the snow-covered lawn, she chided herself. Now, Catherine, buck up. You’ve been here in Spokane for two years. It is home. And aren’t you happy that Mary is here living with you? Yet, home would always be Minot, no matter how long they’d been away. She chewed her lower lip, reminiscing. In Minot, it seemed as if she knew everybody. Even a trip to the market met running into friends. Attending Mass was not just a spiritual occasion, but a social one as well. She pictured herself back at St. Leo’s, Henry by her side, surrounded by a cocoon of aunts, uncles, cousins, and long-time friends. But, a wife must go where her husband takes her, so she’d packed up three times over the years, first to Eau Claire, then Milwaukee, and next, Spokane. Each time she’d made a new life for herself, with church, Red Cross volunteering, bridge clubs, and settled in.  But Spokane was different. When Henry announced that the company was sending him to Washington, she was proud of him, of course, but couldn’t muster enthusiasm about the move. So far away! Henry, thrilled with his promotion, had gone out to begin his new job while she took care of everything back in Wisconsin. What to take, what to store had consumed her as she’d compiled lists, arranged for movers, oversaw the careful packing of her Wedgewood and Waterford. When they’d finally unpacked and settled in, she’d found the people standoffish. Or maybe it was she who hadn’t warmed up to them.  They’d left their older daughter Mary in Milwaukee, who scrambled to find a suitable apartment when all the returning GI’s were clamoring for housing. Poor Mary! After her broken engagement, she’d left Milwaukee and now lived with them. Catherine was solicitous of her daughter’s heartbreak, but it had brought her to Spokane. At least one of her chicks was back in the nest!  Catherine’s knitting needles clacked together while she added a row to the brilliant red scarf she was making. The repetitious motions soothed her as looked around the room, taking comfort in being surrounded by the pieces she treasured – the ivory damask Queen Anne sofa, the maroon rocking chair, the foot stool covered in the needlepoint she’d stitched. Henry had been lucky to find them a place to live with housing in short supply. Somewhere tucked in a drawer was his letter describing the details of the house. The dear man, measuring every room and drawing floor plans. Catherine smiled as she recalled his descriptions of the wallpaper as only a man would. “Tan figured paper” in the living room, “reddish flower design” in the hall, “pinkish tinged figured paper” in the dining room. She wondered what those figures were. Vases? People? Trees? After two years of living with someone else’s choices on her walls, she’d come to accept the Grecian urns in the dining room and the palm fronds in the living room as just part of the background. Not her taste, perhaps, but suitable.  Ah! There was the mailman! She opened the door to greet him, and he handed her a stack of letters. A thick brown envelope with the company logo for Henry, two letters for Mary, and for her, one from her sister Gert – finally! -- and one from Sue. Sue! Catherine loved hearing from her second daughter, an airline stewardess. Her letters were always such a joy -- funny and full of adventure. Well, that’s our Sue. Wonder what she’s been up to now. It had been months since they’d seen her. A busy flight schedule had kept her away even at Christmas. She and Henry hadn’t been quite sure that become a stewardess as a proper career in the first place, but Sue persisted. And hadn’t they told their girls to spread their wings a bit? Sue certainly had, flitting all over the country in airplanes. Catherine knew what it was like to have a parent quash her sense of adventure, and she held her tongue about any misgivings she might have had. She set Gert’s letter aside, and slipped the letter opener through Sue’s envelope. She settled into the rocker to savor the contents.  “Dear Mother and Daddy,” the letter began, followed by questions about their health and then a brief description of her recent itinerary. Chicago, Milwaukee, D.C… Then, near the bottom of the page was a revelation. She was in love. His name was Ray. “You remember me mentioning him a while ago, don’t you? I’m sure I told you he was in the Air Force. We want to get married this summer.”  Catherine dropped the letter in her lap. She didn’t know how to feel. Should I be happy? Sad? Surprised? Her mind took off in twenty directions at once. My goodness! We don’t even know this man. Is he a good person? Will he make Sue happy? Where would they live? And what about a wedding? Here?  Of course, if this is what Sue wants. She rubbed her fingers across her forehead while questions continued to bombard her. She swallowed hard. This is too sudden! Does she even know him well enough? Of course, I assume he’s Catholic, but what about his family? Just what was his background? A tear threatened to roll down her cheek. What will Henry say when he wakes from his nap? She reread the letter, searching for more clues about this stranger who was to become her son-in-law. A son-in-law! Imagine! She sat back in the chair, trying to organize her thoughts.  Above her, she heard Henry stirring. She looked up to see him descending the stairs, breathing heavily. He looked pale, but she smiled at him. His illness did not seem to be improving, and the doctors had little to offer. Still a positive attitude and prayer might pull him back to good health.  “Well, dear,” she said, infusing her voice with a cheeriness she didn’t feel, “we have a letter from Sue. Sit down. You’ll be very interested in what she has to say.”  “Is she coming for a visit?” he asked. “I certainly hope she can manage a flight here sometime. But I told her I didn’t want her to go to any trouble.”  “No, no visit. Here, just read it.” He eased himself onto the sofa with a heavy sigh. She handed him the letter and leaned forward to wait for his reaction to the news.  March 2  Sue  Sue dug her key from her handbag and unlocked the door to her apartment. The other girls were away, she knew, and she was glad to have the place all to herself, a rare occurrence. She shrugged off her navy blue coat and unpinned her Northwest Airline cap, then ran her hands through her hair and kicked off her heels. After nearly a week of shuttling from Winnipeg to Minneapolis, her feet throbbed from her too-tight shoes and the air pressure of the planes. On the dining room table was a stack of mail. She and her roommates, two Joans who also flew for Northwest, had devised a system to keep their apartment organized. Letters in neat piles on the dining table were sacrosanct. Two from Ray – the darling--, one from Daddy, and what looked like a wedding invitation from a college friend. I’ll save these for after my bath, she told herself as she headed down the hall.  It had been several days since she’d mailed the letter to her parents, telling them of her engagement. Maybe a phone call would have been better than a letter. I suppose I took the chicken’s way out. But using her busy flying schedule as an excuse seemed wise. Long distance phone calls always signaled an alarm in her parents, and she felt it best to let her parents soak in the news before they replied. I need a good, hot bath before I see what Daddy has to say. Am I really engaged to a man I only met a few months ago? But Ray isn’t like other men. I’m so much in love with him!  To think she’d almost turned down the blind date her friend Carol had arranged. But Carol, a stew posted in D. C., had been persistent. “Please, Sue! Dave says his friend Ray is a great guy. Be a sport and come along.” When she’d met Ray, she’d been less than impressed with his looks. He was much taller than she, with thick horn-rimmed glasses and a military haircut. Just average. Maybe I should have stayed in tonight. By the end of the evening, she was smitten.  As soon as they’d settled into their restaurant table, Ray leaned over, lighting the cigarette she’d pulled from her handbag.  “So, tell me about yourself,” he’d begun. “What made you decide to fly?”  Sue gave the stock answer: “I love to travel” But Ray continued. What cities were her favorite? How did they compare with her hometown? And just where was her home town? He teased her a bit about loving cold climates. “And your home state of Michigan is warm?” she teased back. Their conversation flowed in an easy back-and-forth, and they’d barely tuned in to Carol and Dave. As Ray spoke with passion about his dedication to the Air Force and his love of country, his blue eyes sparkled. This is a good man.  On her two-day layover in D.C., they went out twice more – another dinner and a breakfast before she flew back to Minneapolis. A whirlwind! She’d been back to D.C. a few more times, each time discovering more to love about Ray. Would Mother and Daddy understand that I am level-headed about him? Would they be okay with my decision? Sue toweled off and wrapped herself in her bathrobe. Back in the living room, she nestled into the sofa with her stack of mail. Well, guess I’m going to find out now. She tore open the envelope from Spokane. The letter was brief, but insistent. “Call us whenever you arrive home so we can talk. We wish only for your happiness.”  Well, of course, they want to talk to me. Time to face the music! She picked up the phone and asked for the long-distance operator.     Author's note: If you'd like to continue reading this story on my blog, you can \"follow\" by signing up with your email. Then you'll get an email every time a new entry is published. Thanks for reading!... Ellen)","contentWithMarkup":"<b>Introduction:  When my husband's Aunt Sue passed away in 2014, we discovered a box of letters she'd kept,  some written to Sue and some to her sister Mary from 1950 to 1952. The letters told the family events of those years and they inspired me to create a story around them. While my words in \"A Summer Wedding\" are my own, every letter in the story is straight from the pages of actual letters these two sisters received from their father Henry, and on an occasion or two, their mother Catherine.</b>\n\n<b>February 25</b>\n<strong>Catherine</strong>\nCatherine took her knitting to the living room so that she could see the mailman when he approached. No letter from Gert for two weeks, and only a skimpy paragraph from Betty Lou. <em>Don’t my sisters know how much I depend on them for news?</em> I hate being so far away from everyone. Her brow furrowed as she glanced over to the stairs that led to their bedroom, where Henry was napping. If only he were feeling better. It was strange to have him home in the middle of the day. Over the years, Henry had spent most of his waking hours at the office or on the road, putting the demands of International Harvester above everything else. She was accustomed to being home alone, organizing her day to suit herself. But now, Henry was ailing, his work schedule cut to almost nothing. Tiptoeing through each day, she considered how every move might affect her sick husband. <em>Would he ever recover his strength and energy? She closed her eyes and silently prayed. Please, Mother Mary, make him well.</em>\n\n<a href=\"https://hellolamppost49.files.wordpress.com/2018/06/spokane-8.jpg\"><img class=\"alignnone size-medium wp-image-2308\" src=\"https://hellolamppost49.files.wordpress.com/2018/06/spokane-8.jpg?w=300\" alt=\"\" width=\"300\" height=\"183\" /></a>         <a href=\"https://hellolamppost49.files.wordpress.com/2018/06/spokane-11-3.jpg\"><img class=\"alignnone size-medium wp-image-2309\" src=\"https://hellolamppost49.files.wordpress.com/2018/06/spokane-11-3.jpg?w=300\" alt=\"\" width=\"300\" height=\"269\" /></a>\n\n<em>If only we weren’t in Spokane, so far from home.</em> Looking out at the snow-covered lawn, she chided herself. <em>Now, Catherine, buck up. You’ve been here in Spokane for two years. It is home. And aren’t you happy that Mary is here living with you? Yet, home would always be Minot, no matter how long they’d been away</em>. She chewed her lower lip, reminiscing. In Minot, it seemed as if she knew everybody. Even a trip to the market met running into friends. Attending Mass was not just a spiritual occasion, but a social one as well. She pictured herself back at St. Leo’s, Henry by her side, surrounded by a cocoon of aunts, uncles, cousins, and long-time friends. But, a wife must go where her husband takes her, so she’d packed up three times over the years, first to Eau Claire, then Milwaukee, and next, Spokane. Each time she’d made a new life for herself, with church, Red Cross volunteering, bridge clubs, and settled in.\n\nBut Spokane was different. When Henry announced that the company was sending him to Washington, she was proud of him, of course, but couldn’t muster enthusiasm about the move. So far away! Henry, thrilled with his promotion, had gone out to begin his new job while she took care of everything back in Wisconsin. What to take, what to store had consumed her as she’d compiled lists, arranged for movers, oversaw the careful packing of her Wedgewood and Waterford. When they’d finally unpacked and settled in, she’d found the people standoffish. Or maybe it was she who hadn’t warmed up to them.\n\nThey’d left their older daughter Mary in Milwaukee, who scrambled to find a suitable apartment when all the returning GI’s were clamoring for housing. Poor Mary! After her broken engagement, she’d left Milwaukee and now lived with them. Catherine was solicitous of her daughter’s heartbreak, but it had brought her to Spokane. At least one of her chicks was back in the nest!\n\nCatherine’s knitting needles clacked together while she added a row to the brilliant red scarf she was making. The repetitious motions soothed her as looked around the room, taking comfort in being surrounded by the pieces she treasured – the ivory damask Queen Anne sofa, the maroon rocking chair, the foot stool covered in the needlepoint she’d stitched. Henry had been lucky to find them a place to live with housing in short supply. Somewhere tucked in a drawer was his letter describing the details of the house.<em> The dear man, measuring every room and drawing floor plans.</em> Catherine smiled as she recalled his descriptions of the wallpaper as only a man would. “Tan figured paper” in the living room, “reddish flower design” in the hall, “pinkish tinged figured paper” in the dining room. She wondered what those figures were. Vases? People? Trees? After two years of living with someone else’s choices on her walls, she’d come to accept the Grecian urns in the dining room and the palm fronds in the living room as just part of the background. Not her taste, perhaps, but suitable.\n\nAh! There was the mailman! She opened the door to greet him, and he handed her a stack of letters. A thick brown envelope with the company logo for Henry, two letters for Mary, and for her, one from her sister Gert – finally! -- and one from Sue. Sue! Catherine loved hearing from her second daughter, an airline stewardess. Her letters were always such a joy -- funny and full of adventure. <em>Well, that’s our Sue. Wonder what she’s been up to now.</em> It had been months since they’d seen her. A busy flight schedule had kept her away even at Christmas. She and Henry hadn’t been quite sure that become a stewardess as a proper career in the first place, but Sue persisted. And hadn’t they told their girls to spread their wings a bit? Sue certainly had, flitting all over the country in airplanes. Catherine knew what it was like to have a parent quash her sense of adventure, and she held her tongue about any misgivings she might have had.\nShe set Gert’s letter aside, and slipped the letter opener through Sue’s envelope. She settled into the rocker to savor the contents.\n\n“Dear Mother and Daddy,” the letter began, followed by questions about their health and then a brief description of her recent itinerary. Chicago, Milwaukee, D.C… Then, near the bottom of the page was a revelation. She was in love. His name was Ray. “You remember me mentioning him a while ago, don’t you? I’m sure I told you he was in the Air Force. We want to get married this summer.”\n\nCatherine dropped the letter in her lap. She didn’t know how to feel. <em>Should I be happy? Sad? Surprised?</em> Her mind took off in twenty directions at once. <em>My goodness! We don’t even know this man. Is he a good person? Will he make Sue happy? Where would they live? And what about a wedding? Here?</em>\n\n<em>Of course, if this is what Sue wants</em>. She rubbed her fingers across her forehead while questions continued to bombard her. She swallowed hard. <em>This is too sudden! Does she even know him well enough? Of course, I assume he’s Catholic, but what about his family? Just what was his background?</em> A tear threatened to roll down her cheek. <em>What will Henry say when he wakes from his nap?</em> She reread the letter, searching for more clues about this stranger who was to become her son-in-law. A son-in-law! Imagine! She sat back in the chair, trying to organize her thoughts.\n\nAbove her, she heard Henry stirring. She looked up to see him descending the stairs, breathing heavily. He looked pale, but she smiled at him. His illness did not seem to be improving, and the doctors had little to offer. Still a positive attitude and prayer might pull him back to good health.\n\n“Well, dear,” she said, infusing her voice with a cheeriness she didn’t feel, “we have a letter from Sue. Sit down. You’ll be very interested in what she has to say.”\n\n“Is she coming for a visit?” he asked. “I certainly hope she can manage a flight here sometime. But I told her I didn’t want her to go to any trouble.”\n\n“No, no visit. Here, just read it.” He eased himself onto the sofa with a heavy sigh. She handed him the letter and leaned forward to wait for his reaction to the news.\n\n<strong>March 2</strong>\n\n<strong>Sue</strong>\n\nSue dug her key from her handbag and unlocked the door to her apartment. The other girls were away, she knew, and she was glad to have the place all to herself, a rare occurrence. She shrugged off her navy blue coat and unpinned her Northwest Airline cap, then ran her hands through her hair and kicked off her heels. After nearly a week of shuttling from Winnipeg to Minneapolis, her feet throbbed from her too-tight shoes and the air pressure of the planes. On the dining room table was a stack of mail. She and her roommates, two Joans who also flew for Northwest, had devised a system to keep their apartment organized. Letters in neat piles on the dining table were sacrosanct. Two from Ray – <em>the darling</em>--, one from Daddy, and what looked like a wedding invitation from a college friend. <em>I’ll save these for after my bath</em>, she told herself as she headed down the hall.\n\nIt had been several days since she’d mailed the letter to her parents, telling them of her engagement. <em>Maybe a phone call would have been better than a letter. I suppose I took the chicken’s way out.</em> But using her busy flying schedule as an excuse seemed wise. Long distance phone calls always signaled an alarm in her parents, and she felt it best to let her parents soak in the news before they replied. <em>I need a good, hot bath before I see what Daddy has to say.</em>\n<em>Am I really engaged to a man I only met a few months ago? But Ray isn’t like other men. I’m so much in love with him!</em>\n\nTo think she’d almost turned down the blind date her friend Carol had arranged. But Carol, a stew posted in D. C., had been persistent. “Please, Sue! Dave says his friend Ray is a great guy. Be a sport and come along.” When she’d met Ray, she’d been less than impressed with his looks. He was much taller than she, with thick horn-rimmed glasses and a military haircut. <em>Just average. Maybe I should have stayed in tonight.</em> By the end of the evening, she was smitten.\n\nAs soon as they’d settled into their restaurant table, Ray leaned over, lighting the cigarette she’d pulled from her handbag.\n\n“So, tell me about yourself,” he’d begun. “What made you decide to fly?”\n\nSue gave the stock answer: “I love to travel” But Ray continued. What cities were her favorite? How did they compare with her hometown? And just where was her home town? He teased her a bit about loving cold climates. “And your home state of Michigan is warm?” she teased back. Their conversation flowed in an easy back-and-forth, and they’d barely tuned in to Carol and Dave. As Ray spoke with passion about his dedication to the Air Force and his love of country, his blue eyes sparkled. <em>This is a good man</em>.\n\nOn her two-day layover in D.C., they went out twice more – another dinner and a breakfast before she flew back to Minneapolis. A whirlwind! She’d been back to D.C. a few more times, each time discovering more to love about Ray. <em>Would Mother and Daddy understand that I am level-headed about him? Would they be okay with my decision?</em>\nSue toweled off and wrapped herself in her bathrobe. Back in the living room, she nestled into the sofa with her stack of mail. Well, guess I’m going to find out now. She tore open the envelope from Spokane. The letter was brief, but insistent. “Call us whenever you arrive home so we can talk. We wish only for your happiness.”\n\n<em>Well, of course, they want to talk to me. Time to face the music!</em> She picked up the phone and asked for the long-distance operator.\n\n \n\n<em><strong>Author's note: If you'd like to continue reading this story on my blog, you can \"follow\" by signing up with your email. Then you'll get an email every time a new entry is published. Thanks for reading!... Ellen)</strong></em>","tags":["family history; 1952; wedding"],"publishedDate":"2018-06-02T21:55:56Z","harvestDate":"2018-06-02T21:56:04Z","estimatedPublishedDate":"2018-06-02T21:55:56Z","url":"http://ct.moreover.com/?a=34207240076&p=1u0&v=1&x=8XWa1AknXheNM41BDnPMng","originalUrl":"https://hellolamppost49.wordpress.com/2018/06/02/a-summer-wedding-1952-part-1/","outboundUrls":[],"wordCount":"2024","dataFormat":"text","duplicateGroupId":"34207240076","media":{"audio":[],"images":[{"url":"https://hellolamppost49.files.wordpress.com/2018/06/spokane-8.jpg?w=300"},{"url":"https://hellolamppost49.files.wordpress.com/2018/06/spokane-11-3.jpg?w=300"}],"video":[],"logo":[]},"publishingPlatform":{"itemId":"2270"},"adultLanguage":"false","topics":[{"name":"Milwaukee news","group":"US regional"}],"companies":[],"author":{"name":"brosmp","publishingPlatform":{"userId":"68033930"}},"licenses":[],"source":{"name":"Hello, Lamppost","homeUrl":"https://hellolamppost49.wordpress.com","location":{},"feed":{"id":"466517834","name":"Hello, Lamppost","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"71134174","generator":"http://wordpress.com/","description":"Transitions, travel, and anything else","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"9","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994294}