{"sequenceId":"845367366772","id":"34207264315","language":"English","title":"The Return of The Dream Syndicate","content":"Celebrity News June 02, 2018 The Return of The Dream Syndicate Chris Sikich The Dream Syndicate is back with their first new studio record since 1988! The album is called “How Did I Find Myself Here?” Bandmates Steve Wynn, Dennis Duck, Mark Walton and Jason Victor have been performing the new songs from the record, and classics like “The Days of Wine and Roses,” for fans around the world. “Extra’s” Senior Music Correspondent Adam Weissler caught up with Wynn at L.A.’s famed Troubadour before a recent show, where they talked about the new music and much more. “Extra” was at the Troubadour as The Dream Syndicate performed “Glide” during a soundcheck. Watch! Be sure to check out their Record Store Day 2018 special release “How We Found Ourselves... Everywhere!” on digital platforms June 22, and visit TheDreamSyndicate.com for tour dates and more. #Music#AsSeenOnExtra Comments Around the Web More In Celebrity News Chris Sikich Celebrity News The Return of The Dream Syndicate Getty Images CELEBRITY NEWS Benedict Cumberbatch: Hero in Real-Life Mugging Getty Images WEDDING NEWS Brody Jenner & Kaitlynn Carter Got Married! Getty Celebrity News Rumor Bust! Reese Witherspoon & Meryl Streep Not Feuding Getty Images CELEBRITY NEWS Bill Maher Slams His Friend Roseanne: 'Quite Racist' Getty Celebrity News Cara Santana Recalls Bonding with Meghan Markle over Fashion and Beauty Getty Celebrity News Nancy Grace Weighs In on Roseanne’s Controversial Tweets Load More Now Trending Now Trending 1 Baby on Board! Erika Christensen Shows Off Her Bump on Instagram 2 Katey Sagal’s Shocking Revelations About Gene Simmons Affair and… 3 Toxicology Results Released Following NBA Star and ‘American… 4 Are Scott Disick & Sofia Richie Over? The Signs! 5 Brody Jenner & Kaitlynn Carter Got Married! 6 How Medical Medium Anthony William Detects Illnesses, and the Top 5… 7 Is Halle Berry Dating Keanu Reeves?! 8 New Report Reveals What Was in 'American Idol' Contestant's System… 9 Wango Tango 2018 Lineup Announced — Who’s Performing? 10 Poor Thing! New Pics of Shiloh Jolie-Pitt Following Injury Around the Web The Extra List","contentWithMarkup":"The Dream Syndicate is back with their first new studio record since 1988!<img src=\"http://feeds.feedburner.com/~r/ExtraWeblog/~4/hHFx8Gra8pU\" height=\"1\" width=\"1\" alt=\"\"/>","tags":["Music","AsSeenOnExtra","CelebrityNews"],"publishedDate":"2018-06-02T21:01:54Z","harvestDate":"2018-06-02T22:00:32Z","estimatedPublishedDate":"2018-06-02T21:01:54Z","url":"http://ct.moreover.com/?a=34207264315&p=1u0&v=1&x=Qn38moZEAxqNNB-ciSnGZg","originalUrl":"http://extratv.com/2018/06/02/the-return-of-the-dream-syndicate/","outboundUrls":["http://thedreamsyndicate.com/recurring.php","https://morningsave.com/extratv"],"wordCount":"319","dataFormat":"text","duplicateGroupId":"34207173919","media":{"audio":[],"images":[{"url":"https://media.extratv.com/2018/06/02/the-dream-syndicate-press-photo-by-chris-sikich-480x360.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"ExtraTV.com","publishingPlatform":{}},"licenses":[],"source":{"name":"Full Feed | ExtraTV.com","homeUrl":"http://extratv.com/","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"176161252","name":"Full Feed | ExtraTV.com","mediaType":"Blog","generator":"Crowd Fusion http://www.crowdfusion.com/","description":"Extra has the hottest celebrity and entertainment news, photos, gossip, scandals, videos, games, music, movies, television, star sightings and more!","tags":[],"imageUrl":"https://feeds.extratv.com/img/extra-logo.png","copyright":"Copyright 2018 ExtraTV.com. The contents of these headlines and excerpts feed are available for limited commercial distribution. You may repost this feed to your site provided you link back to the original story, do not edit the material and do not remove","language":"English","dataFormat":"text","rank":{"autoRank":"1","autoRankOrder":"1230","inboundLinkCount":"1770"},"inWhiteList":"true","autoTopics":["ugc arts feeds"]}},"es_id":86994882}