{"sequenceId":"845362238716","id":"34207112000","language":"English","title":"Middlesex Community College Adult Learning Center Promotes Textile Recycling Program on the Bedford Campus","content":"Submitted by Middlesex Community College One of the two clothing collection boxes now located on the Bedford campus of Middlesex Community College – Image (c) JMcCT, 2018 all rights reserved Middlesex Community College and its Adult Learning Center (ALC) are partnering with Bay State Textiles in an ongoing Textile Recycling Program to help reduce waste and protect the environment. Collection boxes have been located in two parking lots on the Bedford campus (in Parking Lots A and M). Clean, dry textile items – including footwear, clothing, accessories, and linens – can be dropped off any time in the collection boxes. “Adult Learning Center staff believe this initiative is a way to create awareness about textile waste while encouraging the college and other local communities to recycle,” said Kathy Innis, ALC Director. “Almost all used textiles can be recycled – including stuffed animals, drapes, rugs, and socks – anything with a fabric base.” Small profits from the project will help defray the cost of supplies for ALC students, Innis added. About the Adult Learning Center at Middlesex Community College MCC’s Adult Learning Center offers FREE noncredit college-preparation courses for adult learners (ages 16 and up) who live and work in Massachusetts. Class sizes are small and range from adult basic-education to preparation for the High School Equivalency credential (GED or HiSET). The program meets from 9 a.m. to 12:30 p.m. Tuesdays through Thursdays, September through May, on the Bedford campus. The ALC is a free program supported by a grant from the Massachusetts Department of Elementary and Secondary Education. For more information about MCC’s Adult Learning Center, visit www.middlesex.mass.edu/adultlearning or call 781-280-3662. About Middlesex Community College Middlesex Community College is your pathway to success. As one of the largest, most comprehensive community colleges in the state, we educate, engage and empower a diverse community of learners. MCC offers more than 70 degree and certificate programs, plus hundreds of noncredit courses, on our campuses in Bedford and Lowell, as well as online. Middlesex Community College: Student success starts here!","contentWithMarkup":"Submitted by Middlesex Community College\n\nMiddlesex Community College and its Adult Learning Center (ALC) are partnering with Bay State Textiles in an ongoing Textile Recycling Program to help reduce waste and protect the environment.\n\nCollection boxes have been located in two parking lots on the Bedford campus (in Parking Lots A and M). Clean, dry textile items – including footwear, clothing, accessories, and linens – can be dropped off any time in the collection boxes.","tags":["Schools","The Environment"],"publishedDate":"2018-06-02T19:02:50Z","harvestDate":"2018-06-02T21:24:39Z","estimatedPublishedDate":"2018-06-02T19:02:50Z","url":"http://ct.moreover.com/?a=34207112000&p=1u0&v=1&x=SiYMAp0PNq16Xa3f98TLkA","originalUrl":"http://www.thebedfordcitizen.org/2018/06/middlesex-community-college-adult-learning-center-promotes-textile-recycling-program-on-the-bedford-campus/","commentsUrl":"http://www.thebedfordcitizen.org/2018/06/middlesex-community-college-adult-learning-center-promotes-textile-recycling-program-on-the-bedford-campus/#respond","outboundUrls":["http://www.middlesex.mass.edu/adultlearning"],"wordCount":"326","dataFormat":"text","duplicateGroupId":"34207112000","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Textiles news","group":"Industry"}],"companies":[],"author":{"name":"The Bedford Citizen","publishingPlatform":{}},"licenses":[],"source":{"name":"The Bedford Citizen","homeUrl":"http://www.thebedfordcitizen.org","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"326125010","name":"The Bedford Citizen","mediaType":"Blog","publishingPlatform":"WordPress","generator":"https://wordpress.org/?v=4.9.6","description":"Community-supported news for Bedford, Massachusetts","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"7","autoRankOrder":"121620","inboundLinkCount":"1"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990404}