{"sequenceId":"845361802545","id":"34207097639","language":"English","title":"'A living miracle:' Father survives shooting rampage, holds to hope despite paralysis","content":"From his bed in University Medical Center's trauma intensive care unit, Gilbert \"Manny\" Ceaser, paralyzed in all four limbs and dependent on a ventilator, caught his cousin's attention and nodded toward the clock. It was 6:05 p.m., and Domonique Lemieux had forgotten about an evening ritual. \"He mouthed, 'It's time to pray,'\" Lemieux said. The 24-year-old Ceaser was deemed quadriplegic and unable to breathe after being shot in the face April 22, one of a half dozen people wounded during another man's deadly rampage across New Orleans. Man on 'violent crime spree' shoots 5 people, including police officer Ceaser was brought up in church and is \"really grounded in his faith,\" Lemieux said. He's been praying a lot since that Sunday, including daily at 6 p.m., when he and his family and friends pray together wherever they are. Among those on Ceaser's prayer list is Charles Williams, who is accused of shooting him when their paths crossed as Williams tore around the city. Williams faces almost 40 felony charges, including attempted murder of Ceaser. \"Some of us are struggling with our anger,\" Lemieux said. But Ceaser, a cook at the Ruby Slipper restaurant on Canal Street and father of a 1-year-old girl, has already forgiven his attacker. When he first communicated this to her, Lemieux said, she was incredulous, asking, \"Really? \"A tear fell out of his eye, and he shook his head, 'Yes,'\" she said. In the hospital, Ceaser has won fans among the medical staff, who not only marvel at his survival but gravitate to his pleasant demeanor and strong character, said Lemieux and Ceaser's girlfriend, Carla Allen. This is typical, Allen said, as Ceaser tends to draw others in. \"He's very good with conversation,\" Allen said, and exudes an air of authenticity and calm. A native of New Orleans East, where he still lives, Ceaser grew up in church-going family, Lemieux said. His mother died when he was a young boy, so he was raised by grandparents who entertained a number of relatives family members every Sunday. Allen said she and Ceaser began dating about a 1 and 1/2 years ago. They met through social media then discovered they had much in common, including a slew of mutual friends and church backgrounds that continue to form important parts of their adult lives. Ceaser relishes spending time with his daughter, Kennedi Ceaser, who is captivated by her father, relatives said. One Sunday when Kennedi was just a few months old, Lemieux looked over and saw Ceaser beaming as he held his baby, telling her \"Dad's crazy about you, girl.\" Gilbert 'Manny' Ceaser, 24, who survived being shot in the face on April 22, 2018, pictured here with his 1-year-old daughter, Kennedi Ceaser. (Photo courtesy of Carla Allen).  \"His daughter is the light of his life,\" Lemieux said. The young father has long worked in kitchens, Allen said, for the past year at the Ruby Slipper. Allen said the restaurant's employees have shown a lot of support for Ceaser since the shooting. Coworkers have visited and donated money to help him and his family. A kitchen manager sat with the family during Ceaser's first night at the hospital.  Elysian Fields fatal shooting linked to 'violent crime spree' On April 22, Ceaser had just finished his shift and gotten into Allen's car. The weather was sunny and mild; Ceasar and Allen, who was driving, had the windows rolled down. A good friend was riding in the back seat next to Kennedi, who had drifted to sleep. They turned left from North Claiborne Street onto Kerlerec Street, pulling into the space beneath the Interstate 10 overpass. Allen said she was waiting to continue when she looked to her left, into what she described as the soulless eyes of Williams. Then she saw the muzzle of a gun. The gun fired, sending a bullet through Allen's headrest, into Ceaser's jaw and through his throat. It lodged in the right side of his neck. \"Honestly, to this day I'm not sure how he missed me,\" Allen said. Hysterical, Allen drove toward the friend's home on Kerlerec, where the friend's stepfather jumped into the car and \"gunned it\" to University Medical Center as Allen tried to stanch Ceaser's bleeding. \"It was so much blood,\" she said. \"I was covered in blood, from my neck to my toes.\" Allen said she kept tapping Ceaser's face to help him stay conscious as his eyes rolled toward the back of his head. \"You could tell he was fighting.\" Kennedi, who had awakened at the gunfire, stayed behind. \"I didn't let her see her dad,\" Allen said. Later, Kennedi and her mother met Allen and other relatives and friends of Ceaser at the hospital, where a doctor delivered a dark prognosis. As Ceaser was rushed to surgery to stop his severed arteries from gushing, medical staff warned relatives there was \"a good chance\" the young cook might not survive the procedure. \"That was the hardest part, just hearing them say 'if,'\" Allen said. \"We couldn't do anything at that point but keep praying.\" Allen said the couple learned only later that Ceaser was a victim in a broader crime spree. Police said Williams had just killed a motorist, Lil Ricky Goins, 38, on Elysian Fields Avenue, then drove Goins' car to the 1900 block of St. Roch Avenue and shot three people on a porch. Earlier in the day, he told police, angry from a fight with his girlfriend, he grew  enraged when his father refused to give him a box of bullets. Ceaser not only survived the shooting but awoke from surgery aware and communicative, another surprise, Lemieux and Allen said. He has no brain damage, they said. The paralysis, however, likely will leave him quadriplegic for life. And doctors expect him permanently to require a ventilator to breathe. The bullet fractured Ceaser's jaw, tore ligaments, damaged two vertebrae and severed nerves and carotid and vertebral arteries, damaging areas that control breathing and movement, Allen said. Allen and his family are struggling to find long-term options for Ceaser, hoping for a miracle while also searching for treatments to improve his quality of life and for an inpatient rehabilitation center that accepts patients on ventilators. \"His family and I refuse to leave him in a nursing home,\" Allen said. They are also collecting donations for his expenses via a GoFundMe account. Doctors have given no timeline for Ceaser's release from the hospital. He needs another surgery to stabilize his neck. Yet he is making progress, relatives said. Facial swelling that rendered him unrecognizable quickly subsided. The bullet's entry wound on his face is almost gone. Last week, his swallowing reflexes strengthened to where he can drink through a straw. Before that, he could suck liquids only from a sponge. Lemieux remembers the excitement at his first taste of flavor after consuming only water: After sucking apple juice from a sponge, he mouthed, \"It's so good,\" she said. He constantly seeks strength and encouragement through prayer and listening to Bible stories and gospel music, played through loudspeakers in his hospital room. When others get choked up at his circumstances, Ceaser comforts them, Lemieux said. \"It's going to be OK,\" he told a longtime friend who was fighting back tears. \"He can't do anything for himself at this time, but he's still encouraging other people,\" Lemieux said. \"He is still a living miracle.\" . . . . . . . NOLA.com | The Times-Picayune is looking for shooting survivors to share their stories. If you have been shot and would like to tell your story, please email Laura McKnight at lmcknight@nola.com or call her at 504.655.6571.","contentWithMarkup":"Gilbert 'Manny' Ceaser, 24, now quadriplegic, prays for the man who shot him","tags":["tag:gun violence","tag:homepage","tag:new orleans","tag:new orleans crime","tag:new orleans crimes","tag:new orleans shootings","tag:news"],"publishedDate":"2018-06-02T18:50:38Z","harvestDate":"2018-06-02T21:21:06Z","estimatedPublishedDate":"2018-06-02T18:50:38Z","url":"http://ct.moreover.com/?a=34207097639&p=1u0&v=1&x=SnMHMLOvDDAV5eOgWdhvLw","originalUrl":"http://www.nola.com/crime/index.ssf/2018/06/a_living_miracle_father_surviv.html","outboundUrls":["https://www.gofundme.com/gilbertceaser"],"wordCount":"1253","dataFormat":"text","duplicateGroupId":"34206041927","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Laura McKnight","publishingPlatform":{}},"licenses":[],"source":{"name":"NOLA River","homeUrl":"http://blog.nola.com/nola_river/","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"304532292","name":"NOLA River","mediaType":"Blog","publishingPlatform":"Movable Type","generator":"Movable Type Enterprise 4.29-advance http://www.sixapart.com/movabletype/","tags":[],"language":"English","dataFormat":"Image","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[],"editorialTopics":["Society","Standard"]}},"es_id":86989866}