{"sequenceId":"845362112158","id":"34207108197","language":"English","title":"SBI USMNT Man of the Match: Weston McKennie","content":"There were few standout performers in the U.S. Men's National Team's loss to Ireland, but one young midfielder put in a strong shift for the second straight match.  After going a full 90 in the win over Bolivia, Weston McKennie put in another solid 81 minute shift in Saturday's 2-1 loss to Ireland in Dublin. McKennie's efforts were another demonstrated of his continued evolution with the U.S., and those efforts earned him SBI USMNT Man of the Match honors.  Once again, McKennie's energy and workrate shined through as part of a midfield pairing with Tyler Adams. The two were all over the field on Saturday, covering ground ahead of Wil Trapp as part of a midfield three. With Trapp playing deep, McKennie was able to push further forward than he did on Monday, and he did just that through an energetic performance. When all was said and done, McKennie completed 23 of his 27 passes, with a large chunk coming in the Ireland half.  McKennie narrowly beat out Adams, Trapp and Timothy Weah for honors from Saturday's match.  Who was your Man of the Match? What did you think of McKennie's performance?  Share your thoughts below.","contentWithMarkup":"There were few standout performers in the U.S. Men's National Team's loss to Ireland, but one young midfielder put in a strong shift for the second straight match.\n\nAfter going a full 90 in the win over Bolivia, Weston McKennie put in another solid 81 minute shift in Saturday's 2-1 loss to Ireland in Dublin. McKennie's efforts were another demonstrated of his continued evolution with the U.S., and those efforts earned him SBI USMNT Man of the Match honors.\n\nOnce again, McKennie's energy and workrate shined through as part of a midfield pairing with Tyler Adams. The two were all over the field on Saturday, covering ground ahead of Wil Trapp as part of a midfield three. With Trapp playing deep, McKennie was able to push further forward than he did on Monday, and he did just that through an energetic performance. When all was said and done, McKennie completed 23 of his 27 passes, with a large chunk coming in the Ireland half.\n\nMcKennie narrowly beat out Adams, Trapp and Timothy Weah for honors from Saturday's match.\n\nWho was your Man of the Match? What did you think of McKennie's performance?\n\nShare your thoughts below.","tags":["Featured","U.S. Men's National Team"],"publishedDate":"2018-06-02T21:23:34Z","harvestDate":"2018-06-02T21:23:38Z","estimatedPublishedDate":"2018-06-02T21:23:34Z","url":"http://ct.moreover.com/?a=34207108197&p=1u0&v=1&x=EPiEKy_FfTtgOUKjfTUFow","originalUrl":"http://sbisoccer.com/2018/06/sbi-usmnt-man-of-the-match-weston-mckennie-2/","outboundUrls":[],"wordCount":"191","dataFormat":"text","duplicateGroupId":"34207108197","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"634485"},"adultLanguage":"false","topics":[],"companies":[{"name":"S-Energy Co Ltd","symbol":"095910","exchange":"KRX","isin":"KR7095910006","titleCount":0,"contentCount":1,"primary":true},{"name":"Saturday Co Ltd","symbol":"002291","exchange":"SHE","isin":"CNE100000FS6","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"Ryan Tolmich","publishingPlatform":{"userId":"33390693"}},"licenses":[],"source":{"name":"SBI Soccer","homeUrl":"http://sbisoccer.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"561943588","name":"SBI Soccer","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"93315145","generator":"http://wordpress.com/","description":"The world of soccer with an American voice","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"3","autoRankOrder":"6719","inboundLinkCount":"159"},"inWhiteList":"true","autoTopics":["ugc sport feeds"]}},"es_id":86990209}