{"sequenceId":"845362212038","id":"34207111625","language":"English","title":"What is the Sacred Heart of Jesus - Brief History and #Novena with #Litany to the #SacredHeart - Prayers to SHARE","content":"The month of  June is dedicated to the Sacred Heart of Jesus The Solemnity of the Sacred Heart of Jesus is celebrated 19 days after Pentecost.  The Feast of the Sacred Heart in 2018 will be on June 8, 2018. 20188 June 201928 June 202019 June 202111 June 202224 June 202316 June Jesus heart is the source of Divine love therefore, a devotion arose to increase love for Jesus through prayers. Devotion to the Sacred Heart of Jesus has been evident for many centuries under different forms. However, Margaret Mary Alacoque (1647-1690), a Visitation Nun of the monastery of Paray-le-Monial, France received visions of the Sacred Heart and spread its devotion with this feast. Jesus appeared asking for a devotion of expiatory  love and frequent Communion, Communion on the First Friday of the month, and the observance of the Holy Hour. For Breaking News, Novena Prayers,  Inspirational Stories, and Free Catholic Movies LIKE http://fb.com/catholicnewsworld In 1856, Pope Pius IX extended the feast of the Sacred Heart to the universal Church. On 11 June, 1899, by order of Pope Leo XIII, all peoples were solemnly consecrated to the Sacred Heart. It is annually celebrated on the Friday 19 days after Pentecost. 12 Promises of Jesus given in the Vision 1. I will give them graces necessary for their state in life. 2. I will give peace in their families. 3. I will console them in all their troubles. 4. They shall find in My Heart an assured refuge during life and especially at the hour of death. 5. I will pour abundant blessings on all their undertakings. 6. Sinners shall find in My Heart the source and infinite ocean of mercy. 7. Tepid souls shall become fervent. 8. Fervent souls shall speedily rise to great perfection. 9. I will bless the homes in which the image of My Sacred Heart shall be exposed and honored. 10. I will give to priests the power to touch the most hardened hearts. 11. Those who propagate this devotion shall have their name written in My Heart, and it shall never be effaced. 12. I promise thee in the excess of the mercy of My Heart, that its all-powerful Love will grant to all those who shall receive Communion on the First Friday of Nine consecutive months the grace of final repentance; they shall not die under My displeasure, nor without receiving the Sacraments; My Heart shall be their assured refuge at that last hour. CONSECRATION TO THE SACRED HEART FOR INDIVIDUAL FAMILIES Lord Jesus Christ, we consecrate ourselves to You today, each one of us, and all of us together as a family. Your Sacred Heart, the heart of your crucified and risen Body, is the ever living source of mercy and grace, hope and love for all of us. We desire to pledge ourselves and our lives to You in return. Teach us to be always united with You, through Your Holy Spirit in mind and heart, in all our thoughts, words, deeds, joy and sufferings. Grant that we may ever know You more clearly, love You more dearly, and follow You more nearly. We wish to share in Your redeeming work in our world: that your Father's will may truly be done on earth as it is in heaven, that the civilization of justice and love may thus be built up in our land. Heart of Jesus, help us to keep sin away from our lives. Help us to keep loving, serving and forgiving each other. Live in our hearts and in our homes always, Make us wholly Yours. With Your Mother's Immaculate Heart, we renew our consecration to Your Sacred Heart, for the ever greater glory of the Father in Heaven, Amen. Jesus, Mary and Joseph, be with us and bless us now and at the hour of our death, Amen. In 1899 Pope Leo XIII approved this Litany of the Sacred Heart of Jesus for public use.  Lord, have mercy Christ, have mercy Lord, have mercy Christ, hear us Christ, graciously hear us. God the Father of Heaven, God the Son, Redeemer of the world, God, the Holy Spirit, Holy Trinity, One God, Heart of Jesus, Son of the Eternal Father, Heart of Jesus, formed by the Holy Spirit in the womb of the Virgin Mother, Heart of Jesus, substantially united to the Word of God, Heart of Jesus, of Infinite Majesty, Heart of Jesus, Sacred Temple of God, Heart of Jesus, Tabernacle of the Most High, Heart of Jesus, House of God and Gate of Heaven, Heart of Jesus, burning furnace of charity, Heart of Jesus, abode of justice and love, Heart of Jesus, full of goodness and love, Heart of Jesus, abyss of all virtues, Heart of Jesus, most worthy of all praise, Heart of Jesus, king and center of all hearts, Heart of Jesus, in whom are all treasures of wisdom and knowledge, Heart of Jesus, in whom dwells the fullness of divinity, Heart of Jesus, in whom the Father was well pleased, Heart of Jesus, of whose fullness we have all received, Heart of Jesus, desire of the everlasting hills, Heart of Jesus, patient and most merciful, Heart of Jesus, enriching all who invoke Thee, Heart of Jesus, fountain of life and holiness, Heart of Jesus, propitiation for our sins, Heart of Jesus, loaded down with opprobrium, Heart of Jesus, bruised for our offenses, Heart of Jesus, obedient to death, Heart of Jesus, pierced with a lance, Heart of Jesus, source of all consolation, Heart of Jesus, our life and resurrection, Heart of Jesus, our peace and our reconciliation, Heart of Jesus, victim for our sins Heart of Jesus, salvation of those who trust in Thee, Heart of Jesus, hope of those who die in Thee, Heart of Jesus, delight of all the Saints, Lamb of God, who taketh away the sins of the world, Lamb of God, who taketh away the sins of the world, Lamb of God, who taketh away the sins of the world, V. Jesus, meek and humble of heart.Lord, have mercy. Christ, have mercy. Lord, have mercy. Christ, hear us. Christ, graciously hear us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. have mercy on us. spare us, O Lord. graciously hear us, O Lord. have mercy on us, O Lord. R. Make our hearts like to Thine. Let us pray; Almighty and eternal God, look upon the Heart of Thy most beloved Son and upon the praises and satisfaction which He offers Thee in the name of sinners; and to those who implore Thy mercy, in Thy great goodness, grant forgiveness in the name of the same Jesus Christ, Thy Son, who livest and reignest with Thee forever and ever. Amen. Padre Pio's Sacred Heart Novena This powerful prayer was recited every day by Padre Pio for all those who recommended themselves to his prayers: I. O my Jesus, You said \"verily I say to You, ask and you shall receive, seek and you shall find, knock and it shall be opened to you\", behold I knock, I seek and I ask for the grace of... Our Father, Hail Mary, Glory be to the Father. Sacred Heart of Jesus I put all my trust in Thee. II. O my Jesus, You said, \"verily I say to You, whatsoever you shall ask the Father in My name, He will give it to you\", behold in your name I ask the Father for the grace of... Our Father, Hail Mary, Glory be to the Father. Sacred Heart of Jesus I put all my trust in Thee. III. O my Jesus, You said, \"verily I say to You, heaven and earth shall pass away but My words shall not pass away\", behold I encouraged by your infallible words, now ask for the grace of... Our Father, Hail Mary, Glory be to the Father. Sacred Heart of Jesus I put all my trust in Thee. O sacred Heart of Jesus, to whom one thing alone is impossible, namely, not to have compassion on the afflicted, have pity on us miserable sinners and grant us the grace which we ask of Thee through the Sorrowful and Immaculate Heart of Mary, your and our tender Mother. Say the Salve Regina (Hail Holy Queen) and add, St. Joseph, foster father of Jesus, pray for us","contentWithMarkup":"<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-T41c61pMa50/WxL17F_BM0I/AAAAAAAAhAQ/3uicfbOkrNUB7-hZPFJbQ8iSDUZVCws8gCLcBGAs/s1600/jheartgood.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><span style=\"font-family: Georgia, Times New Roman, serif;\"><img border=\"0\" data-original-height=\"504\" data-original-width=\"504\" height=\"640\" src=\"https://2.bp.blogspot.com/-T41c61pMa50/WxL17F_BM0I/AAAAAAAAhAQ/3uicfbOkrNUB7-hZPFJbQ8iSDUZVCws8gCLcBGAs/s640/jheartgood.jpg\" width=\"640\" /></span></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><span style=\"font-family: Georgia, Times New Roman, serif;\"><br /></span></div><span style=\"font-family: Georgia, Times New Roman, serif;\"><span style=\"font-family: \"georgia\" , \"times new roman\" , serif;\">The month of  June is dedicated to the Sacred Heart of Jesus The Solemnity of the Sacred Heart of Jesus is celebrated 19 </span><span style=\"background-color: white; color: #191919; line-height: 23px;\"><span style=\"color: #222222;\">days after Pentecost.</span> </span><span style=\"font-family: \"georgia\" , \"times new roman\" , serif;\"> </span><span style=\"font-family: \"georgia\" , \"times new roman\" , serif;\"><span style=\"background-position: 0px 0px; border: 0px; box-sizing: border-box; color: #191919; line-height: 23px; margin: 0px; padding: 0px; vertical-align: baseline;\">The Feast of the Sacred Heart in 2018 will be on </span><span style=\"background-color: white; color: #191919; line-height: 23px;\">June 8, 2018.</span></span></span><br /><span style=\"font-family: \"georgia\" , \"times new roman\" , serif;\"><span style=\"background-color: white; color: #191919; font-family: Georgia, Times New Roman, serif; line-height: 23px;\"></span></span><br /><table border=\"1\" cellpadding=\"6\" cellspacing=\"0\" style=\"background-color: white; color: #222222; margin-left: 15px;\"><tbody><tr><th scope=\"row\"><span style=\"font-family: Georgia, Times New Roman, serif;\">2018</span></th><td><span style=\"font-family: Georgia, Times New Roman, serif;\">8 June</span></td></tr><tr><th scope=\"row\"><span style=\"font-family: Georgia, Times New Roman, serif;\">2019</span></th><td><span style=\"font-family: Georgia, Times New Roman, serif;\">28 June</span></td></tr><tr><th scope=\"row\"><span style=\"font-family: Georgia, Times New Roman, serif;\">2020</span></th><td><span style=\"font-family: Georgia, Times New Roman, serif;\">19 June</span></td></tr><tr><th scope=\"row\"><span style=\"font-family: Georgia, Times New Roman, serif;\">2021</span></th><td><span style=\"font-family: Georgia, Times New Roman, serif;\">11 June</span></td></tr><tr><th scope=\"row\"><span style=\"font-family: Georgia, Times New Roman, serif;\">2022</span></th><td><span style=\"font-family: Georgia, Times New Roman, serif;\">24 June</span></td></tr><tr><th scope=\"row\"><span style=\"font-family: Georgia, Times New Roman, serif;\">2023</span></th><td><span style=\"font-family: Georgia, Times New Roman, serif;\">16 June</span></td></tr></tbody></table><span style=\"font-family: Georgia, Times New Roman, serif;\">Jesus heart is the source of Divine love therefore, a devotion arose to increase love for Jesus through prayers. Devotion to the Sacred Heart of Jesus has been evident for many centuries under different forms. However, Margaret Mary Alacoque (1647-1690), a Visitation Nun of the monastery of Paray-le-Monial, France received visions of the Sacred Heart and spread its devotion with this feast. Jesus appeared asking for a devotion of expiatory  love and frequent Communion, Communion on the First Friday of the month, and the observance of the Holy Hour.</span><br /><span style=\"font-family: Georgia, Times New Roman, serif;\"><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"360\" src=\"https://www.youtube.com/embed/Cdk_XqZBJ6E\" width=\"640\"></iframe><span style=\"background-color: white; color: black; line-height: 28.7467px;\"></span><br /></span><div><span style=\"font-family: Georgia, Times New Roman, serif;\"><br /></span></div><div style=\"background-color: white; border: 0px; box-sizing: border-box; direction: ltr; line-height: 21px; margin-bottom: 15px; padding: 0px; vertical-align: baseline;\"><h3 style=\"margin: 0px; position: relative; text-align: center;\"><span style=\"background-color: yellow; font-family: Georgia, Times New Roman, serif; font-size: small;\"><u><b>For </b></u><u style=\"line-height: 1.4;\"><b>Breaking News, </b></u><u><b>Novena Prayers, </b></u><u><b> </b></u><u><b>Inspirational Stories,</b></u></span></h3><div style=\"text-align: center;\"><span style=\"font-family: Georgia, Times New Roman, serif;\"><u style=\"background-color: yellow; line-height: 1.4;\"><b>and Free Catholic Movies </b><b>LIKE <a href=\"http://fb.com/catholicnewsworld\" style=\"color: #666555;\">http://fb.com/catholicnewsworld</a></b></u><span style=\"line-height: 28.7467px;\"></span></span></div></div><span style=\"font-family: Georgia, Times New Roman, serif;\">In 1856, Pope Pius IX extended the feast of the Sacred Heart to the universal Church. On 11 June, 1899, by order of Pope Leo XIII, all peoples were solemnly consecrated to the Sacred Heart. It is annually celebrated on the Friday 19 days after Pentecost.<br /><strong>12 Promises of Jesus given in the Vision</strong></span><br /><div id=\"google300\"><span style=\"font-family: Georgia, Times New Roman, serif;\">1. I will give them graces necessary for their state in life.</span></div><div><span style=\"font-family: Georgia, Times New Roman, serif;\">2. I will give peace in their families.</span></div><span style=\"font-family: Georgia, Times New Roman, serif;\">3. I will console them in all their troubles.<br />4. They shall find in My Heart an assured refuge during life and especially at the hour of death.<br />5. I will pour abundant blessings on all their undertakings.<br />6. Sinners shall find in My Heart the source and infinite ocean of mercy.<br />7. Tepid souls shall become fervent.<br />8. Fervent souls shall speedily rise to great perfection.<br />9. I will bless the homes in which the image of My Sacred Heart shall be exposed and honored.<br />10. I will give to priests the power to touch the most hardened hearts.<br />11. Those who propagate this devotion shall have their name written in My Heart, and it shall never be effaced.<br />12. I promise thee in the excess of the mercy of My Heart, that its all-powerful Love will grant to all those who shall receive Communion on the First Friday of Nine consecutive months the grace of final repentance; they shall not die under My displeasure, nor without receiving the Sacraments; My Heart shall be their assured refuge at that last hour.</span><br /><div align=\"center\" class=\"MsoNormal\" style=\"background-color: #ffbf66; line-height: 18pt; margin: 0cm 0cm 10pt; text-align: center;\"><span style=\"font-family: Georgia, Times New Roman, serif;\"><b><u>CONSECRATION TO THE SACRED HEART<br />FOR INDIVIDUAL FAMILIES</u></b><o:p></o:p></span></div><span style=\"font-family: Georgia, Times New Roman, serif;\"><span style=\"font-family: \"georgia\" , \"times new roman\" , serif;\"><br /></span></span><br /><div class=\"MsoNormal\" style=\"margin: 0cm 0cm 10pt;\"><span style=\"font-family: Georgia, Times New Roman, serif;\"><span style=\"line-height: 18.4px;\"><br />Lord Jesus Christ, we consecrate ourselves to You today, each one of us, and all of us together as a family. Your Sacred Heart, the heart of your crucified and risen Body, is the ever living source of mercy and grace, hope and love for all of us. We desire to pledge ourselves and our lives to You in return.<br /><br />Teach us to be always united with You, through Your Holy Spirit in mind and heart, in all our thoughts, words, deeds, joy and sufferings. Grant that we may ever know You more clearly, love You more dearly, and follow You more nearly.<br /><br />We wish to share in Your redeeming work in our world: that your Father's will may truly be done on earth as it is in heaven, that the civilization of justice and love may thus be built up in our land.<br /><br />Heart of Jesus, help us to keep sin away from our lives. Help us to keep loving, serving and forgiving each other. Live in our hearts and in our homes always, Make us wholly Yours.<br /><br />With Your Mother's Immaculate Heart, we renew our consecration to Your Sacred Heart, for the ever greater glory of the Father in Heaven, Amen.<br /><br />Jesus, Mary and Joseph, be with us and bless us now and at the hour of our death, Amen.</span><span style=\"line-height: 18.4px;\"><o:p></o:p></span></span></div><span style=\"font-family: Georgia, Times New Roman, serif;\"><span style=\"font-family: \"georgia\" , \"times new roman\" , serif;\"><br /></span></span><br /><table border=\"0\" style=\"background-color: white; width: 600px;\"><tbody><tr><td colspan=\"2\" width=\"100%\"><span style=\"color: maroon; font-family: Georgia, Times New Roman, serif;\"><i><b><u>In 1899 Pope Leo XIII approved this Litany of the Sacred Heart of Jesus for public use. </u></b></i></span></td></tr><tr><td valign=\"top\" width=\"50%\"><span style=\"color: #75003a; font-family: Georgia, Times New Roman, serif;\">Lord, have mercy<br />Christ, have mercy<br />Lord, have mercy<br /><br />Christ, hear us<br />Christ, graciously hear us.<br /><br />God the Father of Heaven,<br />God the Son, Redeemer of the world,<br />God, the Holy Spirit,<br />Holy Trinity, One God,<br />Heart of Jesus, Son of the Eternal Father,<br />Heart of Jesus, formed by the Holy Spirit in the womb of the Virgin Mother,<br />Heart of Jesus, substantially united to the Word of God,<br />Heart of Jesus, of Infinite Majesty,<br />Heart of Jesus, Sacred Temple of God,<br />Heart of Jesus, Tabernacle of the Most High,<br />Heart of Jesus, House of God and Gate of Heaven,<br />Heart of Jesus, burning furnace of charity,<br />Heart of Jesus, abode of justice and love,<br />Heart of Jesus, full of goodness and love,<br />Heart of Jesus, abyss of all virtues,<br />Heart of Jesus, most worthy of all praise,<br />Heart of Jesus, king and center of all hearts,<br />Heart of Jesus, in whom are all treasures of wisdom and knowledge,<br />Heart of Jesus, in whom dwells the fullness of divinity,<br />Heart of Jesus, in whom the Father was well pleased,<br />Heart of Jesus, of whose fullness we have all received,<br />Heart of Jesus, desire of the everlasting hills,<br />Heart of Jesus, patient and most merciful,<br />Heart of Jesus, enriching all who invoke Thee,<br />Heart of Jesus, fountain of life and holiness,<br />Heart of Jesus, propitiation for our sins,<br />Heart of Jesus, loaded down with opprobrium,<br />Heart of Jesus, bruised for our offenses,<br />Heart of Jesus, obedient to death,<br />Heart of Jesus, pierced with a lance,<br />Heart of Jesus, source of all consolation,<br />Heart of Jesus, our life and resurrection,<br />Heart of Jesus, our peace and our reconciliation,<br />Heart of Jesus, victim for our sins<br />Heart of Jesus, salvation of those who trust in Thee,<br />Heart of Jesus, hope of those who die in Thee,<br />Heart of Jesus, delight of all the Saints,<br /><br />Lamb of God, who taketh away the sins of the world,<br />Lamb of God, who taketh away the sins of the world,<br />Lamb of God, who taketh away the sins of the world,<br /><br />V. Jesus, meek and humble of heart.</span></td><td valign=\"top\" width=\"50%\"><span style=\"color: #75003a; font-family: Georgia, Times New Roman, serif;\">Lord, have mercy.<br />Christ, have mercy.<br />Lord, have mercy.<br /><br />Christ, hear us.<br />Christ, graciously hear us.<br /><br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br /><br />have mercy on us.<br /><br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br /><br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br /><br />have mercy on us.<br /><br />have mercy on us.<br /><br />have mercy on us.<br /><br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br />have mercy on us.<br /><br />spare us, O Lord.<br /><br />graciously hear us, O Lord.<br /><br />have mercy on us, O Lord.<br /><br /><br />R. Make our hearts like to Thine.</span></td></tr><tr><td colspan=\"2\" width=\"100%\"><span style=\"color: #75003a;\"><span style=\"color: #75003a; font-family: Georgia, Times New Roman, serif;\">Let us pray;<br /><br />Almighty and eternal God, look upon the Heart of Thy most beloved Son and upon the praises and satisfaction which He offers Thee in the name of sinners; and to those who implore Thy mercy, in Thy great goodness, grant forgiveness in the name of the same Jesus Christ, Thy Son, who livest and reignest with Thee forever and ever. Amen.</span></span></td></tr></tbody></table><span style=\"font-family: Georgia, Times New Roman, serif;\"><u style=\"background-color: cyan;\"><strong>Padre Pio's Sacred Heart Novena</strong><o:p></o:p></u></span><br /><span style=\"font-family: Georgia, Times New Roman, serif;\"><span style=\"font-family: \"georgia\" , \"times new roman\" , serif;\"><br /></span></span><br /><div align=\"center\" style=\"text-align: center;\"><span style=\"font-family: Georgia, Times New Roman, serif;\">This powerful prayer was recited every day by Padre Pio for all those who recommended themselves to his prayers:<o:p></o:p></span></div><span style=\"font-family: Georgia, Times New Roman, serif;\"><span style=\"font-family: \"georgia\" , \"times new roman\" , serif;\"><br /></span><span style=\"font-family: \"georgia\" , \"times new roman\" , serif;\">I. O my Jesus, You said \"verily I say to You, ask and you shall receive, seek and you shall find, knock and it shall be opened to you\", behold I knock, I seek and I ask for the grace of...<o:p></o:p><br /><br /><i>Our Father, Hail Mary, Glory be to the Father. Sacred Heart of Jesus I put all my trust in Thee.</i><o:p></o:p><br /><br />II. O my Jesus, You said, \"verily I say to You, whatsoever you shall ask the Father in My name, He will give it to you\", behold in your name I ask the Father for the grace of...<o:p></o:p><br /><br /><i>Our Father, Hail Mary, Glory be to the Father. Sacred Heart of Jesus I put all my trust in Thee.</i><o:p></o:p><br /><br />III. O my Jesus, You said, \"verily I say to You, heaven and earth shall pass away but My words shall not pass away\", behold I encouraged by your infallible words, now ask for the grace of...<o:p></o:p><br /><br /><i>Our Father, Hail Mary, Glory be to the Father. Sacred Heart of Jesus I put all my trust in Thee.</i><o:p></o:p><br /><br />O sacred Heart of Jesus, to whom one thing alone is impossible, namely, not to have compassion on the afflicted, have pity on us miserable sinners and grant us the grace which we ask of Thee through the Sorrowful and Immaculate Heart of Mary, your and our tender Mother.<br /><br /><br /><i>Say the Salve Regina (Hail Holy Queen) and add, St. Joseph, foster father of Jesus, pray for us</i><i><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"344\" src=\"https://www.youtube.com/embed/Mf4lhzkhkgg?fs=1\" width=\"459\"></iframe></i></span></span></div>","tags":[],"publishedDate":"2018-06-02T19:59:17Z","harvestDate":"2018-06-02T21:24:33Z","estimatedPublishedDate":"2018-06-02T19:59:17Z","url":"http://ct.moreover.com/?a=34207111625&p=1u0&v=1&x=IDGn7zCp42BBSt-X8StQdA","originalUrl":"http://www.catholicnewsworld.com/2018/06/what-is-sacred-heart-of-jesus-brief.html","commentsUrl":"http://www.blogger.com/comment.g?blogID=7248004665966827665&postID=3816038272988769898","outboundUrls":["https://2.bp.blogspot.com/-T41c61pMa50/WxL17F_BM0I/AAAAAAAAhAQ/3uicfbOkrNUB7-hZPFJbQ8iSDUZVCws8gCLcBGAs/s1600/jheartgood.jpg","http://fb.com/catholicnewsworld"],"wordCount":"1495","dataFormat":"text","duplicateGroupId":"34207111625","media":{"audio":[],"images":[{"url":"https://2.bp.blogspot.com/-T41c61pMa50/WxL17F_BM0I/AAAAAAAAhAQ/3uicfbOkrNUB7-hZPFJbQ8iSDUZVCws8gCLcBGAs/s640/jheartgood.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"Fountain SA","symbol":"FOU","exchange":"BRU","isin":"BE0003752665","titleCount":0,"contentCount":1,"primary":true},{"name":"Fountain SA","symbol":"0EHR","exchange":"LTS","isin":"BE0003752665","titleCount":0,"contentCount":1,"primary":true},{"name":"St. Joseph Inc","symbol":"STJO","exchange":"PINX","isin":"US85231M1036","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"Jesus Caritas Est","publishingPlatform":{}},"licenses":[],"source":{"name":"Catholic News World","homeUrl":"http://www.catholicnewsworld.com/","location":{},"feed":{"id":"145899868","name":"Catholic News World","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"LIKE Facebook.com/catholicnewsworld - REAL Breaking News - FULL TEXT Releases- Read in over 200 countries - Millions of Views","tags":["Angel Maria Villar","Auschwitz","Basilica of the National Shrine of the Immaculate Conception","Catholic Social Services Australia","Crossroads","Deacon Naveed Arif","Father Pascal Paulus","Foundation for Sacred Arts","Holy Rosary Church","International Sacred Music Compet"],"language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"30202","inboundLinkCount":"16"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990375}