{"sequenceId":"845363676894","id":"34207159623","language":"English","title":"Emergency Preparedness, Food Storage and Monthly Assignments","content":"And I Thought We Were prepared! A few weeks ago as we entered our neighborhood, one night after attending a church activity, we noticed all the lights were out. Soon we discovered after a chain of events, we were not as prepared as we thought we were. Let me share our experience and what we learned.   First, I grabbed the small flashlight I keep in my purse for emergencies so we could see as we entered our house. Unfortunately,  the flashlight was dead. So we stumbled and felt our way to the kitchen to retrieve the flashlight there.  Since we did not know how long the electricity would be out my husband got the emergency garage key, electric garage door, to open the garage so he could get our solar emergency generator out to connect an extension cord into the house so we could attach a lamp for lighting.  While he did that I got a small battery operated lantern out of the closet so we could have some light. In this process I discovered I needed to get the step ladder to reach the lantern, then get batteries and struggled a little holding the flashlight so I could put the batteries in.  In the mean time, my husband discovered the solar generator was not charged. Just a few weeks before that I realized we had not checked the 3 large batteries inside the solar generator in awhile, they need replaced about every 2 years, and I had procrastinated in having him check, now they are dead.  Then my husband said he would get the small gas generator and use it. In trying to get to it we discovered it was not easily accessible, especially when you can not see very well. So he decided to get the large gas generator, but it needed gas.  Then we discovered the gas containers were also empty, we had just a few weeks ago rotated the gas to our car and meant to refill them, but once again with our busy life we had procrastinated.  Just as my husband decided he could hook up the car battery by a devise he has, the lights came back on.  Wow!!! We discovered very quickly how we thought we were prepared, we were not! This was serious! What if there had been a serious disaster or emergency that lasted days? We would have been in trouble! I say many times to people when they ask me how you know if you are really prepared, \"Sometimes you do not really know until a disaster or emergency situation is upon you\". Boy, was I right! So to remedy our escalate of problems that night we have replaced the batteries in my purse flashlight, moved the small battery operated lantern easier to access with batteries taped to it, replace the solar generator batteries, filled the gas cans and made the small gas generator more easily accessible.  What lessons did we learn from this experience? As I always say and did not follow my own rules, \"Continually check on your emergency supplies, update, repair and replace as needed, make them easy to access and do not procrastinate when the emergency supplies need replaced and repaired\". June Monthly Assignments   3-Month Food Storage    3-Month Food Storage  . . .    This year we are working towards a 3-Month Food Storage supply. Each families will be unique in that not one family eats the same things. You will tailor your food storage according to what your family will eat. Do not purchase items just because they are sale, your family will not eat foods they do not like, and you have just wasted valuable money that could be put towards foods they will eat. A 3-Month Food Storage supply consists of commercially canned and packaged food and home canning foods. You can also include frozen foods. In January we worked on keeping track of what your family eats in a month. Go back to January 2018 posting to see the details and a printable chart to keep track. Now that you have figured out what your family eats in a month you can set up an inventory notebook. In February I showed you how to set up your Food Storage and Emergency Supply Inventory Notebook. Go back to the February 2018 positing to see how to do this. In March through May we continued to add commercially canned and packaged foods, frozen foods, and home canned foods to your 3-Month Food Storage. Watch sales, allowing to purchase more. Keep track in your inventory notebook. Rotate as needed. This month, May, continue to add to your 3-Month Food Storage.  Big box stores vs regular grocery stores: Recently I purchased a case of Kirkland brand, 12 cans of green beans (14.5 oz each) at Costco for $5.99. That works out to 50 cents a can, a great price. At the regular grocery store like Safeway, Ralph's or Albertsons in Southern California, USA they run, on sale, about $.70-$1.00. And of course, at the discounts stores they are $1 each, but watch the expiration dates. So clearly in this case the big box store is less expensive, but it depends on the item. Do the math and watch your local grocery stores for the best price. Watch for case lot sales too.    Emergency Preparedness Supplies Water  The most important Emergency Preparedness item to store!  It is a known fact you can live without food for several days, but you cannot live without water for more than 2-3 days!  Each family should have 1 gallon of drinking water per day per person stored for your house hold. The United States Government and our local community Emergency Preparedness units advise us we should have enough drink water on hand for two weeks. I strongly feel two weeks is not enough, look what happened after Katrina and other disasters. I think we should have drinking water stored for at least a month, or more if possible. The best way to store drinking water is in 15-55 gallon water barrels. See the link below regarding information. Another way is in the store commercially bottled plastic bottles. Be careful with these. If you buy them by the case do not store them directly on concrete, the water will absorb the chemicals from the plastic. Raise above the concrete on 2x4 wood beams or pallets. No matter what types of containers you store your water in, it all needs rotated. Check out the link below for how long to store the water. Click here to learn and read more information about water storage. FABWODI  Years ago my husband entered a work competition for a new slogan. He won! He came up with FABWODI, \"Find a better way of doing it!\"  Many people do not understand why they cannot seem to build up their food storage, emergency supplies, get out of debt, save money, etc.. There is a saying, \"If you keep doing what you are doing, you will always get what you have gotten.\" So if you are struggling with acquiring food storage and emergency supplies, change what you are doing. This blog will help you do that. If you follow each month's assignments, before you know it, you will have your 3-months, year food storage, water storage and emergency supplies. I am trying to make it as easy as I know how.  Many people ask me how I lost so much weight, 66 pounds so far, and ask my daughter how they got out of so much debt, they are debt free now. We both tell them it takes patience, persistence, consistency, dedication, determination, sacrifice and hard work. There is no easy or magic trick! Emergency preparedness is the same!","contentWithMarkup":"<span style=\"font-size: x-large;\"><b>And I Thought We Were prepared!</b></span><br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-b1iyzYMXg5w/WwWCkNp2SGI/AAAAAAAAEsA/wOtjSm9HzJ4cImUAgetDvmFwhuCQiIVIwCLcBGAs/s1600/unprepared.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"159\" data-original-width=\"318\" height=\"200\" src=\"https://2.bp.blogspot.com/-b1iyzYMXg5w/WwWCkNp2SGI/AAAAAAAAEsA/wOtjSm9HzJ4cImUAgetDvmFwhuCQiIVIwCLcBGAs/s400/unprepared.jpg\" width=\"400\" /></a></div><br /><span style=\"font-size: small;\">A few weeks ago as we entered our neighborhood, one night after attending a church activity, we noticed all the lights were out. Soon we discovered after a chain of events, we were not as prepared as we thought we were. Let me share our experience and what we learned.  </span><br /><ul><li><span style=\"font-size: small;\"> </span><span style=\"font-size: small;\">First, I grabbed the small flashlight I keep in my purse for emergencies so we could see as we entered our house. Unfortunately,  the flashlight was dead. So we stumbled and felt our way to the kitchen to retrieve the flashlight there. </span></li><li><span style=\"font-size: small;\">Since we did not know how long the electricity would be out my husband got the emergency garage key, electric garage door, to open the garage so he could get our solar emergency generator out to connect an extension cord into the house so we could attach a lamp for lighting. </span></li><li><span style=\"font-size: small;\">While he did that I got a small battery operated lantern out of the closet so we could have some light. In this process I discovered I needed to get the step ladder to reach the lantern, then get batteries and struggled a little holding the flashlight so I could put the batteries in. </span></li><li><span style=\"font-size: small;\">In the mean time, my husband discovered the solar generator was not charged. Just a few weeks before that I realized we had not checked the 3 large batteries inside the solar generator in awhile, they need replaced about every 2 years, and I had procrastinated in having him check, now they are dead. </span></li><li><span style=\"font-size: small;\">Then my husband said he would get the small gas generator and use it. In trying to get to it we discovered it was not easily accessible, especially when you can not see very well. So he decided to get the large gas generator, but it needed gas. </span></li><li><span style=\"font-size: small;\">Then we discovered the gas containers were also empty, we had just a few weeks ago rotated the gas to our car and meant to refill them, but once again with our busy life we had procrastinated. </span></li><li><span style=\"font-size: small;\">Just as my husband decided he could hook up the car battery by a devise he has, the lights came back on. </span></li><li><span style=\"font-size: small;\">Wow!!!</span></li></ul><span style=\"font-size: small;\">We discovered very quickly how we thought we were prepared, we were not! This was serious<b>!</b> What if there had been a serious disaster or emergency that lasted days? We would have been in trouble! I say many times to people when they ask me how you know if you are really prepared, \"Sometimes you do not really know until a disaster or emergency situation is upon you\". Boy, was I right! </span><br /><br /><span style=\"font-size: small;\">So to remedy our escalate of problems that night we have replaced the batteries in my purse flashlight, moved the small battery operated lantern easier to access with batteries taped to it, replace the solar generator batteries, filled the gas cans and made the small gas generator more easily accessible. </span><br /><span style=\"font-size: small;\"><br /></span><span style=\"font-size: small;\">What lessons did we learn from this experience? As I always say and did not follow my own rules, \"Continually check on your emergency supplies, update, repair and replace as needed, make them easy to access and do not procrastinate when the emergency supplies need replaced and repaired\".</span><br /><br /><div style=\"text-align: center;\"><span style=\"font-size: x-large;\"><b><span style=\"color: red;\">June Monthly Assignments</span></b></span><br /><span style=\"font-size: x-large;\"><span style=\"font-size: small;\"><b><span style=\"color: red;\"> </span></b></span></span></div><div style=\"text-align: center;\"></div><div style=\"text-align: center;\"><span style=\"font-size: x-large;\"></span></div><div style=\"text-align: center;\"><span style=\"font-size: x-large;\"><b><span style=\"color: red;\"><span style=\"color: red;\"><b>3-Month Food Storage </b></span></span></b></span></div><div style=\"text-align: center;\"><span style=\"font-size: medium;\"><b><span style=\"color: red;\"><span style=\"font-size: small;\"><span style=\"color: red;\"><b> </b></span></span><br /></span></b></span></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-QfYf67ep6g4/Wmp4m_d6AvI/AAAAAAAAEl8/5LWvoH9xa4YePEXhnrkwQhmZSNK7SiErACLcBGAs/s1600/3%2Bmonth%2Bfood%2Bsupply%2B2.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"231\" data-original-width=\"218\" height=\"400\" src=\"https://3.bp.blogspot.com/-QfYf67ep6g4/Wmp4m_d6AvI/AAAAAAAAEl8/5LWvoH9xa4YePEXhnrkwQhmZSNK7SiErACLcBGAs/s400/3%2Bmonth%2Bfood%2Bsupply%2B2.jpg\" width=\"377\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><br /><span style=\"font-size: large;\"><b>3-Month Food Storage  . . .  </b></span><b> </b><br /><br /><b>This year we are working towards a 3-Month Food Storage supply.</b>  Each families will be unique in that not one family eats the same  things. You will tailor your food storage according to what your family  will eat. Do not purchase items just because they are sale, your family  will not eat foods they do not like, and you have just wasted valuable  money that could be put towards foods they will eat.<br /><br /><b>A 3-Month Food Storage supply consists of commercially canned and  packaged food and home canning foods. You can also include frozen foods.  </b><br /><br /><b>In January </b>we worked on keeping track of what your family eats in a  month. Go back to January 2018 posting to see the details and a  printable chart to keep track. Now that you have figured out what your  family eats in a month you can set up an inventory notebook.<br /><br /><b>In February</b> I showed you how to set up your Food Storage and Emergency  Supply Inventory Notebook. Go back to the February 2018 positing to see  how to do this. <br /><br /><b>In March through May </b>we continued to add commercially canned and packaged  foods, frozen foods, and home canned foods to your 3-Month Food Storage.  Watch sales, allowing to purchase more. Keep track in your inventory  notebook. Rotate as needed.<br /><br /><b>This month, May, continue to add to your 3-Month Food Storage.  </b><br /><br /><b>Big box stores vs regular grocery stores: </b>Recently I purchased a  case of Kirkland brand, 12 cans of green beans (14.5 oz each) at Costco  for $5.99. That works out to 50 cents a can, a great price. At the  regular grocery store like Safeway, Ralph's or Albertsons in Southern  California, USA they run, on sale, about $.70-$1.00. And of course, at  the discounts stores they are $1 each, but watch the expiration dates.  So clearly in this case the big box store is less expensive, but it  depends on the item. Do the math and watch your local grocery stores for  the best price. Watch for case lot sales too. <br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"> <span style=\"font-size: small;\"> <b><span style=\"color: red;\"> </span></b></span></div><div style=\"text-align: center;\"><span style=\"font-size: small;\"></span></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><span style=\"font-size: x-large;\"><span style=\"color: red;\"><b>Emergency Preparedness Supplies</b></span></span></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div style=\"text-align: center;\"><span style=\"font-size: large;\"><b><span style=\"font-size: x-large;\"><span style=\"color: red;\">Water </span></span></b></span></div><div style=\"text-align: center;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-33KJTNJNixA/WwShVOo4XyI/AAAAAAAAEro/pmdwvh2KDDUu03nd2QgcKfduoItAeQRlQCLcBGAs/s1600/water%2Bfall.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"177\" data-original-width=\"284\" height=\"248\" src=\"https://2.bp.blogspot.com/-33KJTNJNixA/WwShVOo4XyI/AAAAAAAAEro/pmdwvh2KDDUu03nd2QgcKfduoItAeQRlQCLcBGAs/s400/water%2Bfall.jpg\" width=\"400\" /></a></div><div style=\"text-align: center;\"><br /></div><div style=\"text-align: center;\"><span style=\"font-size: large;\"><b><span style=\"font-size: x-large;\"><span style=\"color: red;\"><span style=\"color: black;\">The most important Emergency Preparedness item to store! </span></span></span></b></span></div><div style=\"text-align: center;\"></div><div style=\"text-align: center;\"><br /><b><span style=\"font-size: large;\">It is a known fact you can live without food for several days, but you cannot live without water for more than 2-3 days! </span></b></div><div style=\"text-align: center;\"><br /></div><div style=\"text-align: left;\"><span style=\"font-size: small;\">Each family should have <b>1 gallon of drinking water per day per person </b>stored for your house hold. The United States Government and our local community Emergency Preparedness units advise us we should have enough <b>drink water</b> on hand for <b>two weeks</b>.<b> </b>I<b> </b>strongly feel two weeks is not enough, look what happened after  Katrina and other disasters. I think we should have drinking water stored for at least <b>a month,</b> or more if possibl<b>e.</b></span></div><div style=\"text-align: left;\"><br /></div><div style=\"text-align: left;\"><span style=\"font-size: small;\">The best way to store drinking water is in 15-55 gallon water barrels. See the link below regarding information. Another way is in the store commercially bottled plastic bottles. Be careful with these. If you buy them by the case do not store them directly on concrete, the water will absorb the chemicals from the plastic. Raise above the concrete on 2x4 wood beams or pallets. No matter what types of containers you store your water in, it all needs rotated. Check out the link below for how long to store the water. Click <a href=\"http://thearkcarsonward.blogspot.com/search/label/Water%20Storage%20and%20Water%20Barrels\">here</a> to learn and read more information about water storage.</span></div><div style=\"text-align: left;\"><br /></div><div style=\"text-align: center;\"><b><span style=\"font-size: large;\"><span style=\"color: blue;\"><span style=\"font-size: x-large;\">FABWODI </span></span></span></b><br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-mJp0DFPqVJ0/WwWAlYQ6FGI/AAAAAAAAEr0/hkagZhEGfksUWFm7GtNLFm_Q4BXzn9EOwCLcBGAs/s1600/better%2Bway.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"225\" data-original-width=\"225\" height=\"400\" src=\"https://2.bp.blogspot.com/-mJp0DFPqVJ0/WwWAlYQ6FGI/AAAAAAAAEr0/hkagZhEGfksUWFm7GtNLFm_Q4BXzn9EOwCLcBGAs/s400/better%2Bway.jpg\" width=\"400\" /></a></div></div><div style=\"text-align: left;\"><br /><span style=\"font-size: small;\">Years ago my husband entered a work competition for a new slogan. He won! He came up with FABWODI, \"Find a better way of doing it!\"  Many people do not understand why they cannot seem to build up their food storage, emergency supplies, get out of debt, save money, etc.. There is a saying, \"If you keep doing what you are doing, you will always get what you have gotten.\" So if you are struggling with acquiring food storage and emergency supplies, change what you are doing. This blog will help you do that. If you follow each month's assignments, before you know it, you will have your 3-months, year food storage, water storage and emergency supplies. I am trying to make it as easy as I know how. </span><br /><br /></div><div style=\"text-align: left;\"><span style=\"font-size: small;\"><span style=\"font-size: x-small;\">Many people ask me how I lost so much weight, 66 pounds so far, and ask my daughter how they got out of so much debt, they are debt free now. We both tell them it takes patience, persistence, consistency, dedication, determination, sacrifice and hard work. There is no easy or magic trick! Emergency preparedness is the same!</span></span></div><div style=\"text-align: left;\"></div>","tags":[],"publishedDate":"2018-06-02T15:43:50Z","harvestDate":"2018-06-02T21:36:37Z","estimatedPublishedDate":"2018-06-02T15:43:50Z","url":"http://ct.moreover.com/?a=34207159623&p=1u0&v=1&x=ZEf_wOfaZcyXltkE74aZWQ","originalUrl":"http://thearkcarsonward.blogspot.com/2018/06/emergency-preparedness-food-storage-and.html","commentsUrl":"http://thearkcarsonward.blogspot.com/2018/06/emergency-preparedness-food-storage-and.html#comment-form","outboundUrls":["https://2.bp.blogspot.com/-b1iyzYMXg5w/WwWCkNp2SGI/AAAAAAAAEsA/wOtjSm9HzJ4cImUAgetDvmFwhuCQiIVIwCLcBGAs/s1600/unprepared.jpg","https://3.bp.blogspot.com/-QfYf67ep6g4/Wmp4m_d6AvI/AAAAAAAAEl8/5LWvoH9xa4YePEXhnrkwQhmZSNK7SiErACLcBGAs/s1600/3%2Bmonth%2Bfood%2Bsupply%2B2.jpg","https://2.bp.blogspot.com/-33KJTNJNixA/WwShVOo4XyI/AAAAAAAAEro/pmdwvh2KDDUu03nd2QgcKfduoItAeQRlQCLcBGAs/s1600/water%2Bfall.jpg","https://2.bp.blogspot.com/-mJp0DFPqVJ0/WwWAlYQ6FGI/AAAAAAAAEr0/hkagZhEGfksUWFm7GtNLFm_Q4BXzn9EOwCLcBGAs/s1600/better%2Bway.jpg"],"wordCount":"1271","dataFormat":"text","duplicateGroupId":"34207159623","media":{"audio":[],"images":[{"url":"https://2.bp.blogspot.com/-b1iyzYMXg5w/WwWCkNp2SGI/AAAAAAAAEsA/wOtjSm9HzJ4cImUAgetDvmFwhuCQiIVIwCLcBGAs/s400/unprepared.jpg"},{"url":"https://3.bp.blogspot.com/-QfYf67ep6g4/Wmp4m_d6AvI/AAAAAAAAEl8/5LWvoH9xa4YePEXhnrkwQhmZSNK7SiErACLcBGAs/s400/3%2Bmonth%2Bfood%2Bsupply%2B2.jpg"},{"url":"https://2.bp.blogspot.com/-mJp0DFPqVJ0/WwWAlYQ6FGI/AAAAAAAAEr0/hkagZhEGfksUWFm7GtNLFm_Q4BXzn9EOwCLcBGAs/s400/better%2Bway.jpg"},{"url":"https://2.bp.blogspot.com/-33KJTNJNixA/WwShVOo4XyI/AAAAAAAAEro/pmdwvh2KDDUu03nd2QgcKfduoItAeQRlQCLcBGAs/s400/water%2Bfall.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"The Ark","publishingPlatform":{}},"licenses":[],"source":{"name":"thearkcarsonward","homeUrl":"http://thearkcarsonward.blogspot.com/","location":{},"feed":{"id":"141775875","name":"thearkcarsonward","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","tags":["3 Month Food Supply","72 Hour Emergency Preparedness Family Bag","72 Hour Individual Emergency Preparedness Backpack","72 Hour Individual Emergency Preparedness Hygiene Kit","72 Hour Individual Emergency Preparedness Stressor Kit","Before and During and After an Ea"],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86991971}