{"sequenceId":"845366285249","id":"34207237075","language":"English","title":"Diamantina Mendis : Remembering a wonderful mother","content":"Diamantina Mendis : Remembering a wonderful mother   It’s been two years since the loss of my beloved mother. I know well that it is both the eternal miss, sorrow and the pain in me, which I’m certain I have encountered before and would hold me again dearly in the samsara, where I would be better placed to have her around.   We tend to say, the truth of life is suffering, dukkha yet our nature is to distract ourselves from this core truth of life. However, nostalgia is real and profound, when one looks for the innermost thoughts about the loss of parents. Besides, I know very well even the purest state of happiness experienced is also dukkha. Thus, even these great nostalgic memories I raise, is nothing but dukkha. Even so, most recently, a wave of nostalgia swept over me when my good friends, whose association with me go back to school days and who are very familiar with my home set up, recalled how we grew up in Galle. They paid tribute to my mother, whom they loved very much. What is instilled in their mind is the simple,genuine, comfortable person in my mother.    They reminded me of how we were nurtured with self-discipline and self-respect by our parents. Indeed, when we were growing up happily in Galle, my mother was reminding us all the time that if you fill your mind with garbage, it will remain there in your subconscious, and insisted we look for the correct thing. Then, my father always wanted us to fix our thoughts on what is morally correct, and very good, and right, and lovely and meaningful. Thus, Galle remains to date as a constant reminder of the unhindered joy of our childhood.    As I reflect on this Mother’s Day fuelled by the memories recalled by friends and sweet gestures received by Vibhavi, I thought that Mother’s Day can feel absolutely cruel to my sons someday.    My mother had become a teacher straight from her Peradeniya days, a wonderful teacher in the old fashion way taking the noble pedagogic path of her much-venerated parents. In fact, her fascinating journey had begun in her principal father, teacher mother, surrounded by much loved siblings, ever recalling happy memories made, ‘Seenigama Iskole’. She had passed university entrance from Richmond College and had entered the Sangamitta Hall in her much-adored Peradeniya Campus. After graduation, she had first come to Sri Medankara Vidyalaya, Ginthota and from there to spend long beautiful years at Sangamitta Balika Vidyalaya, Galle, which was ever cherished. She always claimed she owed much to her father, beginning from her beautiful handwriting to learning maths with languages, and to literary skills coupled with aesthetic leanings, and then to become the teacher she wanted to with a Geography Special. In fact, Seenigama and Peradeniya days were fondly recalled at every moment which even made her to actively engage in the work of the Peradeniya Alumni Association. As I gather, she was a gifted teacher, a much-loved principal, who always considered others above herself and was held in the highest regard by her students. In fact, she was one of a kind geography enthusiast, capable of making enthralling mind movies and still pictures in the thoughts of her students, making them to somehow check the accuracy of the scenes their teacher made in their mind when they encounter the reality from the Knuckles Range to the Grand Canyon, and then to the Great Barrier Reef.    On the other hand, she was also into writing, book authoring and the fair critic in me keeps her artistry and literary skills on a good pedestal. I consider her paper articles and books quality, interesting stuff and in particular, her book based on the series which appeared in the papers, ‘Spring has Sprung’ only a skilled wordsmith can create. Further, if I may borrow lines from the much poetic Sekere-Amaradeva fame, I’d say ‘Pipi bidena diya bubule, Wala rodaka dura akase, Soba sonduru siri melowe obey esini ma dutuwe’, indeed.    During our formative days, instead of filling our home with material things, our parents used to fill it with books and were instrumental in our every move. Though our father was ever busy with his law practice, Amma inimitably led us to some quality evenings at the Ramparts or while eating out as we never missed a good drama, or a classy musical evening in Galle. Indeed, we grew up listening to Amaradeva and when we follow their poetry from Sudo Sudu to Casabianca “The boy stood on the burning deck, when all but he had fled.... Say, father, say, if yet my task is done?” We could not hold to hear the rest but cry, and in this day Robert Frost too comes to mind with” I’d like to get away from earth awhile, And then come back to it and begin over. May no fate willfully misunderstand me, And half grant what I wish and snatch me away”.    My mother was never into stereotyped religious rituals, yet all in her life she embodied the spirit in “dhammo hawe rakkathi dhamma chari” and giving to others was part of the normal way of life. She was also never into shopping or anything like that and had a clear idea in what she looked for, which actually signifies the virtues in her. She was not envious about anything and had no ill feeling or protectiveness.    She instilled in our minds that when foodstuff is not shared it has no taste so we could not spare even a small chocolate slab without sharing. Her mother too was very benevolent and was into giving and sharing, beginning from her meal.    I can recall many a time that my mother was left to eat nothing after giving away her plate of rice to beggars, who turned up at our doorstep. Interestingly, she checks how they dig into the plate, if she sees no enthusiasm in their face, she runs back to the kitchen to make some special treat for them and to date I remember Amma’s radiant yet silent excitement clearly.    Most remarkably, she took everyone into her confidence and treated them in the manner she liked to be treated. One would say she was silly, naïve in certain ways yet she always thought people were sincere like her in their dealings. Most importantly, my parents had a great lifelong partnership while being faithful to each other.    Further, I knew one thing for sure, Amma never did anything to hurt anyone, no malice or ill will towards any as Lincoln put it down illustriously. She was never after material things in life. No cravings whatsoever, She lived a quality happy life with no worries until the fall of my great father, which was the ultimate sky falling to us. In the same sense, the greatest unfortunate loss was to our children, they never had the opportunity of enjoying the luxury of their gracious grandparents in good shape.    Her suffering from Parkinson-ism was one brought from the sansara and not a karma from this life and for the unlucky medical doctors in my sister, brother and in-laws, it was not curable even in this day and age. Yet, I owe deeply to the extraordinary sacrifice made by Niroshan malli.    Over the period, I learnt to appreciate the legacy of my parents and I was constantly reminded by many, in plain clear terms that my parents were very good people and their reference ‘honda minissu’ echoes in me all the time.    - Chinthaka Mendis    Dr. H.A.J. Gunathilaka: An expert on coconut estate management    Dr. H.A.J.Gunathilake fondly known as Jayantha among his family and friends passed away in April after a prolonged illness. He was the former Chairman of the Coconut Development Board and Director of the Coconut Research Institute of Sri Lanka.    Dr. Gunathilaka hailed from a respectable traditional family in Divulapitiya He received his early education in the Divulapitiya and Minuwangoda MahaVidyalayas and entered the Faculty of Agriculture, University of Peradeniya in 1976. Coming from an agricultural background, he had no difficulty in completing the B.Sc Agriculture degree which he passed in 1980, obtaining Second Class. I came to know Jayantha closely after the completion of his degree and while he was in the phase of job hunting. Unlike at present, it was not easy for Agriculture graduates to find employment during then. Having discussed his expectations, I was able to employ him as a temporary Research Assistant in a research project on the cultivation of winged bean (Dambala) at the Dodangolla University Farm about 12 miles from the Peradeniya Campus. This farm at that stage had hardly any facilities, but to my surprise Dr. Gunathilaka agreed to live in the seed laboratory of the farm which had neither electricity nor water supply. For two long years Dr. Gunathilaka survived in this farm, his only companion being a stray dog who lived with him all the time. So much commitment and dedication this young man showed as Research Assistant, that I was very much impressed and decided to help him to secure permanent employment in a government department. We never lost time and in the next phase began job hunting again , as darkness of the night always ends with light of the day. Dr. Gunathilaka’s stars began to turn and a vacancy for an Agronomist was advertised by the Coconut Research Institute, Lunuwila. Considering his background and education, he was appointed for the job. The day he left the farm, Dr. Gunathilaka told me that his long time companion, the dog followed him up to the vehicle and being unable to bear the sorrow collapsed and died. This is a reflection of his kindness which exceeded everything in life.    Dr. Gunathilaka’s life began to bloom at the Coconut Research Institute. He undertook extensive research on the agronomy of coconut and inter cropping and impressed the Directors of the Institute at that time. He was offered a scholarship to pursue a Doctoral degree at the University of Wales ,UK which he completed successfully in 1991.    As Agronomist and later as Head of the Division of Agronomy Dr. Gunathilaka undertook several research projects. His main interest was to increase the land productivity of coconut rather than that of coconut alone. Inter cropping coconut with Gilicidia, a common fence plant introduced from the West Indies in the 1930s was his pet subject. Dr. Gunathilaka’s research began to have some impact and Gliricidia –coconut inter cropping became a popular cropping system accepted by all coconut growers, including, the Coconut Growers’ Association. This research did not stop there as Gliricidia could also be used as a fuel wood, a renewable source of energy. The late Dr. Ray Wijewardena, a professional Engineer turned Agricultural Scientist collaborated with Dr. Gunathilaka to grow Gliricidia and developed a mechanism to generate Glriicidia based sustainable energy through a gasification process. Currently, Gliricidia is used as a renewable energy source on a commercial scale. Dr. Gunathilaka’s work on Gliricidia led to its elevation as the fourth plantation crop, besides tea, rubber and coconut. All that credit goes to Dr. Gunathilaka’s dedication and hard work.    Due to his extensive practical knowledge on coconut cultivation, Dr. Gunathilaka was appointed Chairman of the Coconut Cultivation Board on an assignment basis. This provided an excellent opportunity for him to display his inherent skills in coconut estate development and management. He took several new initiatives like replanting of old plantations, inter-planting, crop-livestock integration and tree crop inter cropping in coconut plantations successfully. Dr. Gunathilaka also worked as Director of the Mahaweli Development Authority and as a visiting lecturer at the Faculties of Agriculture at the Universities of Peradeniya and Ruhuna. He also became known internationally as an expert on coconut estate management and was invited as an expert by the Food and Agriculture Organization to assist develop the coconut industry in the Maldives.    It was in 2005 that I was appointed Chairman of the Coconut Research Board and this created another opportunity for me to work with my old friend and colleague. During my tenure as Chairman, Dr. Gunathilaka reached the pinnacle of his career in 2007 when he was appointed Director of the Coconut Research Institute, which office he held until retirement in April 2016. During the 35 years of his career at the Coconut Research Institute he contributed immensely to the development of the industry. We have lost an eminent scientist who has helped to develop the coconut industry of this country. He will be fondly remembered and sadly missed by his family and friends.    I wish and pray that he attains the supreme bliss of Nirvana.    Prof. H.P.M.Gunasena  Former Chairman,  Coconut Research Board","contentWithMarkup":"Diamantina Mendis : Remembering a wonderful mother   It’s been two years since the loss of my beloved mother. I know well that it is both the eternal miss, sorrow and the pain in me, which I’m certain I have encountered before and would hold me again dearly in the samsara, where I would be better placed to have her around.   We tend to say, the truth of life is suffering, dukkha yet our nature is to distract ourselves from this core truth of life. However, nostalgia is real and profound, when one looks for the innermost thoughts about the loss of parents. Besides, I know very well even the purest state of happiness experienced is also dukkha. Thus, even these great nostalgic memories I raise, is nothing but dukkha. Even so, most recently, a wave of nostalgia swept over me when my good friends, whose association with me go back to school days and who are very familiar with my home set up, recalled how we grew up in Galle. They paid tribute to my mother, whom they loved very much. What is instilled in their mind is the simple,genuine, comfortable person in my mother.    They reminded me of how we were nurtured with self-discipline and self-respect by our parents. Indeed, when we were growing up happily in Galle, my mother was reminding us all the time that if you fill your mind with garbage, it will remain there in your subconscious, and insisted we look for the correct thing. Then, my father always wanted us to fix our thoughts on what is morally correct, and very good, and right, and lovely and meaningful. Thus, Galle remains to date as a constant reminder of the unhindered joy of our childhood.    As I reflect on this Mother’s Day fuelled by the memories recalled by friends and sweet gestures received by Vibhavi, I thought that Mother’s Day can feel absolutely cruel to my sons someday.    My mother had become a teacher straight from her Peradeniya days, a wonderful teacher in the old fashion way taking the noble pedagogic path of her much-venerated parents. In fact, her fascinating journey had begun in her principal father, teacher mother, surrounded by much loved siblings, ever recalling happy memories made, ‘Seenigama Iskole’. She had passed university entrance from Richmond College and had entered the Sangamitta Hall in her much-adored Peradeniya Campus. After graduation, she had first come to Sri Medankara Vidyalaya, Ginthota and from there to spend long beautiful years at Sangamitta Balika Vidyalaya, Galle, which was ever cherished. She always claimed she owed much to her father, beginning from her beautiful handwriting to learning maths with languages, and to literary skills coupled with aesthetic leanings, and then to become the teacher she wanted to with a Geography Special. In fact, Seenigama and Peradeniya days were fondly recalled at every moment which even made her to actively engage in the work of the Peradeniya Alumni Association. As I gather, she was a gifted teacher, a much-loved principal, who always considered others above herself and was held in the highest regard by her students. In fact, she was one of a kind geography enthusiast, capable of making enthralling mind movies and still pictures in the thoughts of her students, making them to somehow check the accuracy of the scenes their teacher made in their mind when they encounter the reality from the Knuckles Range to the Grand Canyon, and then to the Great Barrier Reef.    On the other hand, she was also into writing, book authoring and the fair critic in me keeps her artistry and literary skills on a good pedestal. I consider her paper articles and books quality, interesting stuff and in particular, her book based on the series which appeared in the papers, ‘Spring has Sprung’ only a skilled wordsmith can create. Further, if I may borrow lines from the much poetic Sekere-Amaradeva fame, I’d say ‘Pipi bidena diya bubule, Wala rodaka dura akase, Soba sonduru siri melowe obey esini ma dutuwe’, indeed.    During our formative days, instead of filling our home with material things, our parents used to fill it with books and were instrumental in our every move. Though our father was ever busy with his law practice, Amma inimitably led us to some quality evenings at the Ramparts or while eating out as we never missed a good drama, or a classy musical evening in Galle. Indeed, we grew up listening to Amaradeva and when we follow their poetry from Sudo Sudu to Casabianca “The boy stood on the burning deck, when all but he had fled.... Say, father, say, if yet my task is done?” We could not hold to hear the rest but cry, and in this day Robert Frost too comes to mind with” I’d like to get away from earth awhile, And then come back to it and begin over. May no fate willfully misunderstand me, And half grant what I wish and snatch me away”.    My mother was never into stereotyped religious rituals, yet all in her life she embodied the spirit in “dhammo hawe rakkathi dhamma chari” and giving to others was part of the normal way of life. She was also never into shopping or anything like that and had a clear idea in what she looked for, which actually signifies the virtues in her. She was not envious about anything and had no ill feeling or protectiveness.    She instilled in our minds that when foodstuff is not shared it has no taste so we could not spare even a small chocolate slab without sharing. Her mother too was very benevolent and was into giving and sharing, beginning from her meal.    I can recall many a time that my mother was left to eat nothing after giving away her plate of rice to beggars, who turned up at our doorstep. Interestingly, she checks how they dig into the plate, if she sees no enthusiasm in their face, she runs back to the kitchen to make some special treat for them and to date I remember Amma’s radiant yet silent excitement clearly.    Most remarkably, she took everyone into her confidence and treated them in the manner she liked to be treated. One would say she was silly, naïve in certain ways yet she always thought people were sincere like her in their dealings. Most importantly, my parents had a great lifelong partnership while being faithful to each other.    Further, I knew one thing for sure, Amma never did anything to hurt anyone, no malice or ill will towards any as Lincoln put it down illustriously. She was never after material things in life. No cravings whatsoever, She lived a quality happy life with no worries until the fall of my great father, which was the ultimate sky falling to us. In the same sense, the greatest unfortunate loss was to our children, they never had the opportunity of enjoying the luxury of their gracious grandparents in good shape.    Her suffering from Parkinson-ism was one brought from the sansara and not a karma from this life and for the unlucky medical doctors in my sister, brother and in-laws, it was not curable even in this day and age. Yet, I owe deeply to the extraordinary sacrifice made by Niroshan malli.    Over the period, I learnt to appreciate the legacy of my parents and I was constantly reminded by many, in plain clear terms that my parents were very good people and their reference ‘honda minissu’ echoes in me all the time.    - Chinthaka Mendis    Dr. H.A.J. Gunathilaka: An expert on coconut estate management    Dr. H.A.J.Gunathilake fondly known as Jayantha among his family and friends passed away in April after a prolonged illness. He was the former Chairman of the Coconut Development Board and Director of the Coconut Research Institute of Sri Lanka.    Dr. Gunathilaka hailed from a respectable traditional family in Divulapitiya He received his early education in the Divulapitiya and Minuwangoda MahaVidyalayas and entered the Faculty of Agriculture, University of Peradeniya in 1976. Coming from an agricultural background, he had no difficulty in completing the B.Sc Agriculture degree which he passed in 1980, obtaining Second Class. I came to know Jayantha closely after the completion of his degree and while he was in the phase of job hunting. Unlike at present, it was not easy for Agriculture graduates to find employment during then. Having discussed his expectations, I was able to employ him as a temporary Research Assistant in a research project on the cultivation of winged bean (Dambala) at the Dodangolla University Farm about 12 miles from the Peradeniya Campus. This farm at that stage had hardly any facilities, but to my surprise Dr. Gunathilaka agreed to live in the seed laboratory of the farm which had neither electricity nor water supply. For two long years Dr. Gunathilaka survived in this farm, his only companion being a stray dog who lived with him all the time. So much commitment and dedication this young man showed as Research Assistant, that I was very much impressed and decided to help him to secure permanent employment in a government department. We never lost time and in the next phase began job hunting again , as darkness of the night always ends with light of the day. Dr. Gunathilaka’s stars began to turn and a vacancy for an Agronomist was advertised by the Coconut Research Institute, Lunuwila. Considering his background and education, he was appointed for the job. The day he left the farm, Dr. Gunathilaka told me that his long time companion, the dog followed him up to the vehicle and being unable to bear the sorrow collapsed and died. This is a reflection of his kindness which exceeded everything in life.    Dr. Gunathilaka’s life began to bloom at the Coconut Research Institute. He undertook extensive research on the agronomy of coconut and inter cropping and impressed the Directors of the Institute at that time. He was offered a scholarship to pursue a Doctoral degree at the University of Wales ,UK which he completed successfully in 1991.    As Agronomist and later as Head of the Division of Agronomy Dr. Gunathilaka undertook several research projects. His main interest was to increase the land productivity of coconut rather than that of coconut alone. Inter cropping coconut with Gilicidia, a common fence plant introduced from the West Indies in the 1930s was his pet subject. Dr. Gunathilaka’s research began to have some impact and Gliricidia –coconut inter cropping became a popular cropping system accepted by all coconut growers, including, the Coconut Growers’ Association. This research did not stop there as Gliricidia could also be used as a fuel wood, a renewable source of energy. The late Dr. Ray Wijewardena, a professional Engineer turned Agricultural Scientist collaborated with Dr. Gunathilaka to grow Gliricidia and developed a mechanism to generate Glriicidia based sustainable energy through a gasification process. Currently, Gliricidia is used as a renewable energy source on a commercial scale. Dr. Gunathilaka’s work on Gliricidia led to its elevation as the fourth plantation crop, besides tea, rubber and coconut. All that credit goes to Dr. Gunathilaka’s dedication and hard work.    Due to his extensive practical knowledge on coconut cultivation, Dr. Gunathilaka was appointed Chairman of the Coconut Cultivation Board on an assignment basis. This provided an excellent opportunity for him to display his inherent skills in coconut estate development and management. He took several new initiatives like replanting of old plantations, inter-planting, crop-livestock integration and tree crop inter cropping in coconut plantations successfully. Dr. Gunathilaka also worked as Director of the Mahaweli Development Authority and as a visiting lecturer at the Faculties of Agriculture at the Universities of Peradeniya and Ruhuna. He also became known internationally as an expert on coconut estate management and was invited as an expert by the Food and Agriculture Organization to assist develop the coconut industry in the Maldives.    It was in 2005 that I was appointed Chairman of the Coconut Research Board and this created another opportunity for me to work with my old friend and colleague. During my tenure as Chairman, Dr. Gunathilaka reached the pinnacle of his career in 2007 when he was appointed Director of the Coconut Research Institute, which office he held until retirement in April 2016. During the 35 years of his career at the Coconut Research Institute he contributed immensely to the development of the industry. We have lost an eminent scientist who has helped to develop the coconut industry of this country. He will be fondly remembered and sadly missed by his family and friends.    I wish and pray that he attains the supreme bliss of Nirvana.    Prof. H.P.M.Gunasena  Former Chairman,  Coconut Research Board","tags":[],"publishedDate":"2018-06-02T11:13:11Z","harvestDate":"2018-06-02T21:55:09Z","estimatedPublishedDate":"2018-06-02T11:13:11Z","url":"http://ct.moreover.com/?a=34207237075&p=1u0&v=1&x=nLQXVCp2QASYq14qeRDEvw","originalUrl":"http://www.sundayobserver.lk/2018/06/03/news-features/diamantina-mendis-remembering-wonderful-mother","outboundUrls":[],"wordCount":"2105","dataFormat":"text","duplicateGroupId":"34207237075","media":{"audio":[],"images":[{"url":"http://www.sundayobserver.lk/sites/default/files/styles/large/public/news/2018/06/02/tag-TRIBUTES-1.jpg?itok=lJUl-xnx"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"Good People Co Ltd","symbol":"033340","exchange":"KRX","isin":"KR7033340001","titleCount":0,"contentCount":1,"primary":true}],"author":{"publishingPlatform":{}},"licenses":[{"name":"CLA"}],"source":{"name":"Sunday Observer","homeUrl":"http://www.sundayobserver.lk","category":"National","editorialRank":"3","location":{"country":"Sri Lanka","countryCode":"LK","region":"Asia","subregion":"Southern Asia"},"feed":{"id":"169976129","name":"Sunday Observer","mediaType":"News","tags":[],"language":"Unassigned","dataFormat":"text","rank":{"inboundLinkCount":"175"},"inWhiteList":"true","autoTopics":[],"editorialTopics":["News","Standard"],"genre":"General"}},"es_id":86994203}