{"sequenceId":"845365488924","id":"34207217894","language":"English","title":"Hayes point grabs draw for 14-man Limerick in Munster hurling thriller against Cork","content":"Cork 1-25 Limerick 0-28 Fintan O’Toole reports from Páirc Uí Chaoimh KYLE HAYES POUNCED to ensure Limerick were rewarded for their efforts on a thrilling night of hurling, when he swung over a point deep in injury-time as Cork had to settle for a draw for the second time in six days. Trailing 0-14 to 0-12 at the interval, Limerick turned the match around decisively in the second half with 34,607 supporters in attendance at Páirc Uí Chaoimh to witness a pulsating encounter. Cork and Limerick players battle for possession. Source: James Crombie/INPHO Limerick had been rocked in the 26th minute, a red card brandished towards their attacker Aaron Gillane for a challenge on defender Sean O’Donoghue, who was booked after the incident. Then Cork pounced for what transpired to be the solitary goal of the game in the 44th minute, Patrick Horgan ghosting inside the Limerick cover and when he was picked out by Seamus Harnedy, Horgan drilled a shot to the net. Aaron Gillane is dismissed by referee James Owens. Source: James Crombie/INPHO That score propelled Cork into a 1-15 to 0-15 lead yet Limerick’s response was magnificent with Seamus Flanagan leading the line in attack superbly with a series of fine points. Limerick were in front by three when Tom Morrissey, who deputised for Gillane from placed balls, put over a 65th minute free. Yet Cork reeled off four without reply courtesy of Conor Lehane, Horgan and Darragh Fitzgibbon (2) to nudge themselves into the lead. The action unfolded at a furious pace in the closing stages – Diarmaid Byrnes launching over a free to bring Limerick level, Horgan clipping over a point for Cork before Hayes supplied that crucial late score. Cork had one last chance to hit the winner but Seamus Harnedy under severe pressure saw his strike brilliantly blocked down by Limerick’s Sean Finn. The game began in a sprightly fashion with several scores as Horgan and Fitzgibbon showed early on that they would point the way for Cork, who were in front 0-6 to 0-4 by the 10th minute. Limerick countered to draw level at 0-8 apiece by the 19th minute yet Cork forged ahead from there on in the opening period. But despite the personnel advantage gained by Cork, it was honours even at the finish. Both teams remain unbeaten with Limerick moving on to face Waterford next Sunday and Cork having a weekend off. Scorers for Cork: Patrick Horgan 1-11 (0-7f, 0-1 ’65), Darragh Fitzgibbon 0-4, Conor Lehane 0-3, Shane Kingston, Daniel Kearney 0-2 each, Colm Spillane, Mark Coleman, Luke Meade 0-1 each. Scorers for Limerick: Tom Morrissey 0-9 (0-5f), Seamus Flanagan 0-5, Cian Lynch 0-3, Darragh O’Donovan, Diarmaid Byrnes (0-2f), Graeme Mulcahy, Kyle Hayes 0-2 each, Dan Morrissey, Gearoid Hegarty, Aaron Gillane (0-1f) 0-1 each. Cork 1. Anthony Nash (Kanturk) 2. Sean O’Donoghue (Inniscarra) 3. Damien Cahalane (St Finbarr’s) 4. Colm Spillane (Castlelyons) 5. Mark Ellis (Millstreet) 6. Christopher Joyce (Na Piarsaigh) 7. Mark Coleman (Blarney) 8. Darragh Fitzgibbon (Charleville) 9. Bill Cooper (Youghal) 14. Conor Lehane (Midleton) 11. Dean Brosnan (Glen Rovers) 12. Daniel Kearney (Sarsfields) 13. Shane Kingston (Douglas) 10. Seamus Harnedy (St Ita’s – captain) 15. Patrick Horgan (Glen Rovers) Subs 19. Tim O’Mahony (Newtownshandrum) for O’Donoghue (half-time) 20. Luke Meade (Newcestown) for Brosnan (half-time) 21. Michael Cahalane (Bandon) for Kingston (60) 25. Jamie Coughlan (Newtownshandrum) for Lehane (71) Limerick 1. Nickie Quaid (Effin) 2. Sean Finn (Bruff) 3. Mike Casey (Na Piarsaigh) 4. Richie English (Doon) 5. Diarmaid Byrnes (Patrickswell) 6. Declan Hannon (Adare) 7. Dan Morrissey (Ahane) 8. Darragh O’Donovan (Doon) 9. Cian Lynch (Patrickswell) 10. Gearoid Hegarty (St Patrick’s) 11. Kyle Hayes (Kildimo-Pallaskenny) 12. Tom Morrissey (Ahane) 13. Aaron Gillane (Patrickswell) 14. Seamus Flanagan (Feohanagh-Castlemahon) 15. Graeme Mulcahy (Kilmallock) Subs 24. William O’Donoghue (Na Piarsaigh) for Hannon (inj) (6) 19. David Dempsey (Na Piarsaigh) for Hegarty (55) 17. Paul Browne (Bruff) for O’Donovan (61) 23. Barry Murphy (Doon) for Mulcahy (62) 26. Pat Ryan (Doon) for Flanagan (inj) (64) Referee: James Owens (Wexford) The42 is on Instagram! Tap the button below on your phone to follow us! Follow us: the42.ie ‘The ref just gave up keeping the score at one stage, that’s no word of a lie’ – Clare’s football progress ‘Missing one or two is a lot, but seven or eight, mother of God I couldn’t believe it’","contentWithMarkup":"34,607 were in attendance at Páirc Uí Chaoimh tonight.","tags":["Limerick"],"publishedDate":"2018-06-02T19:57:49Z","harvestDate":"2018-06-02T21:50:42Z","estimatedPublishedDate":"2018-06-02T19:57:49Z","url":"http://ct.moreover.com/?a=34207217894&p=1u0&v=1&x=vC8iho81k0AKGZuHt0d-xw","originalUrl":"http://www.the42.ie/cork-limerick-munster-hurling-4050292-Jun2018/?utm_source=shortlink","commentsUrl":"http://www.the42.ie/cork-limerick-munster-hurling-4050292-Jun2018/#comments","outboundUrls":["https://www.instagram.com/the42.ie","http://www.the42.ie/clare-kerry-munster-football-semi-final-4048586-Jun2018/","http://www.the42.ie/galway-waterford-all-ireland-hurling-4048501-Jun2018/"],"wordCount":"653","dataFormat":"text","duplicateGroupId":"34206745738","media":{"audio":[],"images":[{"url":"http://c3.thejournal.ie/media/2018/06/pat-horgan-and-seamus-harnedy-with-sean-finn-of-richie-english-2-230x150.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"publishingPlatform":{}},"licenses":[],"source":{"name":"TheJournal.ie","homeUrl":"http://www.thejournal.ie/","location":{"country":"Ireland","countryCode":"IE","region":"Europe","subregion":"Northern Europe"},"feed":{"id":"155237192","name":"TheJournal.ie","mediaType":"Blog","publishingPlatform":"WordPress","generator":"http://wordpress.org/?v=3.0","description":"Ireland's Internet Newspaper","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"3","autoRankOrder":"9188","inboundLinkCount":"100"},"inWhiteList":"true","autoTopics":[]}},"es_id":86993722}