{"sequenceId":"845363517379","id":"34207154225","language":"English","title":"'I woke up and didn't recognize my wife'","content":"© BBC Adam and Raquel Gonzales on their wedding day. Adam and Raquel Gonzales had been together for five years when he woke up one morning with no idea who she was - he had lost all memory of marrying her. But Raquel was determined to win him over again. One early morning in September 2016 Raquel walked into the living room in her pyjamas to find her husband looking at her with a puzzled expression. He spoke to her as if she were a stranger, without a trace of affection. He seemed to have no idea who she was. \"I asked him: 'Do you know where you are? Do you know what year this is? Do you know what my name is?' And he said 'No' to all these things,\" Raquel says. \"I could tell that the more I asked, the more upset he was becoming.\" Raquel reassured him that this was their home, she was his wife and they had three children together. Adam started to cry. \"I need you to get me my ID, where is my phone and my ID?\" he said. Raquel told Adam to get dressed and that she was going to take him to hospital immediately. She was worried that something might have gone dangerously wrong with the blood vessels in his brain. © BBC The Gonzales family. When Adam opened his cupboard, he asked: \"Where are my suits?\" Raquel explained that he didn't have any suits, that he was a personal trainer. Adam got dressed and reluctantly followed this woman who he did not know to the hospital. They clung to each other. Raquel was being gentle with Adam - she knew that his memory had failed once before, after a woman tried to murder him. Five years earlier, at the age of 35, Adam had been a branch manager for telecoms giant AT&T and a devoted church leader in Lubbock, Texas. After the break-up of his first marriage, he started a new relationship but it ended in disaster. His new girlfriend was abusive, and ultimately strangled him with an electric cord, leaving him for dead in his garage. He died three times on the way to hospital, he says. Though he was resuscitated by paramedics each time, he ended up in a coma for four months. © BBC Adam in hospital after his attack in 2011. \"When I woke up I didn't know who I was - I didn't know that I had been married and divorced and had two children,\" says Adam.  He spent a year in hospital, learning how to walk and talk again. But the memories of his past life didn't return. Months went by before Adam was reintroduced to his son and daughter. He found it very challenging to look at them for the first time. \"How could a father, a dad, forget his biological children?\" he says. When he finally came home, the house was full of photographs he could not connect with and awards he had no memory of winning. His past was no longer there. \"I was trying to understand who this man Adam was. Can I live up to this person?\" He couldn't go back to his old job and feared he wouldn't be able to afford his previous lifestyle. \"I don't even remember what I went to school [university] for,\" he says. \"It's evident that I was there, but how I got there, how I sustained it, was unimaginable.\" He decided to leave the town he was in and start again. He moved to Phoenix, Arizona, with his children, and became a personal trainer. It was there that he began online dating and in 2012 he began messaging Raquel, a 30-year-old marketing manager with a young daughter.  They agreed to meet in a small hipster bar and grill in downtown Phoenix. Raquel sat at the first booth waiting for him to come in, but an hour later he still hadn't shown up. Eventually he called her - from the wrong restaurant. \"He was so apologetic and humble and I thought: 'OK everybody makes mistakes,''\" says Raquel. Besides, she liked his Texan accent. Adam finally walked in, wearing a leather jacket and jeans. \"He wasn't trying but somehow he looked so cool, he was so handsome,\" says Raquel. \"I couldn't keep my eyes off her - she had these beautiful dimples and she had this really sweet smile,\" says Adam. They clicked and began to see each other more. After a few months of dating, they moved in together with their children, and in July 2015 they married in a little chapel outside Phoenix. But all memory of Adam and Raquel's five years together had been wiped out that morning in September 2016. While Adam was in hospital undergoing tests, he called the one person he knew he could trust - his mother. She reassured him that he had been in love with and married to Raquel. \"She loves you. You have my blessing,\" his mum told him. \"So I began to put a little more trust into her and started asking questions here and there,\" Adam says. \"There was some excitement about it and there was a little bit of mystery about who this really nice woman is, and was.\" © BBC Lulu and Elijah. They started dating and getting to know each other again in hospital, meeting in secluded corners and chatting over grilled-cheese sandwiches at the cafeteria. \"We'd get stir-crazy at night and end up walking downstairs in search for midnight snacks in the vending machines,\" Raquel says. \"She would show me pictures on her cellphone on what back in the day I would have called MySpace but it was Facebook - so that was interesting,\" Adam says. \"Silly things would happen - like he said, 'Do you have our marriage certificate?' and of course I did,\" says Raquel. She was still in the process of changing her name to Adam's so she had it in her handbag. She grabbed it and he laughed. \"I think he began to see glimpses of the woman he married for better or for worse,\" she says. © BBC Adam and Raquel Gonzales. But it was not all positive. At one point Adam decided it would be better if they split up, and even told her: \"I am not attracted to you, and you do not turn me on at all.\" When she heard that, Raquel prayed. \"It's hard to love someone when they have no idea who you are and they cannot love you,\" she says. But she pulled out all the stops. When he came home from hospital Raquel wooed him by learning how to cook - he had done most of the cooking. He saw how Raquel was as a good mother and wife and how well their children got on. © BBC The family in Disneyland. And she took comfort from the fact that Adam's underlying character had not changed. \"In the hospital, Adam would turn to me saying: 'If you're my wife, I think we can kiss,'\" she says. \"This is still the husband I married - he is always trying to get a free kiss. Adam's always been a flirt and continues to be a flirt. \"Those were little rays of hope saying: 'This is still the man that you married - he just can't remember what year,'\" she says. BBC Adam and Raquel Gonzales seated 1 © BBC Adam and Raquel Gonzales. The children also found ways of coping with the sudden change in their life. Abby was 12, Lulu was 15 and Elijah was 17 when Adam's second memory loss occurred in 2016. \"They watched out for each other and I think they were more attentive and they clung together,\" says Raquel. \"Sometimes you don't like your sister when you are a teenager but, boy, when something is happening you cling to your sister, you cling to your blood,\" she says. © BBC Adam and Raquel Gonzales have become pastors. The girls tried to help their father's recovery by showing him gym routines he had taught them. \"Look dad, this is what we did! You taught us all these exercises,\" they told Adam. \"I guess I spent quality time with each of them in the gym,\" he says. Then suddenly, one day in December 2016 - three months after his attack of amnesia - Adam woke up and spoke to Raquel with that familiar loving tone in his voice. He apologised for something that had happened three years earlier, when they were still dating.  Raquel looked at Adam and asked if he knew who she was. © BBC Adam helps his daughter Abby in the gym. He said: \"How could I ever forget you? You are my Raquel.\" \"Oh honey, there is so much I have to tell you about,\" she said. But it was a work day and Raquel was the only breadwinner at this point, so had to leave. She asked Adam to take their daughters to school. Adam went to see if his daughter was ready. She was much older than he remembered, and of course he had no idea what school she went to. After the girls had directed him to their respective schools, Adam asked Lulu to put their home address into the GPS so he wouldn't get lost Adam has now recovered many memories but three years are still missing, including some important milestones, such as his wedding to Raquel. He has also forgotten taking the family on a cherished holiday to Disneyland in 2013. \"I had always wanted to go to Disneyland but I was so busy working,\" he says. \"All that has never come back to me.\" Raquel is preparing for any future episodes of amnesia by carefully documenting the family's milestones.  She says she would happily repeat everything the couple has been through - but no-one knows whether that is likely or not. The doctors gave Adam every test they could - MRIs, CAT scans, echocardiograms - but they could not figure out what caused this second memory loss. The couple are now looking to the future. Two of their three children have left for college, so they're planning a second honeymoon. Adam has returned to working with the church and has become a pastor. \"I really learned how to truly surrender to God and have faith and believe that you can overcome the hardest of struggles,\" he says. \"There is a new level of sweetness in our marriage that I don't think was there before,\" Raquel says. \"Our marriage had to withstand the rain and the storm of change and overcome all that - what better way to test a relationship than making it all collapse? \"My whole life completely changed and it was a beautiful disaster.\" Listen to Adam and Raquel Gonzales speak to Outlook on the BBC World Service. Memory loss after a brain injury Memory problems are very common after any form of brain injury, including traumatic brain injury. This is because there are several parts of the brain involved in storing and retrieving information.Research suggests up two-thirds of people with moderate to severe brain injury have persistent memory problems. Memory problems can last for weeks, months or years. It's impossible to predict whether or not people will get their old memories back. While some memories may return in time, memory loss may last forever and may result in significant milestones, such as wedding and anniversaries, being forgotten. There is no \"cure\" for memory problems after brain injury but there are coping strategies to compensate. These include the use of external memory aids and set routines. Source: Headway - the brain injury association Photographs courtesy of the Gonzales family Also watch: Can redefining Alzheimer's lead to treatment sooner? (Provided by Wochit) Replay Video UP NEXT Cavaliers Forward Will Not Be Suspended For Game 1 Ejection Cleveland Cavaliers forward Tristan Thompson has been fined $25,000 for his altercation with Golden State's Draymond Green during the final moments of Game 1 of the NBA Finals, but won't be suspended. Days after being ejected from the game for being issued a Flagrant Foul 2 by referees, the NBA announced that “upon review,\" Thompson’s foul has now been downgraded to a Flagrant 1. The teams will meet for Game 2 of the NBA Championship this Sunday night in Oakland. Wochit News\rBenedict Cumberbatch Helps Cyclist Being Attacked by Four People in London On Saturday, SF Gate reproted that Benedict Cumberbatch reportedly saved a cyclist who was being attacked by a group of four people in London. According to The Sun, the “Doctor Strange” actor jumped out of his Uber on in central London when he saw a food delivery cyclist for Deliveroo being hit over the head with a bottle. Witnesses say Cumberbatch sprinted to the scene yelling at the muggers. He reportedly dragged the four muggers off the victim, being able to fend them off. Wochit News\rNorth Korea Reportedly Wants Someone to Pay Its Hotel Bill For Summit With U.S. On Saturday CNN reported that US officials are trying to solve the logistical issue of who will pay for North Korean leader Kim Jong Un's housing. A week after abruptly scrapping the summit with Kim, President Donald Trump announced Friday that the historic talks were back on for June 12 in Singapore. The Washington Post reported on Friday that with its economy weakened from tough sanctions, Pyongyang is requiring that another country pay for Kim and his delegation's hotel bill. Wochit News\r1 Cancel SETTINGS OFF\rHD HQ SD LO\rUP NEXT","contentWithMarkup":"<img align=\"left\" src=\"http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAy5stc.img?h=100&w=100&m=6&q=60&o=f&l=f&x=459&y=259\" />","tags":[],"harvestDate":"2018-06-02T21:35:04Z","estimatedPublishedDate":"2018-06-02T21:35:04Z","url":"http://ct.moreover.com/?a=34207154225&p=1u0&v=1&x=uOs1TQB5Q9f1jIWu6YgaLQ","originalUrl":"https://www.msn.com/en-in/lifestyle/relationships/i-woke-up-and-didnt-recognise-my-wife/ar-AAy8l8Z?srcref=rss","outboundUrls":["https://www.bbc.co.uk/programmes/w3cswky3"],"wordCount":"2219","dataFormat":"text","duplicateGroupId":"34192330559","media":{"audio":[],"images":[{"url":"http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAy5stc.img?h=100&w=100&m=6&q=60&o=f&l=f&x=459&y=259"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Phoenix news","group":"US regional"}],"companies":[{"name":"AT&T Inc","symbol":"SOBA","exchange":"HAM","isin":"US00206R1023","titleCount":0,"contentCount":1,"primary":true},{"name":"AT&T Inc","symbol":"SOBA","exchange":"STU","isin":"US00206R1023","titleCount":0,"contentCount":1,"primary":true},{"name":"AT&T Inc","symbol":"SOBA","exchange":"FRA","isin":"US00206R1023","titleCount":0,"contentCount":1,"primary":true},{"name":"AT&T Inc","symbol":"SOBA","exchange":"DUS","isin":"US00206R1023","titleCount":0,"contentCount":1,"primary":true},{"name":"AT&T Inc","symbol":"SOBA","exchange":"BER","isin":"US00206R1023","titleCount":0,"contentCount":1,"primary":true},{"name":"AT&T Inc","symbol":"SOBA","exchange":"MUN","isin":"US00206R1023","titleCount":0,"contentCount":1,"primary":true},{"name":"AT&T Inc","symbol":"SOBA","exchange":"HAN","isin":"US00206R1023","titleCount":0,"contentCount":1,"primary":true},{"name":"AT&T Inc","symbol":"T","exchange":"SWX","isin":"US00206R1023","titleCount":0,"contentCount":1,"primary":true},{"name":"AT&T Inc","symbol":"SOBA","exchange":"ETR","isin":"US00206R1023","titleCount":0,"contentCount":1,"primary":true},{"name":"AT&T Inc","symbol":"T","exchange":"NYS","isin":"US00206R1023","titleCount":0,"contentCount":1,"primary":true},{"name":"AT&T Inc","symbol":"T","exchange":"SGO","isin":"US00206R1023","titleCount":0,"contentCount":1,"primary":true},{"name":"AT&T Inc","symbol":"ATTB34","exchange":"BSP","isin":"BRATTBBDR007","titleCount":0,"contentCount":1,"primary":true},{"name":"AT&T Inc","symbol":"T","exchange":"MEX","isin":"US00206R1023","titleCount":0,"contentCount":1,"primary":true},{"name":"AT&T Inc","symbol":"T","exchange":"BUE","isin":"ARDEUT111713","titleCount":0,"contentCount":1,"primary":true},{"name":"AT&T Inc","symbol":"T","exchange":"LIM","isin":"US00206R1023","titleCount":0,"contentCount":1,"primary":true},{"name":"AT&T Inc","symbol":"ATT","exchange":"WBO","isin":"US00206R1023","titleCount":0,"contentCount":1,"primary":true}],"author":{"publishingPlatform":{}},"licenses":[],"source":{"name":"Style, Beauty & Fashion News, Horoscope, Relationship News | MSN India","homeUrl":"http://www.msn.com/en-in/lifestyle/","location":{"country":"India","countryCode":"IN","region":"Asia","subregion":"Southern Asia"},"feed":{"id":"182236815","name":"Style, Beauty & Fashion News, Horoscope, Relationship News | MSN India","mediaType":"Blog","description":"Get the latest beauty and fashion trends, horoscopes, relationship advice, smart living tips and more.","tags":[],"copyright":"MSN India","language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":["ugc food feeds","ugc sport feeds","ugc recreation feeds","ugc arts feeds","ugc health feeds"],"editorialTopics":["Lifestyle","Consumer"]}},"es_id":86991760}