{"sequenceId":"845362234472","id":"34207112071","language":"English","title":"Weeknote: 14 to 18 May 2018","content":"I started writing weeknotes soon after I joined NHS Digital as head of design in June 2017. I find it a good discipline for me to reflect on my week, and to make sure I’m making progress against my own and my team’s objectives. Because groups of colleagues congregate in different virtual places, I settled on posting them simultaneously to our #design channel on Slack and an internal “blog” on Sharepoint. As an experiment, I’m posting a lightly redacted version here too. Views: my own. Publication status: experimental.  Monday Started the week with the Empower the Person portfolio Monday morning call. Later in design team office hours there was a discussion about examples of well functioning multi-disciplinary teams. We have these working well in some parts of our organisation, and in others... less so. Lots of learning we can do from each other. In the afternoon, I spent some time preparing for the session at e-Health Week (see Wednesday).  Tuesday A catch up with one of the designers who has been working on the connecting to chlamydia testing service beta and is now moving across to join the NHS website redesign team. While it's good to have stability on teams, it's also important that the redesign work is done with input from designers who have worked across a wide range of content and services. Lunch with a colleague from NHS England. We chatted about how human-centred design matches up with the personalised care programmes that he looks after. Back at Bridgewater Place, a short intro meeting with one of our product development directors. I'm trying to work out how best design can support each directorate in NHS Digital's new organisation structure, and he gave me some useful context. Fortnightly design leadership meeting. We confirmed the agenda for the team event (see Thursday), talked about on-boarding some new starters, and generally tidied up the actions in the \"doing\" column of our design leadership Trello board.  Wednesday A packed day at HIMSS UK e-Health Week in London. On arriving, I dialled into a quick phone call I had scheduled with Chris who leads the 111 Online programme. (Only after the call did we realise we were both dialling in from different places at the same venue.) I watched a main theatre presentation by Juliet Bauer, NHS England's Chief Digital Officer, and the Senior Responsible Owner (SRO) for Empower the Person portfolio. While I know what's going on across the portfolio, it's always good to hear Juliet tell the story of the work we're doing. I tweeted a couple of quite of special interest to me and my team.  https://twitter.com/mattedgar/status/996702476421263361  https://twitter.com/mattedgar/status/996704855120056320  After that, I was onto another phone call, with colleagues pulling together our response to the GDS consultation on accessibility of public websites and apps. Sarah, one of our digital graduates did a great job of keeping us on track as we worked through the questions in the consultation. The e-Health Week session I ran with Victoria Betton of m-Habitat Lenny Naar from the Helix Centre was intended to be a hands-on taster of some key human-centred design principles. We asked people to work in pairs, one of them as the \"user\" of a page on the NHS website with a particular scenario in mind (we picked paracetamol as an example). The other half of each pair was the researcher, watching what their user did, and noting down any points about the experience. Later in the session, we asked them to sketch their own potential solutions to improve the page. Always nice to get a mention in someone else's weeknotes. Also at e-Health Week, I saw a session by NHS Digital's Eve Roodhouse, David Corbett and Phil Nixon, and finally met (on her very last working day here!) our wonderful Chief Nurse Anne Cooper.  Thursday On the way into work I picked up on a sketchnote of a #OneTeamGov meetup by Sam Villis at GDS, and got into an interesting conversation about the power of duplication.  https://twitter.com/mattedgar/status/996994276482600961  Sam reflected on that in her weeknote too. The main thing of the day was our design team event - the third time we'd got all the designers together from across NHS Digital since I started here last June. This time we welcomed guests, Helen and Lindsay from the NHS Business Services Authority. Everyone enjoyed hearing their honest account of simplifying the complex world of help with health costs. We ran a couple of rounds of rapid fire show and tells - 14 designers showing their work in the space of 90 minutes. In the event feedback, this format divides opinion - everyone likes hearing about lots of different services, but some say the 5 minute time limit feels rushed. I was just massively impressed that every designer who presented was so good at telling their story to a room of 35 people under time pressure. Over lunch, some of us discussed the work in progress on changes to our cookie consent as part of the GDPR implementation. The team day also gets a mention in Andrew's weeknote. Andrew's weeknotes are always worth a read.  Friday I spent a big chunk of the morning with the Citizen Identity programme, chewing over naming and language in the service. Then an afternoon catching up with emails and planning for the week ahead.","contentWithMarkup":"<em>I started writing <a href=\"https://weeknot.es/\">weeknotes </a>soon after I joined NHS Digital as head of design in June 2017. I find it a good discipline for me to reflect on my week, and to make sure I’m making progress against my own and my team’s objectives. Because groups of colleagues congregate in different virtual places, I settled on posting them simultaneously to our #design channel on Slack and an internal “blog” on Sharepoint. As an experiment, I’m posting a lightly redacted version here too. Views: my own. Publication status: experimental.</em>\n\n<strong>Monday</strong>\nStarted the week with the Empower the Person portfolio Monday morning call.\nLater in design team office hours there was a discussion about examples of well functioning multi-disciplinary teams. We have these working well in some parts of our organisation, and in others... less so. Lots of learning we can do from each other.\nIn the afternoon, I spent some time preparing for the session at e-Health Week (see Wednesday).\n\n<strong>Tuesday</strong>\nA catch up with one of the designers who has been working on the connecting to chlamydia testing service beta and is now moving across to join the NHS website redesign team. While it's good to have stability on teams, it's also important that the redesign work is done with input from designers who have worked across a wide range of content and services.\nLunch with a colleague from NHS England. We chatted about how human-centred design matches up with the personalised care programmes that he looks after.\nBack at Bridgewater Place, a short intro meeting with one of our product development directors. I'm trying to work out how best design can support each directorate in NHS Digital's new organisation structure, and he gave me some useful context.\nFortnightly design leadership meeting. We confirmed the agenda for the team event (see Thursday), talked about on-boarding some new starters, and generally tidied up the actions in the \"doing\" column of our design leadership Trello board.\n\n<strong>Wednesday</strong>\nA packed day at HIMSS UK e-Health Week in London.\nOn arriving, I dialled into a quick phone call I had scheduled with Chris who leads the 111 Online programme. (Only after the call did we realise we were both dialling in from different places at the same venue.)\nI watched a main theatre presentation by Juliet Bauer, NHS England's Chief Digital Officer, and the Senior Responsible Owner (SRO) for Empower the Person portfolio. While I know what's going on across the portfolio, it's always good to hear Juliet tell the story of the work we're doing. I tweeted a couple of quite of special interest to me and my team.\n\nhttps://twitter.com/mattedgar/status/996702476421263361\n\nhttps://twitter.com/mattedgar/status/996704855120056320\n\nAfter that, I was onto another phone call, with colleagues pulling together our response to the GDS consultation on accessibility of public websites and apps. Sarah, one of our digital graduates did a great job of keeping us on track as we worked through the questions in the consultation.\nThe e-Health Week session I ran with Victoria Betton of m-Habitat Lenny Naar from the Helix Centre was intended to be a hands-on taster of some key human-centred design principles. We asked people to work in pairs, one of them as the \"user\" of a page on the NHS website with a particular scenario in mind (we picked paracetamol as an example). The other half of each pair was the researcher, watching what their user did, and noting down any points about the experience. Later in the session, we asked them to sketch their own potential solutions to improve the page. Always nice to get a mention in <a href=\"https://medium.com/%40NorthernWrites/weeknote18-engagement-8bb3aac7c388\" target=\"_blank\" rel=\"noopener\">someone else's weeknotes</a>.\nAlso at e-Health Week, I saw a session by NHS Digital's Eve Roodhouse, David Corbett and Phil Nixon, and finally met (on her very last working day here!) our wonderful Chief Nurse Anne Cooper.\n\n<strong>Thursday</strong>\nOn the way into work I picked up on a sketchnote of a #OneTeamGov meetup by Sam Villis at GDS, and got into an interesting conversation about the power of duplication.\n\nhttps://twitter.com/mattedgar/status/996994276482600961\n\nSam reflected on that in <a href=\"https://weeknot.es/weeknotes-s04-ep2-d2df3f94c374\" target=\"_blank\" rel=\"noopener\">her weeknote</a> too.\nThe main thing of the day was our design team event - the third time we'd got all the designers together from across NHS Digital since I started here last June. This time we welcomed guests, Helen and Lindsay from the NHS Business Services Authority. Everyone enjoyed hearing their honest account of simplifying the complex world of help with health costs. We ran a couple of rounds of rapid fire show and tells - 14 designers showing their work in the space of 90 minutes. In the event feedback, this format divides opinion - everyone likes hearing about lots of different services, but some say the 5 minute time limit feels rushed. I was just massively impressed that every designer who presented was so good at telling their story to a room of 35 people under time pressure.\nOver lunch, some of us discussed the work in progress on changes to our cookie consent as part of the GDPR implementation.\nThe team day also gets a mention in <a href=\"https://grillopress.github.io/2018/05/18/weeknotes-06.html\" target=\"_blank\" rel=\"noopener\">Andrew's weeknote</a>. Andrew's weeknotes are always worth a read.\n\n<strong>Friday</strong>\nI spent a big chunk of the morning with the Citizen Identity programme, chewing over naming and language in the service. Then an afternoon catching up with emails and planning for the week ahead.","tags":["introspection"],"publishedDate":"2018-06-02T21:24:33Z","harvestDate":"2018-06-02T21:24:40Z","estimatedPublishedDate":"2018-06-02T21:24:33Z","url":"http://ct.moreover.com/?a=34207112071&p=1u0&v=1&x=9sK8xV2NBACGHQza6fTKJQ","originalUrl":"http://blog.mattedgar.com/2018/06/02/weeknote-14-to-18-may-2018/","outboundUrls":["https://weeknot.es/","https://medium.com/%40NorthernWrites/weeknote18-engagement-8bb3aac7c388","https://weeknot.es/weeknotes-s04-ep2-d2df3f94c374","https://grillopress.github.io/2018/05/18/weeknotes-06.html","https://twitter.com/mattedgar/status/996702476421263361","https://twitter.com/mattedgar/status/996704855120056320","https://twitter.com/mattedgar/status/996994276482600961"],"wordCount":"876","dataFormat":"text","duplicateGroupId":"34207112071","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"10260"},"adultLanguage":"false","topics":[{"name":"NHS news","group":"Society"}],"companies":[],"author":{"name":"mattedgar","publishingPlatform":{"userId":"285864"}},"licenses":[],"source":{"name":"Matt Edgar writes here","homeUrl":"http://blog.mattedgar.com","location":{"country":"United Kingdom","countryCode":"GB","region":"Europe","subregion":"Northern Europe"},"feed":{"id":"395505848","name":"Matt Edgar writes here","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"284150","generator":"http://wordpress.com/","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"9","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990397}