{"sequenceId":"845365941734","id":"34207226932","language":"English","title":"Applying the Word; June 2, 2018","content":"Mark 4:24-25 \"Consider carefully what you hear,\" he continued. \"With the measure you use, it will be measured to you—and even more. Whoever has will be given more; whoever does not have, even what he has will be taken from him.\"  Translations make a big difference in understanding. This passage was in my memory as, “Be very careful what you hear,” and it wasn't until I read the Japanese, which says, “Pay close attention to what you hear,” that I realized how the NIV expresses it. For once, I approve of the NIV editors' choice! All too often we sit in church and the message is like water on a duck's back, maybe making an impression at the moment but not sinking in at all. Here Jesus is pointing out how dangerous that is, because we tend to think we have knowledge of God and His kingdom, only to discover we know nothing at all. That's why the Bible is full of admonitions like, “Let the word of Christ dwell in you richly as you teach and admonish one another with all wisdom, and as you sing psalms, hymns and spiritual songs with gratitude in your hearts to God.” (Colossians 3:16) That connects with the Old Testament admonition: “Do not let this Book of the Law depart from your mouth; meditate on it day and night, so that you may be careful to do everything written in it. Then you will be prosperous and successful.” (Joshua 1:8) These days we get hung up on the word, meditation, and devise all sorts of systems and formulas, when what Jesus is saying is simply to think about it, letting it percolate in your mind and heart. Then we need to progress to living it out, as it says in James 1:22, or else we're just playing mind games.  I have long known that James 1:22 was directly aimed at me, because I grew up immersed in the Bible, and virtually all of it is very familiar to me. The problem has always been in grasping how it applied to my daily life, and then living it out. Like Paul, I don't want to be someone who teaches others but then blows it himself. (1 Corinthians 9:27) That's one of the biggest reasons I like Wayne Cordeiro's SOAP system of daily devotions, which I have followed for quite a few years now. Scripture, Observation, Application, and Prayer form the framework. Far too many devotional guides leave out Application, which leaves a SOP that might make you feel better for a moment, but doesn't really change you. I have found that it is when I apply what I hear God saying to me that it genuinely cleanses me, washing out the old and recreating me in the image of my Lord. (Romans 8:29)  Father, thank You for Your gracious faithfulness to teach me Your Word. Thank You for the privilege of sharing that with others. Help me both apply it consistently in my own life and lead others to do the same, so that we may be Christ's disciples indeed, for Your glory. Thank You. Hallelujah!","contentWithMarkup":"Mark 4:24-25 \"Consider carefully what you hear,\" he continued. \"With the measure you use, it will be measured to you—and even more. Whoever has will be given more; whoever does not have, even what he has will be taken from him.\"\n\nTranslations make a big difference in understanding. This passage was in my memory as, “Be very careful what you hear,” and it wasn't until I read the Japanese, which says, “Pay close attention to what you hear,” that I realized how the NIV expresses it. For once, I approve of the NIV editors' choice! All too often we sit in church and the message is like water on a duck's back, maybe making an impression at the moment but not sinking in at all. Here Jesus is pointing out how dangerous that is, because we tend to think we have knowledge of God and His kingdom, only to discover we know nothing at all. That's why the Bible is full of admonitions like, “Let the word of Christ dwell in you richly as you teach and admonish one another with all wisdom, and as you sing psalms, hymns and spiritual songs with gratitude in your hearts to God.” (Colossians 3:16) That connects with the Old Testament admonition: “Do not let this Book of the Law depart from your mouth; meditate on it day and night, so that you may be careful to do everything written in it. Then you will be prosperous and successful.” (Joshua 1:8) These days we get hung up on the word, meditation, and devise all sorts of systems and formulas, when what Jesus is saying is simply to think about it, letting it percolate in your mind and heart. Then we need to progress to living it out, as it says in James 1:22, or else we're just playing mind games.\n\nI have long known that James 1:22 was directly aimed at me, because I grew up immersed in the Bible, and virtually all of it is very familiar to me. The problem has always been in grasping how it applied to my daily life, and then living it out. Like Paul, I don't want to be someone who teaches others but then blows it himself. (1 Corinthians 9:27) That's one of the biggest reasons I like Wayne Cordeiro's SOAP system of daily devotions, which I have followed for quite a few years now. Scripture, Observation, Application, and Prayer form the framework. Far too many devotional guides leave out Application, which leaves a SOP that might make you feel better for a moment, but doesn't really change you. I have found that it is when I apply what I hear God saying to me that it genuinely cleanses me, washing out the old and recreating me in the image of my Lord. (Romans 8:29)\n\nFather, thank You for Your gracious faithfulness to teach me Your Word. Thank You for the privilege of sharing that with others. Help me both apply it consistently in my own life and lead others to do the same, so that we may be Christ's disciples indeed, for Your glory. Thank You. Hallelujah!","tags":["Christian","encouragement","Bible translations","daily devotions","doing God's Word","hearing God","meditation","Reading the Bible","SOAP formula","spiritual growth","wayne cordeiro"],"publishedDate":"2018-06-02T21:52:23Z","harvestDate":"2018-06-02T21:52:31Z","estimatedPublishedDate":"2018-06-02T21:52:23Z","url":"http://ct.moreover.com/?a=34207226932&p=1u0&v=1&x=iG7-1d_rLlyOEWzAymmQnA","originalUrl":"https://jgarrott.wordpress.com/2018/06/03/applying-the-word-june-2-2018/","outboundUrls":[],"wordCount":"514","dataFormat":"text","duplicateGroupId":"34207226932","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"6777"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"jgarrott","publishingPlatform":{"userId":"22334322"}},"licenses":[],"source":{"name":"Virtual Vitamins","homeUrl":"https://jgarrott.wordpress.com","location":{},"feed":{"id":"181209116","name":"Virtual Vitamins","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"21825078","generator":"http://wordpress.com/","description":"God's Word is nourishment for the soul. These are nuggets the Lord has given Jack Garrott, a missionary in Japan","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86993936}