{"sequenceId":"845363614711","id":"34207158011","language":"English","title":"BB20 Prologue, Part I: The Future","content":"https://www.youtube.com/watch?v=3VAxwimExn0  Welcome to the first installment of at least a few that will cover the 20th season (actually, the 22nd) of Big Brother here in the United States taking place in the summer of 2018. Full disclosure: this is the last season I'm intending to cover here on this blog - though I intend to be here at least each weekend to update week to week developments.  When I watched the first season eighteen years ago in 2000, I remembered thinking our version of BB might last a few seasons. When the format was dramatically altered for BB2, my opinion didn't really change - this would go a few more seasons and that would be it. By BB7, I thought the series would go at least to fifteen seasons. When the controversial BB15 took place five years ago, I thought the series would remain a fixture for a LONG time - because if a racism kerfuffle couldn't even put a dent into the show, what would?  (It was interesting to note in the wake of the brief resurrection of Roseanne on ABC this year how one tweet knocked that off the air - but the protests against BB15 were very weak in comparison.)  Now, with a little over two weeks to go before BB20 begins, there are some possible signs that we could be finally coming to a fork in the road at the very least. Les Moonves, the CEO of CBS and husband to hostess Julie Chen, is locked in mortal legal combat with Shari Redstone for control over the Viacom/CBS empire. Should Mr. Moonves lose the battle, he will be compensated to the tune of over $180,000,000 - but he will be out of the task of running the network.  If a management change at the top of CBS were to happen, and considering that Big Brother was one of Moonves's pet projects, it wouldn't be inconceivable that BB's future would be in doubt even with a deal in place to run a second Celebrity season sometime in the 2018-2019 TV season. New ownership would probably want to change things, and one of the casualties could wind up being our favorite obsession from the \"house\" in Studio City. Also worth noting is that the premiere date wasn't stated until a couple of weeks ago, something that usually happens much earlier in the year. With that in mind, there may have been (or will be) contingency plans if Les is excused from his CBS duties.  That being said, were the Moonves/Redstone dispute to be solved in say mid-August, I don't think we would turn on CBS on a Thursday live show to find the series had been canceled. I think once the season starts, it'll keep going to a logical conclusion - maybe ending a little earlier in September than perhaps originally planned.  I don't think that Les's ouster and the blood feud with CBS's board would necessarily be the end of the series here in the United States completely. Considering how many Big Brother knock-offs have wound up on the other major networks and on cable, I'm sure one of those networks would take a chance at courting Endemol to keep the series going - though it might take a couple of years for the resurrection, as was the case when American Idol moved from FOX to ABC this year. Big Brother has wound up switching networks in other countries, which begs the question - why not a similar precedent here?  Some on social media have speculated if Moonves was discharged at CBS that Julie Chen would eventually end her long hosting reign on it. To me, that would seem a more likely possibility to me initially and if that were to happen - Arisa Cox, you might want to fine-tune that resume of yours.  Plus, there's always the possibility Moonves wins his day (or whatever) in court - and that would put all the rumors to rest another way. It's a drama that will likely play out as the season unfolds, and I'll keep an eye on it. My thinking is that BB would remain on CBS through 2019 if Moonves wasn't in charge anymore, most likely with a new host to fill out the string.  Next week, I'll make a few pre-season predictions - or, as many as I can without knowing the cast.","contentWithMarkup":"https://www.youtube.com/watch?v=3VAxwimExn0\n\nWelcome to the first installment of at least a few that will cover the 20th season (actually, the 22nd) of <em>Big Brother</em> here in the United States taking place in the summer of 2018. Full disclosure: this is the last season I'm intending to cover here on this blog - though I intend to be here at least each weekend to update week to week developments.\n\nWhen I watched the first season eighteen years ago in 2000, I remembered thinking our version of BB might last a few seasons. When the format was dramatically altered for BB2, my opinion didn't really change - this would go a few more seasons and that would be it. By BB7, I thought the series would go at least to fifteen seasons. When the controversial BB15 took place five years ago, I thought the series would remain a fixture for a LONG time - because if a racism kerfuffle couldn't even put a dent into the show, what would?\n\n(It was interesting to note in the wake of the brief resurrection of <em>Roseanne</em> on ABC this year how <a href=\"https://en.wikipedia.org/wiki/Roseanne#Cancellation\">one tweet knocked that off the air</a> - but the protests against BB15 were very weak in comparison.)\n\nNow, with a little over two weeks to go before BB20 begins, there are some possible signs that we could be finally coming to a fork in the road at the very least. Les Moonves, the CEO of CBS and husband to hostess Julie Chen, is locked <a href=\"https://www.vanityfair.com/news/2018/05/the-war-between-shari-redstone-and-les-moonves-is-going-nuclear\">in mortal legal combat</a> with <a href=\"https://en.wikipedia.org/wiki/Shari_Redstone\">Shari Redstone</a> for control over the Viacom/CBS empire. Should Mr. Moonves lose the battle, he will be compensated to the tune of over $180,000,000 - but he will be out of the task of running the network.\n\nIf a management change at the top of CBS were to happen, and considering that Big Brother was one of Moonves's pet projects, it wouldn't be inconceivable that BB's future would be in doubt even with a deal in place to run a second Celebrity season sometime in the 2018-2019 TV season. New ownership would probably want to change things, and one of the casualties could wind up being our favorite obsession from the \"house\" in Studio City. Also worth noting is that the premiere date wasn't stated until a couple of weeks ago, something that usually happens much earlier in the year. With that in mind, there may have been (or will be) contingency plans if Les is excused from his CBS duties.\n\nThat being said, were the Moonves/Redstone dispute to be solved in say mid-August, I don't think we would turn on CBS on a Thursday live show to find the series had been canceled. I think once the season starts, it'll keep going to a logical conclusion - maybe ending a little earlier in September than perhaps originally planned.\n\nI don't think that Les's ouster and the blood feud with CBS's board would necessarily be the end of the series here in the United States completely. Considering how many <em>Big Brother</em> knock-offs have wound up on the other major networks and on cable, I'm sure one of those networks would take a chance at courting Endemol to keep the series going - though it might take a couple of years for the resurrection, as was the case when <em>American Idol</em> moved from FOX to ABC this year. Big Brother has wound up switching networks in other countries, which begs the question - why not a similar precedent here?\n\nSome on social media have speculated if Moonves was discharged at CBS that Julie Chen would eventually end her long hosting reign on it. To me, that would seem a more likely possibility to me initially and if that were to happen - Arisa Cox, you might want to fine-tune that resume of yours.\n\nPlus, there's always the possibility Moonves wins his day (or whatever) in court - and that would put all the rumors to rest another way. It's a drama that will likely play out as the season unfolds, and I'll keep an eye on it. My thinking is that BB would remain on CBS through 2019 if Moonves wasn't in charge anymore, most likely with a new host to fill out the string.\n\nNext week, I'll make a few pre-season predictions - or, as many as I can without knowing the cast.","tags":["Big Brother 20","Other Reality Shows","Production","ABC","American Idol","julie chen","les moonves","Roseanne","Shari Redstone","the future of Big Brother in the US","Viacom"],"publishedDate":"2018-05-28T14:23:33Z","harvestDate":"2018-06-02T21:36:13Z","estimatedPublishedDate":"2018-05-28T14:23:33Z","url":"http://ct.moreover.com/?a=34207158011&p=1u0&v=1&x=D9ZWsP3BxskrpswBQR1yrA","originalUrl":"https://thebbdiaries.wordpress.com/2018/05/28/bb20-prologue-part-i-the-future/","outboundUrls":["https://en.wikipedia.org/wiki/Roseanne#Cancellation","https://www.vanityfair.com/news/2018/05/the-war-between-shari-redstone-and-les-moonves-is-going-nuclear","https://en.wikipedia.org/wiki/Shari_Redstone","https://www.youtube.com/watch?v=3VAxwimExn0"],"wordCount":"712","dataFormat":"text","duplicateGroupId":"34207158011","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"5051"},"adultLanguage":"false","topics":[],"companies":[{"name":"Prologue SA","symbol":"PROL","exchange":"PAR","isin":"FR0010380626","titleCount":1,"contentCount":0,"primary":true},{"name":"Prologue SA","symbol":"0FPJ","exchange":"LTS","isin":"FR0010380626","titleCount":1,"contentCount":0,"primary":true},{"name":"Prologue SA","symbol":"69P","exchange":"STU","isin":"FR0010380626","titleCount":1,"contentCount":0,"primary":true}],"author":{"name":"tbpauly","publishingPlatform":{"userId":"29607749"}},"licenses":[],"source":{"name":"The Big Brother Diaries","homeUrl":"https://thebbdiaries.wordpress.com","location":{},"feed":{"id":"273587721","name":"The Big Brother Diaries","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"38223405","generator":"http://wordpress.com/","description":"Thoughts And Rambles From A Fan Since BB1","tags":[],"language":"Unassigned","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86991906}