{"sequenceId":"845363770627","id":"34207162354","language":"English","title":"Be careful with credit when purchasing home","content":"Even after you’ve done the work to find the home you want to purchase and negotiated the contract, you’ll still have one important job to do related to your finances: nothing.    That’s because the financial decisions you make when applying for a home loan won’t be a secret to your lender and any actions that negatively affect your financial situation could put your home purchase in jeopardy.    Lenders have strict rules borrowers must follow. Missteps could give your lender a reason to delay your closing or even reject your loan outright and send you back to square one. Be aware of the following financial missteps that could throw a wrench into your deal.    Here’s a few tips to follow:    Don’t hide your financial history. Good decisions start with the application itself. Be up front about your finances and don’t leave any surprises for your lender to discover. Even if there’s something on your credit report that you aren’t proud of, be honest from the start. These issues will show up eventually, and your mortgage broker or banker is likely to have advice for resolving them.  Don’t make any large purchases. You might want to furnish your new place now, but you should wait until after closing to buy expensive furniture or appliances and definitely put that new car on hold. Even if you pay for them with cash, your lender may request updated copies of your bank statements and see you have decreased funds available.  Don’t open a new line of credit. Even applying for a credit card can throw up a red flag when your finances are under a microscope. Stores may try to tempt you by offering a discount on your purchase just for completing an application, but that savings probably isn’t more valuable than closing on your home purchase.  Don’t be late paying your bills. Your lender will be looking at your finances closely on a regular basis, and any negative changes could affect your status.    Daphe Zollinger is the president of the Greater Denton/Wise County Association of Realtors.","contentWithMarkup":"<p>Even after you’ve done the work to find the home you want to purchase and negotiated the contract, you’ll still have one important job to do related to your finances: nothing. </p>\n<p>That’s because the financial decisions you make when applying for a home loan won’t be a secret to your lender and any actions that negatively affect your financial situation could put your home purchase in jeopardy. </p>\n<p>Lenders have strict rules borrowers must follow. Missteps could give your lender a reason to delay your closing or even reject your loan outright and send you back to square one. Be aware of the following financial missteps that could throw a wrench into your deal. </p>\n<p>Here’s a few tips to follow:</p>\n<ul>\n<li>Don’t hide your financial history. Good decisions start with the application itself. Be up front about your finances and don’t leave any surprises for your lender to discover. Even if there’s something on your credit report that you aren’t proud of, be honest from the start. These issues will show up eventually, and your mortgage broker or banker is likely to have advice for resolving them. </li>\n<li>Don’t make any large purchases. You might want to furnish your new place now, but you should wait until after closing to buy expensive furniture or appliances and definitely put that new car on hold. Even if you pay for them with cash, your lender may request updated copies of your bank statements and see you have decreased funds available. </li>\n<li>Don’t open a new line of credit. Even applying for a credit card can throw up a red flag when your finances are under a microscope. Stores may try to tempt you by offering a discount on your purchase just for completing an application, but that savings probably isn’t more valuable than closing on your home purchase. </li>\n<li>Don’t be late paying your bills. Your lender will be looking at your finances closely on a regular basis, and any negative changes could affect your status. </li>\n</ul>\n<p><i>Daphe Zollinger is the president of the Greater Denton/Wise County Association of Realtors.</i></p>","tags":["Business","Real Estate"],"publishedDate":"2018-06-02T19:38:44Z","harvestDate":"2018-06-02T21:37:17Z","estimatedPublishedDate":"2018-06-02T19:38:44Z","url":"http://ct.moreover.com/?a=34207162354&p=1u0&v=1&x=znNTpTsDFT9mD3IvAz8H7A","originalUrl":"http://www.wcmessenger.com/2018/business/be-careful-with-credit-when-purchasing-home/","commentsUrl":"http://www.wcmessenger.com/2018/business/be-careful-with-credit-when-purchasing-home/#respond","outboundUrls":[],"wordCount":"342","dataFormat":"text","duplicateGroupId":"34206877869","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"admin","publishingPlatform":{}},"licenses":[],"source":{"name":"WCMessenger.com","homeUrl":"http://www.wcmessenger.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"177783783","name":"WCMessenger.com","mediaType":"Blog","publishingPlatform":"WordPress","generator":"http://wordpress.org/?v=4.2.3","description":"Wise County Messenger Online Edition","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[],"editorialTopics":["Business","Professional"]}},"es_id":86992105}