{"sequenceId":"845367343291","id":"34207263843","language":"English","title":"Wynne concedes election, looks to save party from irrelevance","content":"TORONTO — In an unprecedented move Liberal Premier Kathleen Wynne is conceding the Ontario election with five days to go. “I’m just going to admit this is a hard thing to do right off the top,” Wynne said in an emotional Saturday morning press conference. “I don’t know who voters will choose, that is up to them, but I’m pretty sure it won’t be me.” “After Thursday I will no longer be Ontario’s premier,” she said. [READ MORE: NDP’s Horwath urges Liberals to vote for her as only way to stop Ford’s Tories] Wynne was surrounded by supporters and campaign staff as she appealed to voters to deliver as many Liberal seats as possible in order to force a minority Progressive Conservative or NDP government. She warned a majority government would give either Tory Leader Doug Ford or NDP Leader Andrea Horwath a “blank cheque” to enact “risky” policies. Voters, she said “are generally worried about giving [the next premier] too much power. They’re worried about giving them too much of a free hand because they’re concerned about what that might mean for our economy and for our future.” “By voting Liberal you can keep the next government — Conservative or NDP — accountable to you,” Wynne said in an unexpected pitch from a Liberal party that has spent the last 15 years governing Ontario with three majority governments and one minority. A source said the party thinks this is the best way to ensure the Liberals win enough seats to be a moderating force in the next parliament. Her concession is the latest twist in an unpredictable campaign that includes a surprise new party leader in Ford, two police investigations, multiple Elections Ontario investigations, a rash of controversial candidates, and a surge in NDP support. Ontario PC leader Doug Ford speaks to supporters at a breakfast meet and greet as candidates Lisa MacLeod and Caroline Mulroney applaud him, in Ottawa on Saturday, June 2, 2018. THE CANADIAN PRESS/Justin Tang Wynne’s plea for a minority government prompted a muted response from Ford at a campaign stop in Nepean, Ont. “We’ve been focused from day one, to make sure that we get our message out. Again, people are just fed up with mismanagement and scandal and waste for the last 15 years,” Ford said. Horwath, who has already made an appeal to strategic voters, was more blunt. In a statement she said Wynne has “abandoned the fight against Doug Ford cuts.” “Her request today for a minority government is a demand that she be allowed to continue to hold the power at Queen’s Park – something voters have already rejected,” Horwath said. She accused the Liberals of playing a “dangerous game.” “Liberal votes won’t result in a minority – they’ll result in a Doug Ford majority. And we can’t afford Ford,” she said. “Now, a vote for Kathleen Wynne and a vote for Doug Ford mean the same thing.” Ontario NDP Leader Andrea Horwath speaks as she greets senior citizen homeowners at a campaign event in Mississauga, Ont., on Saturday, June 2, 2018. THE CANADIAN PRESS/Cole Burston A Liberal source told iPolitics the concession is an acknowledgment of the precarious position the party is in. Public opinion polling shows that the Liberals may not keep official party status after the election. A party needs to have at least eight seats at Queen’s Park to hold official party status. Wynne’s event was held in a riding neighbouring her own Don Valley West riding. Even securing her own seat in this election is not a guarantee. Wynne at times wiped away tears as she spoke about her record in government. She pointed to the increase in the minimum wage, infrastructure and transit projects, and her climate change policies as particular points of pride. “I think you can tell I’m emotional, its hard,” she said. “It’s hard because I know there are Liberals who believe in us and believe in what we’ve been doing.” She acknowledged some of them would be “mad” about her decision. The source said the party thinks this is the best way to ensure the Liberals win enough seats to be a moderating force in the next parliament. ‘Straight crass politics’ Tim Abray, a teaching fellow at Queen’s University called Wynne’s concession a “Hail Mary play” that could work for a very specific slice of voters. “You have to be the kind of person who is really loathe to do anything but vote Liberal and it gives you a reason to get up and get out the door and go cast a ballot for your favourite Liberal candidate without tying it to the idea that they may form a government,” he said. Still he said it’s a move “straight out of the negative campaigning playbook” and “straight crass politics.” “It is an attempt to maintain at least a small sliver of the power and they have a much better chance of doing that in a minority government situation,” he said. Ipsos Public Affairs CEO Darrell Bricker said the latest move by the Liberals won’t work because voters are already thinking strategically. “More people are trying to stop other people than they are actually trying to vote for the parties that they’re voting for,” he said. Given her low poll numbers, Bricker said Wynne had few other options. “People might be critical of it but what else do you expect her to do,” he asked. Follow @MariekeWalsh","contentWithMarkup":"<p><img width=\"5583\" height=\"3778\" src=\"https://ipolitics.ca/wp-content/uploads/2018/05/19155983.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://ipolitics.ca/wp-content/uploads/2018/05/19155983.jpg 5583w, https://ipolitics.ca/wp-content/uploads/2018/05/19155983-600x406.jpg 600w, https://ipolitics.ca/wp-content/uploads/2018/05/19155983-1024x693.jpg 1024w\" sizes=\"(max-width: 5583px) 100vw, 5583px\" />TORONTO — In an unprecedented move Liberal Premier Kathleen Wynne is conceding the Ontario election with five days to go. “I’m just going to admit this is a hard thing to do right off the top,” Wynne said in an emotional Saturday morning press conference. “I don’t know who voters will choose, that is up to them, […]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://ipolitics.ca/2018/06/02/breaking-wynne-concedes-election-looks-to-save-party-from-irrelevance/\">Wynne concedes election, looks to save party from irrelevance</a> appeared first on <a rel=\"nofollow\" href=\"https://ipolitics.ca\">iPolitics</a>.</p>","tags":["iPolitics","News","Politics","Provincial","andrea horwath","Doug Ford","Elections Ontario","kathleen wynne","Ontario Election","ontario liberal party","Ontario NDP","Ontario PC party","Ontario votes"],"publishedDate":"2018-06-02T15:35:47Z","harvestDate":"2018-06-02T22:00:26Z","estimatedPublishedDate":"2018-06-02T15:35:47Z","url":"http://ct.moreover.com/?a=34207263843&p=1u0&v=1&x=chnyD0wz49Bi9o9YsJ5t9A","originalUrl":"https://ipolitics.ca/2018/06/02/breaking-wynne-concedes-election-looks-to-save-party-from-irrelevance/","commentsUrl":"https://ipolitics.ca/2018/06/02/breaking-wynne-concedes-election-looks-to-save-party-from-irrelevance/#comments","outboundUrls":["https://twitter.com/MariekeWalsh?ref_src=twsrc%5Etfw"],"wordCount":"895","dataFormat":"text","duplicateGroupId":"34205530759","media":{"audio":[],"images":[{"url":"https://ipolitics.ca/wp-content/uploads/2018/05/19155983.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"Ipsos SA","symbol":"IPZ","exchange":"MUN","isin":"FR0000073298","titleCount":0,"contentCount":1,"primary":true},{"name":"Ipsos SA","symbol":"IPZ","exchange":"FRA","isin":"FR0000073298","titleCount":0,"contentCount":1,"primary":true},{"name":"Ipsos SA","symbol":"IPZ","exchange":"STU","isin":"FR0000073298","titleCount":0,"contentCount":1,"primary":true},{"name":"Ipsos SA","symbol":"IPZ","exchange":"BER","isin":"FR0000073298","titleCount":0,"contentCount":1,"primary":true},{"name":"Ipsos SA","symbol":"IPS","exchange":"PAR","isin":"FR0000073298","titleCount":0,"contentCount":1,"primary":true},{"name":"Ipsos SA","symbol":"IPSOF","exchange":"PINX","isin":"FR0000073298","titleCount":0,"contentCount":1,"primary":true},{"name":"Ipsos SA","symbol":"IPZ","exchange":"HAM","isin":"FR0000073298","titleCount":0,"contentCount":1,"primary":true},{"name":"Ipsos SA","symbol":"0KA3","exchange":"LTS","isin":"FR0000073298","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"Marieke Walsh","publishingPlatform":{}},"licenses":[],"source":{"name":"iPolitics","homeUrl":"https://ipolitics.ca","location":{"country":"Canada","countryCode":"CA","region":"Americas","subregion":"Northern America"},"feed":{"id":"159670150","name":"iPolitics","mediaType":"Blog","publishingPlatform":"WordPress","generator":"https://wordpress.org/?v=4.9.6","description":"Our crack team of political journalists covers all things Canadian politics and policy.","tags":["News & Politics"],"imageUrl":"https://ipolitics.ca/wp-content/uploads/2018/04/iPolitics-Logo250.png","language":"English","dataFormat":"text","rank":{"autoRank":"2","autoRankOrder":"2093","inboundLinkCount":"906"},"inWhiteList":"true","autoTopics":["ugc politics feeds","ugc financial feeds"]}},"es_id":86994859}