{"sequenceId":"845363726177","id":"34207160958","language":"English","title":"Daly Dose 06-01-18 He won a ring?","content":"It is Friday, and we recap a wild Game 1 of the NBA Finals between the Cleveland Cavaliers and the Golden State Warriors. The Warriors hold on for a win thanks to a big overtime period, and some missed opportunities by the Cavs!  We take a look at a state that is taking advantage of the new sports gambling laws, and we preview the weekend in sports! We have NBA, MLB, NHL NASCAR, and some college sports to keep an eye on ove the next two days.  Finally, this week on our Daly Dose Top 5, we are all aware of some of the great players in NBA history that never won a title. But today, we take a look at some of the other players that may not have been as good, but DID win a championship, that just might make you say “He won a ring???”","contentWithMarkup":"It is Friday, and we recap a wild Game 1 of the NBA Finals between the Cleveland Cavaliers and the Golden State Warriors. The Warriors hold on for a win thanks to a big overtime period, and some missed opportunities by the Cavs!\n\nWe take a look at a state that is taking advantage of the new sports gambling laws, and we preview the weekend in sports! We have NBA, MLB, NHL NASCAR, and some college sports to keep an eye on ove the next two days.\n\nFinally, this week on our Daly Dose Top 5, we are all aware of some of the great players in NBA history that never won a title. But today, we take a look at some of the other players that may not have been as good, but DID win a championship, that just might make you say “He won a ring???”","tags":["Sports"],"publishedDate":"2018-06-01T11:00:00Z","harvestDate":"2018-06-02T21:36:56Z","estimatedPublishedDate":"2018-06-01T11:00:00Z","url":"http://ct.moreover.com/?a=34207160958&p=1u0&v=1&x=khZcoGNSuAtIhHknyp-tKA","originalUrl":"http://www.blogtalkradio.com/dalydose/2018/06/01/daly-dose-06-01-18-he-won-a-ring","commentsUrl":"http://www.blogtalkradio.com/dalydose/2018/06/01/daly-dose-06-01-18-he-won-a-ring/#comments","outboundUrls":[],"wordCount":"146","dataFormat":"text","duplicateGroupId":"34194523947","media":{"audio":[{"url":"http://www.blogtalkradio.com/dalydose/2018/06/01/daly-dose-06-01-18-he-won-a-ring.mp3","mimeType":"audio/mpeg"}],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"publishingPlatform":{}},"licenses":[],"source":{"name":"Blog Talk Radio.com Networks","homeUrl":"http://www.blogtalkradio.com/","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"176165821","name":"Blog Talk Radio.com Networks","mediaType":"Blog","generator":"EZ Rss 0.1","description":"Most Recent Network Episodes on BlogTalkRadio.com . At BlogTalkRadio we offer the best in online entertainment  and have a show for every niche you can think of. If you find that we don't, consider it an opportunity for you  to be the first and make your","tags":[],"imageUrl":"http://www.blogtalkradio.com/img/btrbetalogo.gif","copyright":"BlogTalkRadio.com. All Rights Reserved.","language":"English","dataFormat":"Audio","rank":{"autoRank":"4","autoRankOrder":"17867","inboundLinkCount":"38"},"inWhiteList":"true","autoTopics":[]}},"es_id":86992027}