{"sequenceId":"845363456744","id":"34207152171","language":"English","title":"On respecting the dignity of every human being","content":"  by Esther J. Dharmaraj   To the steady beat of a drum, brightly clad children gushed down the aisle and filled the space in front like water through a narrow bottle neck. They sang and they danced without a proper minute’s respite for the next hour or so. You could not have supposed their exhaustion – not when they did not even for a minute stop smiling. The only indication of fatigue was their glistening brows and lips. They danced robustly and they sang sweetly to a room full of middle-class, if not affluent, Americans who “Ah’ed’” and “Oo’ed’” or joked about how they themselves could benefit from that sort of vigorousness. While there appeared to be such jocundity in the pews as the children sang and danced and introduced themselves – I am Grace, I am Rayan, I am Ibrahim, all I could do was muster every ounce of self-restraint to stop myself from bawling. I continued to watch the spirited rendition through tear-glazed eyes as they declared America is great and as they sang America the Beautiful to an audience that sprang to their feet, their hand over their heart, visibly enraptured by the Ugandan children’s patriotism toward the American nation and an American anthem. When the time rolled around for “collection” for these children they were “rescuing” from deprivation and destitution, they made their contributions. While most with whom I talked – at the narthex of the church that evening after the program – went away with such a sense of joy and satisfaction at not only the performance but also their participation in alleviation of human suffering, I came away so deeply unsettled. And the next several days were spent in reflection of that unsettledness. Did my unsettledness originate from belonging to the two-thirds world – developing or deprived world depending on how you look at the proverbial glass? Was I unsettled because of my knowing that most of the wealth and resources from these places were in large part pilfered by crusading, colonizing powers and continue to be? In an impassioned argument in favor of the motion put forward by the Oxford Union – Britain owes reparations to her former colonies – Shashi Tharoor, Indian politician and Member of Parliament, makes the argument that India was colonized and governed primarily for the sake of Britain’s welfare.  He rather eloquently drives home the point of how India was reduced from holding 23% of the world economy to 4% by the time the British left India in 1947: “By the end of the 19th Century, India was Britain’s biggest cash-cow, the world’s biggest purchaser of British exports and the source of highly paid employment for British civil servants – all at India’s own expense. We literally paid for our own oppression.” This method of keeping the deprived world disadvantaged continues to this day, whether it is through paying inordinate subsidies to farmers in the west who produce and undercut the very livelihood of their poorer counter-parts in the global south or through trade agreements that leave little gains for the poorest countries and deliver much gain to the wealthiest – from tariffs to subsidies to bailouts. Most of the children who sang and danced that evening and millions of others are, in part, in the predicament that requires alleviation and rescue on account of centuries’ old policy of domination and exploitation. The very deprivation that altruistic, good natured Westerners think they are alleviating was in large measure brought about by their forebears and continues to be perpetuated by political and economic policies written and leveraged by prosperous nations. Did my unsettledness originate from seeing many an impoverished child in India – at the bus-stand, in the railway station, or just on a busy street singing and dancing and begging for alms? Witnessing that evening the children breathlessly dancing and singing and ingratiating themselves to the audience, I was reminded of those children, reminded of that rather sad situation that needs remedying whether in some distant shore or within our auditoriums and churches. Did my unsettledness originate from my being the daughter of an Anglican priest in whose very particular context was expected to express a sense of obligation to some people who believed and acted as though it was their munificence that allowed for him and his family to live and eat and go about life? When Ugandan children, from what was clearly presented as a rather depressed setting, have to dance and sing America the Beautiful in order for people to make contributions for their food and education it should leave a rather bad taste in one’s mouth no matter the intentions of the audience. People, children in particular (and there were some who were so young they should not even have been sent on this long voyage leaving behind family for such extended periods of time) should not have to perform to a room full of people in order to raise money for basic human needs such as food and shelter, no matter the placating argument – they are enjoying themselves. Having laid bare my own unsettledness, I am also looking to see how the visitors – children and accompanying adults – could have received on behalf of themselves and their ancestors an offering of goodwill, if not of restitution and reparation; how that evening could have been a celebration of our shared humanity and our cultural diversity and reciprocal interdependence. In searching for a ray of light to appear through some crack, some crevice to relieve the oppressive dark, I found the words of the baptismal covenant: “of striving for justice and peace among all people and respecting the dignity of every human being.” In light of those words, I am looking at the past and envisioning a future. What could have redeemed that evening that started my reflection?  Could it have been a celebration of Ugandan culture and heritage? Could it have been an acknowledgement of culpability and implicatedness? Could it have been a communication of mutual indebtedness?   Esther J. Dharmaraj lives in Simi Valley, CA with her husband. They are parishioners of St. Francis Episcopal Church. A life-long Anglican/Episcopalian, Esther has a Master’s degree in English Literature from the University of Madras and taught high school English in India before emigrating to the United States of America some ten years ago. She has written for periodicals in India and Stateside. Like (0) Dislike (0)","contentWithMarkup":"<p><img class=\"size-medium wp-image-40356 aligncenter\" src=\"https://i2.wp.com/www.episcopalcafe.com/wp-content/uploads/2016/12/Cafe-Magazine-logo.png?resize=300%2C105&ssl=1\" alt=\"\" width=\"300\" height=\"105\" data-recalc-dims=\"1\" /></p>\n<p> </p>\n<p><em>by Esther J. Dharmaraj</em></p>\n<p> </p>\n<p>To the steady beat of a drum, brightly clad children gushed down the aisle and filled the space in front like water through a narrow bottle neck. They sang and they danced without a proper minute’s respite for the next hour or so. You could not have supposed their exhaustion – not when they did not even for a minute stop smiling. The only indication of fatigue was their glistening brows and lips. They danced robustly and they sang sweetly to a room full of middle-class, if not affluent, Americans who “Ah’ed’” and “Oo’ed’” or joked about how they themselves could benefit from that sort of vigorousness.</p>\n<p>While there appeared to be such jocundity in the pews as the children sang and danced and introduced themselves – I am Grace, I am Rayan, I am Ibrahim, all I could do was muster every ounce of self-restraint to stop myself from bawling. I continued to watch the spirited rendition through tear-glazed eyes as they declared America is great and as they sang <em>America the Beautiful</em> to an audience that sprang to their feet, their hand over their heart, visibly enraptured by the Ugandan children’s patriotism toward the American nation and an American anthem. When the time rolled around for “collection” for these children they were “rescuing” from deprivation and destitution, they made their contributions.</p>\n<p>While most with whom I talked – at the narthex of the church that evening after the program – went away with such a sense of joy and satisfaction at not only the performance but also their participation in alleviation of human suffering, I came away so deeply unsettled. And the next several days were spent in reflection of that unsettledness.</p>\n<p>Did my unsettledness originate from belonging to the two-thirds world – developing or deprived world depending on how you look at the proverbial glass? Was I unsettled because of my knowing that most of the wealth and resources from these places were in large part pilfered by crusading, colonizing powers and continue to be?</p>\n<p>In an impassioned argument in favor of the motion put forward by the Oxford Union – <a href=\"http://www.bbc.com/news/world-asia-india-33618621\">Britain owes reparations to her former colonies</a> – Shashi Tharoor, Indian politician and Member of Parliament, makes the argument that India was colonized and governed primarily for the sake of Britain’s welfare.  He rather eloquently drives home the point of how India was reduced from holding 23% of the world economy to 4% by the time the British left India in 1947: “By the end of the 19th Century, India was Britain’s biggest cash-cow, the world’s biggest purchaser of British exports and the source of highly paid employment for British civil servants – all at India’s own expense. We literally paid for our own oppression.” This method of keeping the deprived world disadvantaged continues to this day, whether it is through paying inordinate <a href=\"http://www.ifpri.org/blog/hidden-costs-us-and-eu-farm-subsidies\">subsidies to farmers</a> in the west who produce and undercut the very livelihood of their poorer counter-parts in the global south or through <a href=\"https://www.theguardian.com/global-development/poverty-matters/2011/nov/14/wto-fails-developing-countries\">trade agreements</a> that leave little gains for the poorest countries and deliver much gain to the wealthiest – from tariffs to subsidies to bailouts.</p>\n<p>Most of the children who sang and danced that evening and millions of others are, in part, in the predicament that requires alleviation and rescue on account of centuries’ old policy of domination and exploitation. The very deprivation that altruistic, good natured Westerners think they are alleviating was in large measure brought about by their forebears and continues to be perpetuated by political and economic policies written and leveraged by prosperous nations.</p>\n<p>Did my unsettledness originate from seeing many an impoverished child in India – at the bus-stand, in the railway station, or just on a busy street singing and dancing and begging for alms? Witnessing that evening the children breathlessly dancing and singing and ingratiating themselves to the audience, I was reminded of those children, reminded of that rather sad situation that needs remedying whether in some distant shore or within our auditoriums and churches.</p>\n<p>Did my unsettledness originate from my being the daughter of an Anglican priest in whose very particular context was expected to express a sense of obligation to some people who believed and acted as though it was their munificence that allowed for him and his family to live and eat and go about life? When Ugandan children, from what was clearly presented as a rather depressed setting, have to dance and sing <em>America the Beautiful</em> in order for people to make contributions for their food and education it should leave a rather bad taste in one’s mouth no matter the intentions of the audience.</p>\n<p>People, children in particular (and there were some who were so young they should not even have been sent on this long voyage leaving behind family for such extended periods of time) should not have to perform to a room full of people in order to raise money for basic human needs such as food and shelter, no matter the placating argument – they are enjoying themselves.</p>\n<p>Having laid bare my own unsettledness, I am also looking to see how the visitors – children and accompanying adults – could have received on behalf of themselves and their ancestors an offering of goodwill, if not of restitution and reparation; how that evening could have been a celebration of our shared humanity and our cultural diversity and reciprocal interdependence.</p>\n<p>In searching for a ray of light to appear through some crack, some crevice to relieve the oppressive dark, I found the words of the baptismal covenant: “of striving for justice and peace among all people and respecting the dignity of every human being.” In light of those words, I am looking at the past and envisioning a future. What could have redeemed that evening that started my reflection?  Could it have been a celebration of Ugandan culture and heritage? Could it have been an acknowledgement of culpability and implicatedness? Could it have been a communication of mutual indebtedness?</p>\n<p><em> </em></p>\n<hr />\n<p><em>Esther J. Dharmaraj lives in Simi Valley, CA with her husband. They are parishioners of St. Francis Episcopal Church. A life-long Anglican/Episcopalian, Esther has a Master’s degree in English Literature from the University of Madras and taught high school English in India before emigrating to the United States of America some ten years ago. She has written for periodicals in India and Stateside.</em></p>\n<div class=\"clearfix\"><div class=\"ldc-style-8\"><div class=\"ldc-button\"><span class='ul_cont_like like' id=\"62172\" >Like (<span>0</span>)</span><span class=\"alert-msg\"></span></div></div><div class=\"ldc-style-8\"><div class=\"ldc-button\"><span class='ul_cont_dislike dislike' id=\"62172\" >Dislike (<span>0</span>)</span><span class=\"alert-msg\"></span></div></div></div><img src=\"http://feeds.feedburner.com/~r/episcopalcafe/~4/dBFqHhEBesY\" height=\"1\" width=\"1\" alt=\"\"/>","tags":["Featured Story","The Magazine"],"publishedDate":"2018-06-02T14:58:28Z","harvestDate":"2018-06-02T21:34:37Z","estimatedPublishedDate":"2018-06-02T14:58:28Z","url":"http://ct.moreover.com/?a=34207152171&p=1u0&v=1&x=F24WPN-02E2wIVhfO5WN5w","originalUrl":"https://www.episcopalcafe.com/on-respecting-the-dignity-of-every-human-being/","commentsUrl":"https://www.episcopalcafe.com/on-respecting-the-dignity-of-every-human-being/#comments","outboundUrls":["http://www.bbc.com/news/world-asia-india-33618621","http://www.ifpri.org/blog/hidden-costs-us-and-eu-farm-subsidies","https://www.theguardian.com/global-development/poverty-matters/2011/nov/14/wto-fails-developing-countries","http://www.facebook.com/sharer.php?u=https%3A%2F%2Fwww.episcopalcafe.com%2Fon-respecting-the-dignity-of-every-human-being%2F&#038;t=On%20respecting%20the%20dignity%20of%20every%20human%20being&#038;s=100&#038;p&#091;url&#093;=https%3A%2F%2Fwww.episcopalca","https://twitter.com/intent/tweet?url=https%3A%2F%2Fwww.episcopalcafe.com%2Fon-respecting-the-dignity-of-every-human-being%2F&#038;text=Hey%20check%20this%20out","https://plus.google.com/share?url=https%3A%2F%2Fwww.episcopalcafe.com%2Fon-respecting-the-dignity-of-every-human-being%2F","http://pinterest.com/pin/create/button/?url=https%3A%2F%2Fwww.episcopalcafe.com%2Fon-respecting-the-dignity-of-every-human-being%2F&#038;media=https%3A%2F%2Fi0.wp.com%2Fwww.episcopalcafe.com%2Fwp-content%2Fuploads%2F2017%2F02%2Flightstock_1219_xsmall_jon_","http://www.linkedin.com/shareArticle?mini=true&#038;url=https%3A%2F%2Fwww.episcopalcafe.com%2Fon-respecting-the-dignity-of-every-human-being%2F&#038;title=On%20respecting%20the%20dignity%20of%20every%20human%20being"],"wordCount":"1053","dataFormat":"text","duplicateGroupId":"34207152171","media":{"audio":[],"images":[{"url":"https://i2.wp.com/www.episcopalcafe.com/wp-content/uploads/2016/12/Cafe-Magazine-logo.png?resize=300%2C105&ssl=1"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Episcopal Cafe","publishingPlatform":{}},"licenses":[],"source":{"name":"Episcopal Cafe","homeUrl":"https://www.episcopalcafe.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"186143377","name":"Episcopal Cafe","mediaType":"Blog","publishingPlatform":"WordPress","generator":"WordPress https://wordpress.org/","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"4","autoRankOrder":"19473","inboundLinkCount":"33"},"inWhiteList":"true","autoTopics":[]}},"es_id":86991692}