{"sequenceId":"845364026280","id":"34207170190","language":"English","title":"Updated Data from Ivosidenib Phase 1 Dose-Escalation and Expansion Trial in IDH1m Relapsed or Refractory AML Continue to Show Durable Responses as a Single Agent","content":"- In 179 Relapsed or Refractory IDH1m AML Patients, Primary Endpoint of CR+CRh Rate of 31.8% with a Median Duration CR+CRh of 8.2 Months -   - Updated Data Suggest that R/R AML Patients with IDH1-Mutation Clearance Who Have Achieved CR/CRh Have Prolonged Duration of Remission and Overall Survival -   - Ivosidenib Phase 1 Data in Patients with IDH1m Advanced Hematological Malignancies Published Today in the New England Journal of Medicine -  CHICAGO, June 02, 2018 (GLOBE NEWSWIRE) -- (), a leader in the field of cellular metabolism to treat cancer and rare genetic diseases, today presented new efficacy and safety data from the ongoing Phase 1 dose-escalation and expansion study evaluating single agent oral ivosidenib (TIBSOVO®; AG-120) in patients with relapsed or refractory acute myeloid leukemia (R/R AML) and an isocitrate dehydrogenase-1 (IDH1) mutation. The data were presented in an oral session at the 2018 American Society of Clinical Oncology (ASCO) Annual Meeting. Ivosidenib is an investigational, first-in-class, oral, targeted inhibitor of the mutant IDH1 enzyme under FDA priority review for IDH1m R/R AML patients with a PDUFA action date of August 21, 2018.  Agios also announced the publication in the New England Journal of Medicine (NEJM) of data from the ongoing ivosidenib Phase 1 study in patients with advanced hematological malignancies and an IDH1 mutation. The NEJM manuscript, which was published online today and will appear in the June 21, 2018 print issue, provides analyses from the dataset presented at the 2017 American Society of Hematology (ASH) Annual Meeting, with a data cutoff date of May 12, 2017.  “The findings presented at ASCO demonstrate that single agent ivosidenib induced durable responses, in some cases with IDH1-mutation clearance, and led to favorable responses compared with historical patient outcomes in a high-risk, molecularly-defined R/R AML population,” said Daniel Pollyea, M.D., M.S., study investigator and clinical director of leukemia services at the University of Colorado School of Medicine. “Additional clinical benefits included transfusion independence and, in responding patients, reductions in advanced-grade infections and febrile neutropenia, indicating immune system recovery with functional neutrophils.”  “These data provide additional clinical and translational observations beyond the 2017 ASH presentation, including preliminary data suggesting that R/R AML patients with IDH1-mutation clearance in bone marrow who have achieved CR/CRh have prolonged remission durations and overall survival versus those without IDH1-mutation clearance,” said Chris Bowden, M.D., chief medical officer of Agios. “We believe the compelling single-agent efficacy coupled with a tolerable safety profile validate the potential for ivosidenib to be a first-in-class therapy for patients with R/R AML and an IDH1 mutation.”  Data Presented at ASCO   A total of 258 patients with advanced hematologic malignances and an IDH1 mutation were treated in the Phase 1 study. Enrollment to the study is closed. Complete safety and efficacy data are reported in 179 patients with R/R AML whose ivosidenib starting dose was 500 mg once daily. The median age is 67 (ranging from 18-87), and the median number of prior therapies is two (ranging from one to six). Of these patients, 33% had secondary AML and 24% had prior transplants. The data cutoff for the ASCO presentation was November 10, 2017.  Safety Data  As of the data cut-off, a safety analysis conducted for 179 treated R/R AML patients showed that ivosidenib demonstrates a favorable safety profile that is consistent with previously reported data for all 258 patients. The most common adverse events (AEs) of any grade  25% regardless of causality were diarrhea (33.5%), leukocytosis (31.3%), nausea (31.3%), febrile neutropenia (29.1%), fatigue (28.5%) and electrocardiogram (ECG) QT prolonged (25.7%). Adverse events of interest were the following:  8% reported Grade ≥3 leukocytosis, which was managed with hydroxyurea. 10% reported Grade ≥3 ECG QT prolongation. Ivosidenib dose was reduced in two patients and held in 13 patients (for any grade of ECG QT prolongation). 10.6% reported IDH-differentiation syndrome (IDH-DS) of any grade, which was managed with corticosteroids and diuretics. Six patients had their dose temporarily held, no patients required dose reductions. No AEs of interest lead to any permanent treatment discontinuations or deaths. Efficacy Data  Data from 179 R/R AML patients demonstrated an overall response rate (ORR) of 41.9% (75 of 179 patients) and a combined complete remission (CR) and CR with partial hematologic recovery (CRh) rate of 31.8% [95% CI 25.1, 39.2] which is the primary endpoint of the study.  The CR rate was 24% (43 of 179 patients) [95% CI 18.0, 31.0] and the CRh rate was 7.8% (14 of 179 patients). CRh is defined as 5% of blasts in the bone marrow, no evidence of disease and partial recovery of peripheral blood counts (ANC 500/microliter and platelets 50,000/microliter). Median duration of response was 10.1 months [95% CI 6.5, 22.2] for patients who achieved a CR, 8.2 months [95% CI 5.6, 12.0] for patients who achieved a CR/CRh and 6.5 months [95% CI 5.5, 10.1] for all patients who responded. Median time to first response was 1.9 months (0.8-4.7) for all patients who responded and median time to CR/CRh was 2.0 months [95% CI 0.9, 5.6]. Transfusion independence, defined as an absence of transfusions for at least 56 consecutive days on treatment, was observed across all response categories. Of the patients who were transfusion dependent at baseline and achieved a CR, all became independent of platelet transfusions and 88.2% became independent of RBC transfusions during any 56-day post baseline period.Of the patients who were transfusion dependent at baseline and achieved a CRh, 75% became independent of platelet transfusions and 77.8% became independent of RBC transfusions during any 56-day post baseline period.Achievement of transfusion independence was also seen among non-CR/CRh responders and non-responders. Patients who achieved CR and CRh had lower rates of exposure-adjusted febrile neutropenia and Grade ≥3 infections during ivosidenib treatment than patients in other response categories. Translational Findings  IDH1 mutation clearance, defined as absence of the IDH1 mutation with a sensitivity of 0.02–0.04% (2-4 x10-4), was observed in 23% (11/47) of patients with R/R AML who achieved CR or CRh and had molecular data available, including 28% (10/36) of patients with CR and 1/11 patients with CRh. Preliminary data suggest that R/R AML patients with IDH1-mutation clearance in bone marrow mononuclear cells who have achieved CR/CRh have prolonged remission durations and overall survival versus those without IDH1-mutation clearance.  About Acute Myelogenous Leukemia (AML)  AML, a cancer of blood and bone marrow characterized by rapid disease progression, is the most common acute leukemia affecting adults. Undifferentiated blast cells proliferate in the bone marrow rather than mature into normal blood cells. AML incidence significantly increases with age, and the median age of diagnosis is 68. The vast majority of patients do not respond to chemotherapy and progress to relapsed/refractory AML. The five-year survival rate for AML is approximately 27 percent. IDH1 mutations are present in about 6 to 10 percent of AML cases.  About Agios  Agios is focused on discovering and developing novel investigational medicines to treat cancer and rare genetic diseases through scientific leadership in the field of cellular metabolism. In addition to an active research and discovery pipeline across both therapeutic areas, Agios has an approved oncology precision medicine and multiple first-in-class investigational therapies in clinical and/or preclinical development. All Agios programs focus on genetically identified patient populations, leveraging our knowledge of metabolism, biology and genomics. For more information, please visit the company's website at www.agios.com.  Cautionary Note Regarding Forward-Looking Statements  This press release contains forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995. Such forward-looking statements include those regarding: the potential benefits of TIBSOVO® (ivosidenib); Agios’ plans for the further clinical development of TIBSOVO®; and Agios’ strategic plans and prospects. The words “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “plan,” “predict,” “project,” “would,” “could,” “potential,” “possible,” “hope” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. Such statements are subject to numerous important factors, risks and uncertainties that may cause actual events or results to differ materially from Agios' current expectations and beliefs. For example, there can be no guarantee that any product candidate Agios is developing will successfully commence or complete necessary preclinical and clinical development phases; that positive safety and efficacy findings observed in early stage clinical trials will be replicated in later stage trials; or that development of any of Agios' product candidates will successfully continue. There can be no guarantee that any positive developments in Agios' business will result in stock price appreciation. Management's expectations and, therefore, any forward-looking statements in this press release could also be affected by risks and uncertainties relating to a number of other important factors, including: Agios' results of clinical trials and preclinical studies, including subsequent analysis of existing data and new data received from ongoing and future studies; the content and timing of decisions made by the U.S. FDA and other regulatory authorities, investigational review boards at clinical trial sites and publication review bodies; Agios' ability to obtain and maintain requisite regulatory approvals and to enroll patients in its planned clinical trials; unplanned cash requirements and expenditures; competitive factors; Agios' ability to obtain, maintain and enforce patent and other intellectual property protection for any product candidates it is developing; Agios' ability to maintain key collaborations, such as its agreements with Celgene; and general economic and market conditions. These and other risks are described in greater detail under the caption “Risk Factors” included in Agios’ public filings with the Securities and Exchange Commission. Any forward-looking statements contained in this press release speak only as of the date hereof, and Agios expressly disclaims any obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise.  Contacts   Investors:  Renee Leck, 617-649-8299  Senior Manager, Investor Relations  Renee.Leck@agios.com  Media:  Holly Manning, 617-844-6630  Associate Director, Corporate Communications  Holly.Manning@agios.com","contentWithMarkup":"- In 179 Relapsed or Refractory IDH1m AML Patients, Primary Endpoint of CR+CRh Rate of 31.8% with a Median Duration CR+CRh of 8.2 Months -   - Updated Data Suggest that R/R AML Patients with IDH1-Mutation Clearance Who Have Achieved CR/CRh Have Prolonged Duration of Remission and Overall Survival -   - Ivosidenib Phase 1 Data in Patients with IDH1m Advanced Hematological Malignancies Published Today in the New England Journal of Medicine -  CHICAGO, June 02, 2018 (GLOBE NEWSWIRE) -- (), a leader in the field of cellular metabolism to treat cancer and rare genetic diseases, today presented new efficacy and safety data from the ongoing Phase 1 dose-escalation and expansion study evaluating single agent oral ivosidenib (TIBSOVO®; AG-120) in patients with relapsed or refractory acute myeloid leukemia (R/R AML) and an isocitrate dehydrogenase-1 (IDH1) mutation. The data were presented in an oral session at the 2018 American Society of Clinical Oncology (ASCO) Annual Meeting. Ivosidenib is an investigational, first-in-class, oral, targeted inhibitor of the mutant IDH1 enzyme under FDA priority review for IDH1m R/R AML patients with a PDUFA action date of August 21, 2018.  Agios also announced the publication in the New England Journal of Medicine (NEJM) of data from the ongoing ivosidenib Phase 1 study in patients with advanced hematological malignancies and an IDH1 mutation. The NEJM manuscript, which was published online today and will appear in the June 21, 2018 print issue, provides analyses from the dataset presented at the 2017 American Society of Hematology (ASH) Annual Meeting, with a data cutoff date of May 12, 2017.  “The findings presented at ASCO demonstrate that single agent ivosidenib induced durable responses, in some cases with IDH1-mutation clearance, and led to favorable responses compared with historical patient outcomes in a high-risk, molecularly-defined R/R AML population,” said Daniel Pollyea, M.D., M.S., study investigator and clinical director of leukemia services at the University of Colorado School of Medicine. “Additional clinical benefits included transfusion independence and, in responding patients, reductions in advanced-grade infections and febrile neutropenia, indicating immune system recovery with functional neutrophils.”  “These data provide additional clinical and translational observations beyond the 2017 ASH presentation, including preliminary data suggesting that R/R AML patients with IDH1-mutation clearance in bone marrow who have achieved CR/CRh have prolonged remission durations and overall survival versus those without IDH1-mutation clearance,” said Chris Bowden, M.D., chief medical officer of Agios. “We believe the compelling single-agent efficacy coupled with a tolerable safety profile validate the potential for ivosidenib to be a first-in-class therapy for patients with R/R AML and an IDH1 mutation.”  Data Presented at ASCO   A total of 258 patients with advanced hematologic malignances and an IDH1 mutation were treated in the Phase 1 study. Enrollment to the study is closed. Complete safety and efficacy data are reported in 179 patients with R/R AML whose ivosidenib starting dose was 500 mg once daily. The median age is 67 (ranging from 18-87), and the median number of prior therapies is two (ranging from one to six). Of these patients, 33% had secondary AML and 24% had prior transplants. The data cutoff for the ASCO presentation was November 10, 2017.  Safety Data  As of the data cut-off, a safety analysis conducted for 179 treated R/R AML patients showed that ivosidenib demonstrates a favorable safety profile that is consistent with previously reported data for all 258 patients. The most common adverse events (AEs) of any grade  25% regardless of causality were diarrhea (33.5%), leukocytosis (31.3%), nausea (31.3%), febrile neutropenia (29.1%), fatigue (28.5%) and electrocardiogram (ECG) QT prolonged (25.7%). Adverse events of interest were the following:  8% reported Grade ≥3 leukocytosis, which was managed with hydroxyurea. 10% reported Grade ≥3 ECG QT prolongation. Ivosidenib dose was reduced in two patients and held in 13 patients (for any grade of ECG QT prolongation). 10.6% reported IDH-differentiation syndrome (IDH-DS) of any grade, which was managed with corticosteroids and diuretics. Six patients had their dose temporarily held, no patients required dose reductions. No AEs of interest lead to any permanent treatment discontinuations or deaths. Efficacy Data  Data from 179 R/R AML patients demonstrated an overall response rate (ORR) of 41.9% (75 of 179 patients) and a combined complete remission (CR) and CR with partial hematologic recovery (CRh) rate of 31.8% [95% CI 25.1, 39.2] which is the primary endpoint of the study.  The CR rate was 24% (43 of 179 patients) [95% CI 18.0, 31.0] and the CRh rate was 7.8% (14 of 179 patients). CRh is defined as 5% of blasts in the bone marrow, no evidence of disease and partial recovery of peripheral blood counts (ANC 500/microliter and platelets 50,000/microliter). Median duration of response was 10.1 months [95% CI 6.5, 22.2] for patients who achieved a CR, 8.2 months [95% CI 5.6, 12.0] for patients who achieved a CR/CRh and 6.5 months [95% CI 5.5, 10.1] for all patients who responded. Median time to first response was 1.9 months (0.8-4.7) for all patients who responded and median time to CR/CRh was 2.0 months [95% CI 0.9, 5.6]. Transfusion independence, defined as an absence of transfusions for at least 56 consecutive days on treatment, was observed across all response categories. Of the patients who were transfusion dependent at baseline and achieved a CR, all became independent of platelet transfusions and 88.2% became independent of RBC transfusions during any 56-day post baseline period.Of the patients who were transfusion dependent at baseline and achieved a CRh, 75% became independent of platelet transfusions and 77.8% became independent of RBC transfusions during any 56-day post baseline period.Achievement of transfusion independence was also seen among non-CR/CRh responders and non-responders. Patients who achieved CR and CRh had lower rates of exposure-adjusted febrile neutropenia and Grade ≥3 infections during ivosidenib treatment than patients in other response categories. Translational Findings  IDH1 mutation clearance, defined as absence of the IDH1 mutation with a sensitivity of 0.02–0.04% (2-4 x10-4), was observed in 23% (11/47) of patients with R/R AML who achieved CR or CRh and had molecular data available, including 28% (10/36) of patients with CR and 1/11 patients with CRh. Preliminary data suggest that R/R AML patients with IDH1-mutation clearance in bone marrow mononuclear cells who have achieved CR/CRh have prolonged remission durations and overall survival versus those without IDH1-mutation clearance.  About Acute Myelogenous Leukemia (AML)  AML, a cancer of blood and bone marrow characterized by rapid disease progression, is the most common acute leukemia affecting adults. Undifferentiated blast cells proliferate in the bone marrow rather than mature into normal blood cells. AML incidence significantly increases with age, and the median age of diagnosis is 68. The vast majority of patients do not respond to chemotherapy and progress to relapsed/refractory AML. The five-year survival rate for AML is approximately 27 percent. IDH1 mutations are present in about 6 to 10 percent of AML cases.  About Agios  Agios is focused on discovering and developing novel investigational medicines to treat cancer and rare genetic diseases through scientific leadership in the field of cellular metabolism. In addition to an active research and discovery pipeline across both therapeutic areas, Agios has an approved oncology precision medicine and multiple first-in-class investigational therapies in clinical and/or preclinical development. All Agios programs focus on genetically identified patient populations, leveraging our knowledge of metabolism, biology and genomics. For more information, please visit the company's website at www.agios.com.  Cautionary Note Regarding Forward-Looking Statements  This press release contains forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995. Such forward-looking statements include those regarding: the potential benefits of TIBSOVO® (ivosidenib); Agios’ plans for the further clinical development of TIBSOVO®; and Agios’ strategic plans and prospects. The words “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “plan,” “predict,” “project,” “would,” “could,” “potential,” “possible,” “hope” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. Such statements are subject to numerous important factors, risks and uncertainties that may cause actual events or results to differ materially from Agios' current expectations and beliefs. For example, there can be no guarantee that any product candidate Agios is developing will successfully commence or complete necessary preclinical and clinical development phases; that positive safety and efficacy findings observed in early stage clinical trials will be replicated in later stage trials; or that development of any of Agios' product candidates will successfully continue. There can be no guarantee that any positive developments in Agios' business will result in stock price appreciation. Management's expectations and, therefore, any forward-looking statements in this press release could also be affected by risks and uncertainties relating to a number of other important factors, including: Agios' results of clinical trials and preclinical studies, including subsequent analysis of existing data and new data received from ongoing and future studies; the content and timing of decisions made by the U.S. FDA and other regulatory authorities, investigational review boards at clinical trial sites and publication review bodies; Agios' ability to obtain and maintain requisite regulatory approvals and to enroll patients in its planned clinical trials; unplanned cash requirements and expenditures; competitive factors; Agios' ability to obtain, maintain and enforce patent and other intellectual property protection for any product candidates it is developing; Agios' ability to maintain key collaborations, such as its agreements with Celgene; and general economic and market conditions. These and other risks are described in greater detail under the caption “Risk Factors” included in Agios’ public filings with the Securities and Exchange Commission. Any forward-looking statements contained in this press release speak only as of the date hereof, and Agios expressly disclaims any obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise.  Contacts   Investors:  Renee Leck, 617-649-8299  Senior Manager, Investor Relations  Renee.Leck@agios.com  Media:  Holly Manning, 617-844-6630  Associate Director, Corporate Communications  Holly.Manning@agios.com","tags":[],"harvestDate":"2018-06-02T21:38:55Z","estimatedPublishedDate":"2018-06-02T21:38:55Z","url":"http://ct.moreover.com/?a=34207170190&p=1u0&v=1&x=JxY3LEPN4eHOnXQVirKP8g","originalUrl":"https://www.vbprofiles.com/press_releases/5b130d84b9abe45f391c0c54","outboundUrls":["https://www.globenewswire.com/Tracker?data=jSeKKMxqDRp1_yOY289v7xPmryo5MdxO97OMiyANirAlfzDuJgj8UpUSDW4Dvs50TNwSf3HvdqfxMkpPHiKggw==","https://www.globenewswire.com/Tracker?data=bwMo9NSEM8HM8iwvEchLG4KQrNz9P5sDDKGf22AHpWCFZLu69lDE-8YdK5awSB2UYVm-FnCV8m1G8ihIggKoyfjTLwoKZD1zGb0mnJ3VhXU=","https://www.globenewswire.com/Tracker?data=FwHkMjjufvZKNz4qlNFopKzMbgO1CPzSBz6yseiERhvwgQ-VbR9T6HkyFQa3LV_tCgyeZtDQ2rh1mp8ieZZXZIueZaojbY0hGFMjxJNLCdc=","https://www.globenewswire.com/NewsRoom/AttachmentNg/d8e7652d-64f4-4083-8fbc-9c91c627d91b"],"wordCount":"1517","dataFormat":"text","duplicateGroupId":"34206782511","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"publishingPlatform":{}},"licenses":[{"name":"Publicly Available"}],"source":{"name":"Venture Beat Profiles","homeUrl":"http://www.venturebeatprofiles.com","category":"Press Wire","editorialRank":"4","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"169769573","name":"Venture Beat Profiles","mediaType":"News","tags":[],"language":"Unassigned","dataFormat":"text","rank":{"inboundLinkCount":"1"},"inWhiteList":"true","autoTopics":[],"editorialTopics":["Wires","Standard"],"genre":"Press Release"}},"es_id":86992318}