{"sequenceId":"845363809120","id":"34207164454","language":"English","title":"Linux 4.18 To Ship ARM64 SSBD For Spectre V4 Mitigation, LSE Atomics By Default","content":"We Rely On Your Support: Did you know that the hundreds of articles written on Phoronix each month are mostly authored by one individual working insane hours? Phoronix.com doesn't have a whole news room with unlimited resources and relies upon people reading our content without blocking ads and alternatively by people subscribing to Phoronix Premium for our ad-free service with other extra features. You can also consider a tip via PayPal. Linux 4.18 To Ship ARM64 SSBD For Spectre V4 Mitigation, LSE Atomics By Default Written by Michael Larabel in Linux Kernel on 2 June 2018 at 05:26 PM EDT. Add A Comment Since the unveiling of Spectre Variant Four last month ARM has been publishing patches for their mitigation for the 64-bit ARM CPUs. While the Intel/AMD and POWER mitigation landed for Linux 4.17, the SSBD work on AArch64 is landing for Linux 4.18.\rARM has put their Speculative Store Bypass Disable patches through several rounds of review and the code is now queued in for-next/core of new material slated to land in the Linux 4.18 merge window. The ARM64 SSBD patches are not currently marked for back-porting to existing stable series.\rThose not wanting to incur the performance cost of SSBD can boot their system with ssbd=force-off.\rAnother ARM64 architectural change for Linux 4.18 is that LSE (Large System Extensions) Atomics are being enabled by default which use the LSE instructions for in-kernel atomic routines. The atomic instructions are designed to scale in \"very large systems.\" Add A Comment\tTweet About The Author Michael Larabel is the principal author of Phoronix.com and founded the site in 2004 with a focus on enriching the Linux hardware experience. Michael has written more than 10,000 articles covering the state of Linux hardware support, Linux performance, graphics drivers, and other topics. Michael is also the lead developer of the Phoronix Test Suite, Phoromatic, and OpenBenchmarking.org automated benchmarking software. He can be followed via Twitter or contacted via MichaelLarabel.com. Related Linux Kernel News BPFILTER Landing For Linux 4.18 For Eventually Better Firewall / Packet Filtering The Linux Kernel's HID Multi-Touch Driver Gets Rewritten, Microsoft Surface Dial Support Linux 4.17-rc7 Released: Linux 4.17.0 Might Be Out Next Week Schedutil CPU Frequency Scaling Governor Improvements Coming To Linux 4.18 Spectre V2 & Meltdown Linux Fixes Might Get Disabled For Atom N270 & Other In-Order CPUs Linux 4.9, 4.14, 4.16 Point Releases Bring SSBD For Spectre V4 Popular News This Week Git Issues Batch Of New Releases To Fix Security Issues Jade: New Linux Desktop Built On Python, HTML5 & JavaScript Systemd Introduces \"Portable Services\" Functionality, Similar To Containers Firefox Developers Still Hesitant About Using EGL Over GLX On X11 Linux Dell Rolls Out New Precision Developer Laptops With Ubuntu Linux GNOME 3.29.2 Released As The Second Step Towards GNOME 3.30","contentWithMarkup":"Since the unveiling of Spectre Variant Four last month ARM has been publishing patches for their mitigation for the 64-bit ARM CPUs. While the Intel/AMD and POWER mitigation landed for Linux 4.17, the SSBD work on AArch64 is landing for Linux 4.18...<img src=\"http://feeds.feedburner.com/~r/Phoronix/~4/j6ezZl3tqCw\" height=\"1\" width=\"1\" alt=\"\"/>","tags":[],"publishedDate":"2018-06-02T21:26:52Z","harvestDate":"2018-06-02T21:37:47Z","estimatedPublishedDate":"2018-06-02T21:26:52Z","url":"http://ct.moreover.com/?a=34207164454&p=1u0&v=1&x=R3MKMb_JX4IratF2TDPALQ","originalUrl":"https://www.phoronix.com/scan.php?page=news_item&px=Linux-4.18-ARM64-Has-SSBD","outboundUrls":["https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&hosted_button_id=3778540","https://git.kernel.org/pub/scm/linux/kernel/git/arm64/linux.git/log/?h=for-next/core","https://twitter.com/share","http://twitter.com/MichaelLarabel","http://www.michaellarabel.com/"],"wordCount":"443","dataFormat":"text","duplicateGroupId":"34177755973","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Open source news","group":"Technology"},{"name":"OS news","group":"Technology"},{"name":"Linux news","group":"Technology"},{"name":"Stock Exchanges news","group":"Finance"}],"companies":[{"name":"Lifull Co Ltd","symbol":"2120","exchange":"TKS","isin":"JP3758140002","titleCount":0,"contentCount":1,"primary":true},{"name":"Lifull Co Ltd","symbol":"NXCLF","exchange":"PINX","isin":"JP3758140002","titleCount":0,"contentCount":1,"primary":true}],"author":{"publishingPlatform":{}},"licenses":[],"source":{"name":"Phoronix","homeUrl":"http://www.phoronix.com/","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"19301316","name":"Phoronix","mediaType":"Blog","description":"Linux Hardware Reviews & News","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"1","autoRankOrder":"804","inboundLinkCount":"3321"},"inWhiteList":"true","autoTopics":["ugc technology feeds"]}},"es_id":86992150}