{"sequenceId":"845363488269","id":"34207152899","language":"English","title":"7 Reasons to Consider a Rebrand (and Why Research Matters)","content":"For many marketers, a rebrand is a tantalizing idea. It’s also a time-consuming process that you need to think deeply about before you dive in. Yes, a rebrand can feel like a fresh beginning, but it’s not always necessary or beneficial. Just because you don’t like your brand’s logo doesn’t mean you need to scratch everything.    As has been well-publicized, a disastrous rebrand can hurt both your reputation and your bottom line. Lest we forget, Gap’s 2010 logo redesign lasted exactly one week, while Tropicana’s sales fell 20% after their 2009 rebrand .    As the adage goes, “If it ain’t broke, don’t fix it.” But how do you know when the time is right?   7 Signs You Need to Rebrand   There are certainly reasons to consider a rebrand, as we’ll cover below. However, while these may be applicable, no decision should be made without doing significant research, having serious discussions with leadership, and crafting a strong execution plan. (No one has time, money, and energy to waste on a sloppy execution—and, we promise, the Internet will not be kind.)    That said, if you want to know if a rebrand is the right move, here are seven reasons why it might be.   1) You Look Like Everybody Else In Your Industry   Industries change and evolve, and savvy brands do their best to keep up. However, sometimes brands start to think in hivemind and subconsciously adopt each other’s traits. There’s no differentiation, no originality, no standing out. (For example, Netflix and YouTube are both streaming-video services that use a red, white, and black palette. When Twitch launched with an in-your-face purple palette, it made a strong visual statement to differentiate.)    Another reason brands can start to look like alike is because they try to one-up each other through rebrands. Just because a competitor changed a logo doesn’t mean you have to. When a rebrand is reactionary, it rarely feels authentic, unique, and original.    You can see this phenomenon happening all across the tech industry, as type designer James Edmonson of Oh No Type Co pointed out:     EVERYBODY FALL IN LINE! pic.twitter.com/B9JU5nvpMu    — OH no Type Co (@OHnoTypeCo) February 13, 2018       If you’ve fallen victim to this, a rebrand might be the only way to claim your space and steal the spotlight. (Not sure where you stand in your industry? Follow our tips to do a competitive analysis to find out.)    Example: The Parkinson’s Foundation brand identity could have been mistaken for pretty much any nonprofit organization, from saving the ocean to tutoring kids. But a 2018 rebrand by Ultravirgo helped bring focus, life, and a cohesive feel that reflects the organization’s unique mission.   BEFORE      AFTER       Images by Ultravirgo   2) You’re Going After a New Audience   Sometimes your company is looking to attract a new group of people, but your branding is not primed to help you connect with them. (Unsurprisingly, many brands have struggled to attract millennials, whose media consumption habits and values differ from other generations.)    Your brand should always speak to the people you’re trying to reach, so in this case, a rebrand may be the right choice. However, you don’t want to do anything that would alienate your existing customer base (again, think of the Gap reaction). Ideally your rebrand would be something that enhances your brand identity in a way that both appeals to existing and new customers.    Example: Coca-Cola’s recent rebrand of Diet Coke, with help from Kenyon Weston , is aimed at grabbing millennial attention, with new flavors and fresh, sleek, colorful cans.      3) Your Brand Has Expanded   With any success comes the urge to expand—regardless of industry. However, many brands have identities that don’t reflect their current brand strategy or offerings. They may be constrained by cumbersome logos that don’t adapt well for the web or by names that are too product-specific.    If you haven’t had a rebrand since your founder’s great grandfather started the business, you’re probably in need of a rebrand that is modern, flexible, and future-proof.    Example: Over the last 87 years, Ad Age has evolved from a one-sheet to a multi-platform media brand. Its 2017 rebrand by OCD gave the brand a bolder, more colorful identity, suitable for web, print, and any other media.      4) Your Brand Is Painfully Outdated   This is probably the number one reason brands want to rebrand. If the look and feel of your brand is stale and you’re embarrassed to go on your website, a rebrand might be in the cards.    This is a common problem for industries that evolve quickly. (FYI, Google has had seven logos over the last 20 years.) The instinct to rebrand is understandable; however, there is a difference between an old logo and an outdated logo. If you have a well-established brand, it’s best to do solid audience research before tossing the old one out. Again, the infamous Gap logo disaster saw a backlash because they brand tried to “modernize,” when consumers felt far more connected to the iconic logo.    Example: Sometimes modernization is simply a subtle tweak. In 2016 Pentagram designed a new logo for Mastercard, creating a modern feel while retaining the iconic overlapping circles. It was a simple way to bring their ‘90s-inspired design into the future.      5) It Doesn’t Reflect Your Values   As you surely know, people (especially millennials) want to align themselves with brands whose values they share. If you’ve crafted a strong brand strategy and articulated your core identity (your company’s vision, mission, and values), you should know what those are.    However, if those have evolved or were not initially articulated when your brand identity was created, they may not be reflected in your brand identity.    Example: ACLU’s mission is “to defend and preserve the individual rights and liberties guaranteed to every person in this country by the Constitution and laws of the United States.” To introduce a patriotic, inclusive feel, they collaborated with Open to rebrand with a new logo that incorporates red, white, and blue—and is flexible enough to be personalized for individual chapters.   BEFORE      AFTER      6) You’ve Dealt With Bad Press   As Tungsten Branding President Phil Davis told Ad Age in the wake of the Harvey Weinstein scandal, “Good branding can’t cover up bad behavior.” However, if you’ve found yourself in hot water and have taken measured steps to make things right and align your values to your practices, then a rebrand might help you move on.    Example: The Lance Armstrong Foundation rebranded as LIVESTRONG after its founder was embroiled in a doping scandal. The new name is so popular that its earlier iteration has been pretty much forgotten.      7) You’ve Merged or Acquired   With new ownership or partnership comes a new era, so it makes sense to rebrand. (According to the 2017 Landor M&A Brand Study , which analyzed the behavior of S&P Global 100 companies over the past 10 years, 74% of all companies rebranded an acquired asset within the first seven years.)    But this type of rebranding should be done with care—and with common sense. (Who remembers the “Sterling Cooper Draper Pryce” merger on Mad Men ?)    Example: Verizon was a successful rebrand, born from the merger of Bell Atlantic and GTE. However, Yahoo was widely mocked when it was renamed Altaba.   Remember: Don’t Make the Decision Lightly   Rebranding is not always a bad idea, but it is important to have total buy-in before you invest in a full rebrand. In some cases, you just need a little guidance to align your current branding with your current strategy.","contentWithMarkup":"<p>For many marketers, a rebrand is a tantalizing idea. It’s also a time-consuming process that you need to think deeply about before you dive in. Yes, a rebrand can feel like a fresh beginning, but it’s not always necessary or beneficial. Just because you don’t like your brand’s logo doesn’t mean you need to scratch everything.</p>\n<p>As has been well-publicized, a disastrous rebrand can hurt both your reputation and your bottom line. Lest we forget, <a href=\"http://adage.com/article/news/branding-gap-s-logo-change-disaster/146525/\" target=\"_blank\" rel=\"nofollow external noopener noreferrer\" data-wpel-link=\"external\">Gap’s 2010 logo redesign </a>lasted exactly one week, while Tropicana’s sales<a href=\"http://adage.com/article/news/tropicana-line-s-sales-plunge-20-post-rebranding/135735/\" target=\"_blank\" rel=\"nofollow external noopener noreferrer\" data-wpel-link=\"external\"> fell 20% after their 2009 rebrand</a>.</p>\n<p>As the adage goes, “If it ain’t broke, don’t fix it.” But how do you know when the time is right?</p>\n<h3><b>7 Signs You Need to Rebrand</b></h3>\n<p>There are certainly reasons to consider a rebrand, as we’ll cover below. However, while these may be applicable, no decision should be made without doing significant research, having serious discussions with leadership, and crafting a strong execution plan. (No one has time, money, and energy to waste on a sloppy execution—and, we promise, the Internet will not be kind.)</p>\n<p>That said, if you want to know if a rebrand is the right move, here are seven reasons why it might be.</p>\n<h3><b>1) You Look Like Everybody Else In Your Industry</b></h3>\n<p>Industries change and evolve, and savvy brands do their best to keep up. However, sometimes brands start to think in hivemind and subconsciously adopt each other’s traits. There’s no differentiation, no originality, no standing out. (For example, Netflix and YouTube are both streaming-video services that use a red, white, and black palette. When Twitch launched with an in-your-face purple palette, it made a strong visual statement to differentiate.)</p>\n<p>Another reason brands can start to look like alike is because they try to one-up each other through rebrands. Just because a competitor changed a logo doesn’t mean you have to. When a rebrand is reactionary, it rarely feels authentic, unique, and original.</p>\n<p>You can see this phenomenon happening all across the tech industry, as type designer James Edmonson of <a href=\"http://www.ohnotype.co/\" target=\"_blank\" rel=\"nofollow external noopener noreferrer\" data-wpel-link=\"external\">Oh No Type Co</a> pointed out:</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">EVERYBODY FALL IN LINE! <a href=\"https://t.co/B9JU5nvpMu\">pic.twitter.com/B9JU5nvpMu</a></p>\n<p>— OH no Type Co (@OHnoTypeCo) <a href=\"https://twitter.com/OHnoTypeCo/status/963529463353851905?ref_src=twsrc%5Etfw\">February 13, 2018</a></p></blockquote>\n<p><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>If you’ve fallen victim to this, a rebrand might be the only way to claim your space and steal the spotlight. (Not sure where you stand in your industry? Follow our <a href=\"https://www.columnfivemedia.com/how-to-do-a-competitive-analysis-in-5-steps\" target=\"_blank\" rel=\"nofollow noopener\" data-wpel-link=\"internal\">tips to do a competitive analysis</a> to find out.)</p>\n<p><em>Example: The Parkinson’s Foundation brand identity could have been mistaken for pretty much any nonprofit organization, from saving the ocean to tutoring kids. But a 2018 rebrand by <a href=\"http://www.ultravirgo.com/work/parkinsons.html\" target=\"_blank\" rel=\"nofollow external noopener noreferrer\" data-wpel-link=\"external\">Ultravirgo</a> helped bring focus, life, and a cohesive feel that reflects the organization’s unique mission.</em></p>\n<h4>BEFORE</h4>\n<p><img class=\"size-full wp-image-2070013 alignnone \" src=\"https://cdn.business2community.com/wp-content/uploads/2018/05/Ultravirgo-rebrand-example.jpg\" alt=\"Ultravirgo rebrand example\" /></p>\n<p><strong>AFTER</strong></p>\n<p><img class=\"size-full wp-image-2070014 alignnone\" title=\"Ultravirgo rebrand example 2\" src=\"https://cdn.business2community.com/wp-content/uploads/2018/05/Ultravirgo-rebrand-example-2.jpg\" alt=\"Ultravirgo rebrand example 2\" /></p>\n<p><em>Images by <a href=\"http://www.ultravirgo.com/news/2017/11/fighting-parkinsons-together.html\" target=\"_blank\" rel=\"nofollow external noopener noreferrer\" data-wpel-link=\"external\">Ultravirgo</a></em></p>\n<h3><b>2) You’re Going After a New Audience</b></h3>\n<p>Sometimes your company is looking to attract a new group of people, but your branding is not primed to help you connect with them. (Unsurprisingly, many brands have struggled to attract millennials, whose media consumption habits and values differ from other generations.)</p>\n<p>Your brand should always speak to the people you’re trying to reach, so in this case, a rebrand may be the right choice. However, you don’t want to do anything that would alienate your existing customer base (again, think of the Gap reaction). Ideally your rebrand would be something that enhances your brand identity in a way that both appeals to existing and new customers.</p>\n<p><em>Example: Coca-Cola’s recent rebrand of Diet Coke, with help from <a href=\"http://kenyonweston.com/\" target=\"_blank\" rel=\"nofollow external noopener noreferrer\" data-wpel-link=\"external\">Kenyon Weston</a>, is aimed at grabbing millennial attention, with new flavors and fresh, sleek, colorful cans.</em></p>\n<p><img class=\"size-full wp-image-2070015 alignnone\" title=\"Diet coke rebrand\" src=\"https://cdn.business2community.com/wp-content/uploads/2018/05/Diet-coke-rebrand.jpg\" alt=\"Diet coke rebrand\" /></p>\n<h3><b>3) Your Brand Has Expanded</b></h3>\n<p>With any success comes the urge to expand—regardless of industry. However, many brands have identities that don’t reflect their <a href=\"https://www.columnfivemedia.com/how-to-create-a-brand-strategy\" target=\"_blank\" rel=\"nofollow noopener\" data-wpel-link=\"internal\">current brand strategy</a> or offerings. They may be constrained by cumbersome logos that don’t adapt well for the web or by names that are too product-specific.</p>\n<p>If you haven’t had a rebrand since your founder’s great grandfather started the business, you’re probably in need of a rebrand that is modern, flexible, and future-proof.</p>\n<p><em>Example: Over the last 87 years, Ad Age has evolved from a one-sheet to a multi-platform media brand. Its 2017 rebrand by <a href=\"http://originalchampionsofdesign.com/\" target=\"_blank\" rel=\"nofollow external noopener noreferrer\" data-wpel-link=\"external\">OCD</a></em><em> gave the brand a bolder, more colorful identity, suitable for web, print, and any other media.</em></p>\n<p><img class=\"size-full wp-image-2070016 alignnone\" src=\"https://cdn.business2community.com/wp-content/uploads/2018/05/ad-age-rebrand.jpe\" alt=\"ad age rebrand\" /></p>\n<h3><b>4) Your Brand Is Painfully Outdated</b></h3>\n<p>This is probably the number one reason brands want to rebrand. If the look and feel of your brand is stale and you’re embarrassed to go on your website, a rebrand might be in the cards.</p>\n<p>This is a common problem for industries that evolve quickly. (FYI, Google has had <a href=\"https://en.wikipedia.org/wiki/Google_logo\" target=\"_blank\" rel=\"nofollow external noopener noreferrer\" data-wpel-link=\"external\">seven logos</a> over the last 20 years.) The instinct to rebrand is understandable; however, there is a difference between an old logo and an outdated logo. If you have a well-established brand, it’s best to do solid audience research before tossing the old one out. Again, the infamous Gap logo disaster saw a backlash because they brand tried to “modernize,” when consumers felt far more connected to the iconic logo.</p>\n<p><em>Example: Sometimes modernization is simply a subtle tweak. In 2016 <a href=\"https://www.pentagram.com/\" target=\"_blank\" rel=\"nofollow external noopener noreferrer\" data-wpel-link=\"external\">Pentagram</a> designed a new logo for Mastercard, creating a modern feel while retaining the iconic overlapping circles. It was a simple way to bring their ‘90s-inspired design into the future. </em></p>\n<p><img class=\"size-full wp-image-2070017 alignnone \" title=\"mastercard rebrand\" src=\"https://cdn.business2community.com/wp-content/uploads/2018/05/mastercard-rebrand.jpg\" alt=\"mastercard rebrand\" /></p>\n<h3><b>5) It Doesn’t Reflect Your Values</b></h3>\n<p>As you surely know, people (especially millennials) want to align themselves with brands whose values they share. If you’ve crafted a strong brand strategy and articulated your core identity (your company’s vision, mission, and values), you should know what those are.</p>\n<p>However, if those have evolved or were not initially articulated when your brand identity was created, they may not be reflected in your brand identity.</p>\n<p><em><b>Example:</b> ACLU’s mission is “to defend and preserve the individual rights and liberties guaranteed to every person in this country by the Constitution and laws of the United States.” To introduce a patriotic, inclusive feel, they collaborated with <a href=\"http://www.notclosed.com/\" target=\"_blank\" rel=\"nofollow external noopener noreferrer\" data-wpel-link=\"external\">Open</a> to rebrand with a new logo that incorporates red, white, and blue—and is flexible enough to be personalized for individual chapters.</em></p>\n<h4>BEFORE</h4>\n<p><img class=\"size-full wp-image-2070018 alignnone \" src=\"https://cdn.business2community.com/wp-content/uploads/2018/05/ACLU-rebrand-1.jpg\" alt=\"ACLU rebrand\" /></p>\n<p><b>AFTER</b></p>\n<p><img class=\"size-full wp-image-2070019  alignnone\" title=\"ACLU rebrand 2\" src=\"https://cdn.business2community.com/wp-content/uploads/2018/05/ACLU-rebrand-2-1.jpg\" alt=\"ACLU rebrand 2\" /></p>\n<h3><b>6) You’ve Dealt With Bad Press</b></h3>\n<p>As Tungsten Branding President Phil Davis told <a href=\"http://adage.com/article/cmo-strategy/weinstein-a-rebrand-helen-reddy/310825/\" target=\"_blank\" rel=\"nofollow external noopener noreferrer\" data-wpel-link=\"external\"><i>Ad Age</i></a> in the wake of the Harvey Weinstein scandal, “Good branding can’t cover up bad behavior.” However, if you’ve found yourself in hot water and have taken measured steps to make things right and align your values to your practices, then a rebrand might help you move on.</p>\n<p><em>Example: The Lance Armstrong Foundation rebranded as LIVESTRONG after its founder was embroiled in a doping scandal. The new name is so popular that its earlier iteration has been pretty much forgotten.</em></p>\n<p><img class=\"size-full wp-image-2070020  alignnone\" title=\"Livestrong logo rebrand\" src=\"https://cdn.business2community.com/wp-content/uploads/2018/05/Livestrong-logo-rebrand.jpg\" alt=\"Livestrong logo rebrand\" /></p>\n<h3><b>7) You’ve Merged or Acquired </b></h3>\n<p>With new ownership or partnership comes a new era, so it makes sense to rebrand. (According to the 2017 <a href=\"https://landor.com/news/landor-ma-brand-study-first-quantitative-ma-brand-benchmark\" target=\"_blank\" rel=\"nofollow external noopener noreferrer\" data-wpel-link=\"external\">Landor M&A Brand Study</a>, which analyzed the behavior of S&P Global 100 companies over the past 10 years, 74% of all companies rebranded an acquired asset within the first seven years.)</p>\n<p>But this type of rebranding should be done with care—and with common sense. (Who remembers the “Sterling Cooper Draper Pryce” merger on <i>Mad Men</i>?)</p>\n<p><em>Example: Verizon was a successful rebrand, born from the merger of Bell Atlantic and GTE. However, Yahoo was widely mocked when it was renamed Altaba. </em></p>\n<h3><b>Remember: Don’t Make the Decision Lightly</b></h3>\n<p>Rebranding is not always a bad idea, but it is important to have total buy-in before you invest in a full rebrand. In some cases, you just need a little guidance to align your current branding with your current strategy.</p>\n<img src=\"http://feeds.feedburner.com/~r/B2CMarketingInsider/~4/kT5ZWA6Nny8\" height=\"1\" width=\"1\" alt=\"\"/>","tags":["Branding"],"publishedDate":"2018-06-02T21:00:16Z","harvestDate":"2018-06-02T21:34:46Z","estimatedPublishedDate":"2018-06-02T21:00:16Z","url":"http://ct.moreover.com/?a=34207152899&p=1u0&v=1&x=m3l_D6qleRMQhwJbnNWKpg","originalUrl":"https://www.business2community.com/branding/7-reasons-to-consider-a-rebrand-and-why-research-matters-02070012","commentsUrl":"https://www.business2community.com/branding/7-reasons-to-consider-a-rebrand-and-why-research-matters-02070012#respond","outboundUrls":["http://adage.com/article/news/branding-gap-s-logo-change-disaster/146525/","http://adage.com/article/news/tropicana-line-s-sales-plunge-20-post-rebranding/135735/","http://www.ohnotype.co/","https://t.co/B9JU5nvpMu","https://twitter.com/OHnoTypeCo/status/963529463353851905?ref_src=twsrc%5Etfw","https://www.columnfivemedia.com/how-to-do-a-competitive-analysis-in-5-steps","http://www.ultravirgo.com/work/parkinsons.html","http://www.ultravirgo.com/news/2017/11/fighting-parkinsons-together.html","http://kenyonweston.com/","https://www.columnfivemedia.com/how-to-create-a-brand-strategy","http://originalchampionsofdesign.com/","https://en.wikipedia.org/wiki/Google_logo","https://www.pentagram.com/","http://www.notclosed.com/","http://adage.com/article/cmo-strategy/weinstein-a-rebrand-helen-reddy/310825/","https://landor.com/news/landor-ma-brand-study-first-quantitative-ma-brand-benchmark"],"wordCount":"1222","dataFormat":"text","duplicateGroupId":"34207152899","media":{"audio":[],"images":[{"url":"https://cdn.business2community.com/wp-content/uploads/2018/05/ACLU-rebrand-1.jpg"},{"url":"https://cdn.business2community.com/wp-content/uploads/2018/05/Livestrong-logo-rebrand.jpg"},{"url":"https://cdn.business2community.com/wp-content/uploads/2018/05/Diet-coke-rebrand.jpg"},{"url":"https://cdn.business2community.com/wp-content/uploads/2018/05/Ultravirgo-rebrand-example-2.jpg"},{"url":"https://cdn.business2community.com/wp-content/uploads/2018/05/mastercard-rebrand.jpg"},{"url":"https://cdn.business2community.com/wp-content/uploads/2018/05/ACLU-rebrand-2-1.jpg"},{"url":"https://cdn.business2community.com/wp-content/uploads/2018/05/Ultravirgo-rebrand-example.jpg"},{"url":"https://cdn.business2community.com/wp-content/uploads/2018/05/ad-age-rebrand.jpe"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"Altaba Inc","symbol":"AABA","exchange":"MEX","isin":"US0213461017","titleCount":0,"contentCount":2,"primary":true},{"name":"Altaba Inc","symbol":"AABA","exchange":"BUE","isin":"ARDEUT111051","titleCount":0,"contentCount":2,"primary":true},{"name":"Altaba Inc","symbol":"AABA","exchange":"NAS","isin":"US0213461017","titleCount":0,"contentCount":2,"primary":true},{"name":"Altaba Inc","symbol":"ALA","exchange":"BER","isin":"US0213461017","titleCount":0,"contentCount":2,"primary":true},{"name":"Altaba Inc","symbol":"ALA","exchange":"MUN","isin":"US0213461017","titleCount":0,"contentCount":2,"primary":true},{"name":"Altaba Inc","symbol":"ALA","exchange":"ETR","isin":"US0213461017","titleCount":0,"contentCount":2,"primary":true},{"name":"Altaba Inc","symbol":"ALA","exchange":"HAN","isin":"US0213461017","titleCount":0,"contentCount":2,"primary":true},{"name":"Altaba Inc","symbol":"AABA","exchange":"SWX","isin":"US0213461017","titleCount":0,"contentCount":2,"primary":true},{"name":"Altaba Inc","symbol":"ALA","exchange":"DUS","isin":"US0213461017","titleCount":0,"contentCount":2,"primary":true},{"name":"Altaba Inc","symbol":"ALA","exchange":"STU","isin":"US0213461017","titleCount":0,"contentCount":2,"primary":true},{"name":"Altaba Inc","symbol":"ALA","exchange":"HAM","isin":"US0213461017","titleCount":0,"contentCount":2,"primary":true},{"name":"Altaba Inc","symbol":"ALA","exchange":"FRA","isin":"US0213461017","titleCount":0,"contentCount":2,"primary":true},{"name":"Altaba Inc","symbol":"AABA","exchange":"LIM","isin":"US0213461017","titleCount":0,"contentCount":2,"primary":true},{"name":"Altaba Inc","symbol":"AABA","exchange":"SGO","isin":"US0213461017","titleCount":0,"contentCount":2,"primary":true},{"name":"Altaba Inc","symbol":"ATBA","exchange":"WBO","isin":"US0213461017","titleCount":0,"contentCount":2,"primary":true},{"name":"Altaba Inc","symbol":"AABA","exchange":"MIL","isin":"US0213461017","titleCount":0,"contentCount":2,"primary":true},{"name":"Coca-Cola Co","symbol":"KO","exchange":"BUE","isin":"ARDEUT110111","titleCount":0,"contentCount":1,"primary":false},{"name":"Coca-Cola Co","symbol":"CCC3","exchange":"HAN","isin":"US1912161007","titleCount":0,"contentCount":1,"primary":false},{"name":"Coca-Cola Co","symbol":"CCC3","exchange":"MUN","isin":"US1912161007","titleCount":0,"contentCount":1,"primary":false},{"name":"Coca-Cola Co","symbol":"CCC3","exchange":"FRA","isin":"US1912161007","titleCount":0,"contentCount":1,"primary":false},{"name":"Coca-Cola Co","symbol":"CCC3","exchange":"STU","isin":"US1912161007","titleCount":0,"contentCount":1,"primary":false},{"name":"Coca-Cola Co","symbol":"KO","exchange":"MEX","isin":"US1912161007","titleCount":0,"contentCount":1,"primary":false},{"name":"Coca-Cola Co","symbol":"CCC3","exchange":"DUS","isin":"US1912161007","titleCount":0,"contentCount":1,"primary":false},{"name":"Coca-Cola Co","symbol":"CCC3","exchange":"BER","isin":"US1912161007","titleCount":0,"contentCount":1,"primary":false},{"name":"Coca-Cola Co","symbol":"COCA34","exchange":"BSP","isin":"BRCOCABDR002","titleCount":0,"contentCount":1,"primary":false},{"name":"Coca-Cola Co","symbol":"KO","exchange":"SWX","isin":"US1912161007","titleCount":0,"contentCount":1,"primary":false},{"name":"Coca-Cola Co","symbol":"CCC3","exchange":"ETR","isin":"US1912161007","titleCount":0,"contentCount":1,"primary":false},{"name":"Coca-Cola Co","symbol":"KO","exchange":"SGO","isin":"US1912161007","titleCount":0,"contentCount":1,"primary":false},{"name":"Coca-Cola Co","symbol":"KO","exchange":"NYS","isin":"US1912161007","titleCount":0,"contentCount":1,"primary":false},{"name":"Coca-Cola Co","symbol":"KO","exchange":"BSE","isin":"US1912161007","titleCount":0,"contentCount":1,"primary":false},{"name":"Coca-Cola Co","symbol":"KO","exchange":"LIM","isin":"US1912161007","titleCount":0,"contentCount":1,"primary":false},{"name":"Coca-Cola Co","symbol":"KO","exchange":"WBO","isin":"US1912161007","titleCount":0,"contentCount":1,"primary":false},{"name":"S&P Global Inc","symbol":"SPGI","exchange":"NYS","isin":"US78409V1044","titleCount":0,"contentCount":1,"primary":false},{"name":"S&P Global Inc","symbol":"MHL","exchange":"BER","isin":"US78409V1044","titleCount":0,"contentCount":1,"primary":false},{"name":"S&P Global Inc","symbol":"MHL","exchange":"STU","isin":"US78409V1044","titleCount":0,"contentCount":1,"primary":false},{"name":"S&P Global Inc","symbol":"MHL","exchange":"DUS","isin":"US78409V1044","titleCount":0,"contentCount":1,"primary":false},{"name":"S&P Global Inc","symbol":"MHL","exchange":"FRA","isin":"US78409V1044","titleCount":0,"contentCount":1,"primary":false},{"name":"S&P Global Inc","symbol":"MHL","exchange":"MUN","isin":"US78409V1044","titleCount":0,"contentCount":1,"primary":false},{"name":"S&P Global Inc","symbol":"SPGI","exchange":"MEX","isin":"US78409V1044","titleCount":0,"contentCount":1,"primary":false}],"author":{"name":"Katy French","publishingPlatform":{}},"licenses":[],"source":{"name":"Business 2 Community","homeUrl":"https://www.business2community.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"593505447","name":"Business 2 Community","mediaType":"Blog","publishingPlatform":"WordPress","generator":"https://wordpress.org/?v=4.9.5","description":"Top Trends, News & Expert Analysis","tags":[],"imageUrl":"https://www.business2community.com/wp-content/uploads/2016/11/cropped-B2C_square_512px-1-32x32.png","language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"34395","inboundLinkCount":"13"},"inWhiteList":"true","autoTopics":["ugc marketing feeds","ugc media feeds","ugc financial feeds"]}},"es_id":86991724}