{"sequenceId":"845362392786","id":"34207118380","language":"English","title":"It’s the final countdown","content":"We are on the final countdown, with Wednesday being Roy's last treatment day and time for celebration. He has had no side effects, he doesn't glow in the dark or have any superpowers although we are forever hopeful he achieves the latter!  We are forever thankful that we had options and everything has gone to plan with a great outcome.  And thank goodness for Winston's gold card. For those not in NZ,  Winston Peters is a long serving MP (who will be the stand-in Prime Minister whilst Jacinda is on maternity leave) who a few years ago organised a gold card for senior citizens which entitles them to free public transport in most major cities as well as discounts at some stores. The gold card has been used by Roy every day for the past 7 and a half weeks to get the train in and out to Newmarket, then a free bus to the hospital and return. It has saved us not only many $$$'s but also in time and stress as we haven't had to drive in, fighting the traffic, looking for parking, as well as petrol costs. Well done Winnie!  It's been another week of catching up with friends and family. Bill & Linda came visiting last Sunday as they were having an open home is readiness to sell, so it was great to catch up with them. Gary & Marg called in on their way through Auckland for lunch on Wednesday, and of course I had my lunch \"date\"with Janet on Thursday. Steve & Les called in on Saturday with two of their granddaughters on their way back to Whangamata. In between we have had Drs appointments and other matters to attend to so all in all a busy old time, which is great as it means that we are never bored!  On Friday I was asked if I would drive a motorhome from the wharf to Drury as I had done the previous week.  Sure, why not? So off we trotted on Friday afternoon, on the train this time into Britomart, however, I had to pay for my journey as I have a few years to go before I qualify for one of Winnie's cards.  This time I did take a couple of pictures of the vehicles we were picking up.      I drove the one at the rear in the above photo.  First we have to visit the petrol station just around the corner to put in enough diesel to get us back.  That done we all headed off.  We had discussed which exit would be the best to get off the motorway as this was Friday afternoon and it was also the start of the long weekend Queens Birthday weekend which meant that the traffic would be worse than usual, if that is all possible.  Once crawling along the motorway I got to the Redoubt Road edit at Manukau and could see the traffic was at a standstill ahead so I ducked off there.  Wending my way through the back roads (just as well I know my way around), avoiding schools as by this time it after 3pm and schools were finishing, however I got to Drury in good time.  Then I had to wait at least 30minutes for the others to start to arrive, each one had taken a different exit hence our staggered arrival times.  The weather has been brilliant this past week, well, brilliantly fine during the day but freezing cold overnight. There is a kiwi fruit orchard over the back of Ardmore and so for a few nights helicopters have been flying over the vines for frost protection. During cold and still conditions, the down draught from the helicopter causes the slightly warmer air layered above to circulate amongst the vines, reducing the likelyhood of frost damage. Effective but noisy.  Now we have rain settled in for the day by the looks of it, oh well, at least it's warmer.","contentWithMarkup":"We are on the final countdown, with Wednesday being Roy's last treatment day and time for celebration. He has had no side effects, he doesn't glow in the dark or have any superpowers although we are forever hopeful he achieves the latter!  We are forever thankful that we had options and everything has gone to plan with a great outcome.\n\nAnd thank goodness for Winston's gold card. For those not in NZ,  Winston Peters is a long serving MP (who will be the stand-in Prime Minister whilst Jacinda is on maternity leave) who a few years ago organised a gold card for senior citizens which entitles them to free public transport in most major cities as well as discounts at some stores. The gold card has been used by Roy every day for the past 7 and a half weeks to get the train in and out to Newmarket, then a free bus to the hospital and return. It has saved us not only many $$$'s but also in time and stress as we haven't had to drive in, fighting the traffic, looking for parking, as well as petrol costs. Well done Winnie!\n\nIt's been another week of catching up with friends and family. Bill & Linda came visiting last Sunday as they were having an open home is readiness to sell, so it was great to catch up with them. Gary & Marg called in on their way through Auckland for lunch on Wednesday, and of course I had my lunch \"date\"with Janet on Thursday. Steve & Les called in on Saturday with two of their granddaughters on their way back to Whangamata. In between we have had Drs appointments and other matters to attend to so all in all a busy old time, which is great as it means that we are never bored!\n\nOn Friday I was asked if I would drive a motorhome from the wharf to Drury as I had done the previous week.  Sure, why not? So off we trotted on Friday afternoon, on the train this time into Britomart, however, I had to pay for my journey as I have a few years to go before I qualify for one of Winnie's cards.  This time I did take a couple of pictures of the vehicles we were picking up.\n\n<img src=\"https://brvannini.files.wordpress.com/2018/06/img_0053-2.jpg\" class=\"wp-image-13731 aligncenter size-large\" width=\"4032\" height=\"3024\"/>\n\n<img src=\"https://brvannini.files.wordpress.com/2018/06/img_0051-1.jpg\" class=\"wp-image-13732 aligncenter size-large\" width=\"4032\" height=\"3024\"/>\n\nI drove the one at the rear in the above photo.\n\nFirst we have to visit the petrol station just around the corner to put in enough diesel to get us back.  That done we all headed off.  We had discussed which exit would be the best to get off the motorway as this was Friday afternoon and it was also the start of the long weekend Queens Birthday weekend which meant that the traffic would be worse than usual, if that is all possible.  Once crawling along the motorway I got to the Redoubt Road edit at Manukau and could see the traffic was at a standstill ahead so I ducked off there.  Wending my way through the back roads (just as well I know my way around), avoiding schools as by this time it after 3pm and schools were finishing, however I got to Drury in good time.  Then I had to wait at least 30minutes for the others to start to arrive, each one had taken a different exit hence our staggered arrival times.\n\nThe weather has been brilliant this past week, well, brilliantly fine during the day but freezing cold overnight. There is a kiwi fruit orchard over the back of Ardmore and so for a few nights helicopters have been flying over the vines for frost protection. During cold and still conditions, the down draught from the helicopter causes the slightly warmer air layered above to circulate amongst the vines, reducing the likelyhood of frost damage. Effective but noisy.\n\nNow we have rain settled in for the day by the looks of it, oh well, at least it's warmer.","tags":["ardmore","auckland","family","friends","health"],"publishedDate":"2018-06-02T21:25:58Z","harvestDate":"2018-06-02T21:26:13Z","estimatedPublishedDate":"2018-06-02T21:25:58Z","url":"http://ct.moreover.com/?a=34207118380&p=1u0&v=1&x=sH2z2LFjrIPi7lS6DtWX8A","originalUrl":"https://brvannini.wordpress.com/2018/06/03/its-the-final-countdown/","outboundUrls":[],"wordCount":"656","dataFormat":"text","duplicateGroupId":"34207118380","media":{"audio":[],"images":[{"url":"https://brvannini.files.wordpress.com/2018/06/img_0053-2.jpg"},{"url":"https://brvannini.files.wordpress.com/2018/06/img_0051-1.jpg"}],"video":[],"logo":[]},"publishingPlatform":{"itemId":"13730"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"rkvannini","publishingPlatform":{"userId":"13457761"}},"licenses":[],"source":{"name":"The Vanninis'  Manoeuvres","homeUrl":"https://brvannini.wordpress.com","location":{},"feed":{"id":"162603220","name":"The Vanninis'  Manoeuvres","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"13065192","generator":"http://wordpress.com/","description":"Living full time in an RV with travels around New Zealand in our motorhome and the occasional overseas jaunt","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990590}