{"sequenceId":"845362203155","id":"34207111183","language":"English","title":"MAD travel fellowship concludes first international edition and opens call for 2018 program","content":"  publish your work MAD architects  (85 articles) MAD architects is a beijing-based studio headed by chinese architect ma yansong. the firm was founded in 2004 and has since opened an office in los angeles. MAD travel fellowship concludes first international edition and opens call for 2018 program Jun 02, 2018 MAD coverts its iconic pingtan museum into a lamp for artemide at milan design week Apr 24, 2018 ‘gu’ is ma yansong’s contemporary interpretation of the traditional wooden armchair Apr 18, 2018 AUDI's 'fifth ring' installation by MAD architects lights up milan design week Apr 18, 2018 new images of MAD-designed lucas museum unveiled as project breaks ground in LA Mar 15, 2018 popular now architecture! world's first 3D-printed concrete houses to be built in eindhoven, the netherlands 27k views olafur eliasson's first building is a curved brick, semi-submerged scheme in denmark 25k views kengo kuma + OODA to transform porto slaughterhouse into a new cultural complex 23k views mcleod bovell wraps west vancouver residence in wood to resemble a beach house 21k views taizhou contemporary art museum by atelier deshaus nears completion in china 28k views 0 0 0 0 since 2009, the ‘MAD travel fellowship’ has allowed students to explore the places and spaces that fascinate them, meet with architecture protagonists, and engage in new creative and cultural communities. ‘travel is for exchange – to understand different cultures, people and places,’ says MAD founder ma yansong, who personally selects the individual candidates. ‘it is important for students to see the world and experience the architecture they have been studying. my hope is that through these cultural exchanges, students will see new things, experience something emotional, and generate new ideas that will help kickstart their architecture careers.’   following the successful 2017 expansion of the fellowship to include international students, MAD architects is now officially launching its 2018 global program. with the application deadline soon approaching, (june 8, 2018), find out how to apply here, and learn more about the travels of the 2017 fellows below. roberto vargas calvo with ma yansong     roberto vargas calvo (costa rica), universidad veritas, san josé, undergraduate student research topic: analyzing the sounds and sensorial atmospheres of chinese cities destinations: beijing, shanghai testimony: the way we design is just as important as what we design. what we see, smell, hear, touch and taste in our everyday lives should be a starting point for every creative process. traveling has made me realize the importance of the sensorial experience as a turning point for design and critical thinking, and how to use this toolset to define a new role for the architect in the 21st century. issy yi     issy zhe yi, yale school of architecture, graduate student research topic: newness in architecture destination: japan testimony: maybe because of the limited allowance of space in japan, the sense of distance is insistently maintained, among buildings, people and simultaneously between buildings and people. infrastructure and architecture in symbiosis in such a brutal but articulated way can’t be found anywhere other than tokyo. every inch of land is measured and every sliver of space is layered with a kind of calculatedness, with the clarity of boundaries heightening the sense of distance and alienation. shaun mccallum     shaun mccallum (scotland), university of applied arts vienna, graduate student research topic: the consumerism of the architectural object destinations: beijing, guangzhou, tianducheng, xi’an testimony: from the CCTV headquarters in beijing to the great wall, china appears to be consumed by the symbolic qualities of architectural objects. the nature in which these two worlds collide – the remnants of historicism and the remnants of cities yet to be completed – is a testament to its fascination with the architectural object as it undergoes rapid development. hossein goudarzi     hossein goudarzi (iran), university of new mexico, graduate student research topic: analyzing and comparing the vernacular architecture of iran and china destinations: beijing and shanghai testimony: studying the traditional styles of classical chinese architecture and how they can be constructed with different elements, scales and shapes, I observed how we can take the vernacular, rewrite and redefine it as a valuable conceptual source to form new constructs of contemporary architecture. wu you     wu you, princeton university, graduate student research topic: the visual interpretation and translation of architecture destinations: portugal, spain testimony: spanish architecture is a site of cultural and tectonic knowledge borrowed from both christian high gothic and arabic styles. it stores immense knowledge of making, material and symbolism, layered with cultural references. visiting such historic works as the great mosque of cordoba, I noted the theme of confliction present in spanish architecture, which allowed me to see that architecture is just as much about establishing order as it is about dismantling it. wen zishen     wen zishen, tsinghua university, graduate student research topic: japanese architecture: a traditional and modern connection destination: japan testimony: japan is a cultural and artistic highland that embraces western narratives, while maintaining the philosophies of the east. through my travels I investigated how japanese architecture exists between modernity and tradition, finding interesting comparisons and correlations between the two. some of the impressive ones were the sima ryotaro memorial hall, sanjusangendo temple, kyoto national museum of art, and sumida hokusai museum. the faint parallels between these buildings led me to see another connection between tradition and modernity – one that goes beyond the pictograph. federico fauli with philip f. yuan, archi-union     federico fauli (italy), architectural association, graduate student research topic: the dichotomy of china’s two main rivers: the yellow river and yangtze river destinations: beijing, chengdu, guangzhou, guilin, hong kong, xi’an, zhangjiajie, zhengzhou testimony: my travels through china raised questions of culture and identity in an extremely rapidly developing country. driven by my interests in local aesthetics, the notion of collage architecture and monumentality, i was able to look in particular at cultural objects and artefacts in a way that attempts to define a multicultural and multiethnic architecture in china – one that is driven by memories and identities. li qiwei     li qiwei, beijing university of civil engineering and architecture, undergraduate student research topic: futurist architecture in the former soviet union destinations: armenia, georgia, russia testimony: though it had a short, and turbulent history, soviet architecture presented an ideological dream. travelling through the former soviet union, I observed the numerous artistic experiments that emerged during the rise of the stalin period, and witnessed architectural masterpieces and public buildings that express a sci-fi aesthetic – construction that looked to the future. kyriaki goti     kyrioki goti (greece), university of stuttgart, graduate student research topic: the relationship between nature and technology in architecture destinations: beijing, shanghai, suzhou testimony: each city I visited was diverse in terms of architecture, landscape, and lifestyle, but through their differences I saw a constant – the importance of nature in everyday chinese life. seeing the harmonic co-existence of nature and technology made me realize that by combining traditional materials and construction methods with cutting edge technology, architects can create new kinds of landscapes that do not compete with the natural ones, but complement them. wei tangchenxi with herman hertzberger     wei tangchenxi, southeast university china, graduate student research topic: hero, construction and magic realism destinations: france, spain, the netherlands testimony: during my visit to the netherlands, I experienced a dynamic energy and realized that space, not just limited to architecture, has the ability to make a city more dynamic and harmonious, and empower humans and the way they engage with their surroundings and one another. there were so many occasions where I saw people just enjoying the public spaces they were in, basking in the sun, lounging on the park grasses. they created a scene full of artistic vitality, and allowed me to reflect on the cozy lifestyle of the inhabitants of this wonderful country. philip stevens I designboom jun 02, 2018 0 0 0 0 have something to add? share your thoughts in our comments section below. name (required) e-mail (will not be published) (required) text comments policy LOG IN designboom's comment policy guidelines generally speaking, if we publish something, it's because we're genuinely interested in the subject. we hope you'll share this interest and if you know even more about it, please share! our goal in the discussion threads is to have good conversation and we prefer constructive opinions. we and our readers have fun with entertaining ones. designboom welcomes alerts about typos, incorrect names, and the like. the correction is at the discretion of the post editor and may not happen immediately. what if you disagree with what we or another commenter has to say? let's hear it! but please understand that offensive, inappropriate, or just plain annoying comments may be deleted or shortened. - please do not make racist, sexist, anti-semitic, homophobic or otherwise offensive comments. - please don't personally insult the writers or your fellow commenters. - please avoid using offensive words, replacing a few letters with asterisks is not a valid workaround. - please don't include your website or e-mail address in your comments for the purpose of self-promotion. - please respect jury verdicts and do not discuss offensively on the competition results (there is only one fist prize, and designboom usually asks renown professionals to help us to promote talent. in addition to the awarded designs, we do feel that almost all deserve our attention, that is why we publish the best 100-200 entries too.) a link is allowed in comments as long as they add value in the form of information, images, humor, etc. (links to the front page of your personal blog or website are not okay). unwelcome links (to commercial products or services of others, offensive material etc. ) will be redacted. and, ... yes, spam gets banned. no, we do not post fake comments. your e-mail your password forgot password sign in password recover please insert your email below to reset your lost password your new password has been sent to your email address thanks for registering please complete the form below. name surname e-mail gender M    F select a password (5 to 20 characters) retype password occupation street address zip code city country your signature it will appear at the bottom of the article max 14 characters newsletter subscription keep up to date with recent articles and upcoming events. to receive both newsletters please check 2 boxes. daily - see sample monthly - see sample MAD architects   (85 articles) apr 24, 2018 MAD converts its iconic pingtan museum into small-scale illuminated landscape for artemide apr 24, 2018 apr 18, 2018 ‘gu’ is ma yansong’s contemporary interpretation of the traditional wooden armchair apr 18, 2018 apr 18, 2018 AUDI's 'fifth ring' installation by MAD architects lights up milan design week apr 18, 2018 mar 15, 2018 new images of MAD-designed lucas museum unveiled as project breaks ground in LA mar 15, 2018 feb 01, 2018 celebrating 1.5 MILLION instagram followers with our next star architect #takedesignboomover feb 01, 2018 dec 27, 2017 #takedesignboomover! – architects guest curate designboom's instagram dec 27, 2017 PRODUCT LIBRARY a diverse digital database that acts as a valuable guide in gaining insight and information about a product directly from the manufacturer, and serves as a rich reference point in developing a project or scheme. architecture news jun 01, 2018 olafur eliasson's first building is a curved brick, semi-submerged scheme in denmark#architecture rounded negative volumes are carved from a facade of custom-glazed brick, creating an complex curved, circular, and elliptical forms, torquing walls and parabolic » rounded negative volumes are carved from a facade of custom-glazed brick, creating an complex curved, circular, and elliptical forms, torquing walls and parabolic arches. architecture in denmark (76 articles)olafur eliasson (46 articles) #architecture 1792 may 31, 2018 archi-union interview reveals details of chinese bamboo pavilion at venice biennale#architecture designboom caught up with archi-union founder philip f. yuan to discuss the firm's recent projects and the future of the chinese countryside. designboom caught up with archi-union founder philip f. yuan to discuss the firm's recent projects and the future of the chinese countryside. architecture in china (621 articles)venice architecture biennale 2018 (48 articles) #architecture 364 may 31, 2018 kengo kuma + OODA to transform porto slaughterhouse into a new cultural complex#architecture the project seeks to restore the historic complex, allowing it to establish itself as a vibrant part of the community. the project seeks to restore the historic complex, allowing it to establish itself as a vibrant part of the community. architecture in portugal (120 articles)kengo kuma (140 articles) #architecture 975 may 31, 2018 maritime history museum by kengo kuma references the architecture of saint-malo's port#architecture the future institution will highlight the french port city's prestigious maritime history throughout the ages. the future institution will highlight the french port city's prestigious maritime history throughout the ages. architecture in france (226 articles)kengo kuma (140 articles) #architecture 636 all architecture news","contentWithMarkup":"<img src='https://www.designboom.com/wp-content/uploads/2018/06/MAD-architects-travel-fellowship-international-edition-open-call-designboom-818.jpg' /><br/><p>since 2009, the initiative has allowed students to explore the places and spaces that fascinate them, meet with architecture protagonists, and engage in new creative and cultural communities. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.designboom.com/architecture/mad-travel-fellowship-international-edition-open-call-06-01-2018/\">MAD travel fellowship concludes first international edition and opens call for 2018 program</a> appeared first on <a rel=\"nofollow\" href=\"https://www.designboom.com\">designboom | architecture & design magazine</a>.</p>","tags":["architecture","MAD architects","mad-architects"],"publishedDate":"2018-06-02T20:14:51Z","harvestDate":"2018-06-02T21:24:28Z","estimatedPublishedDate":"2018-06-02T20:14:51Z","url":"http://ct.moreover.com/?a=34207111183&p=1u0&v=1&x=9feOWnModI808Dpzdi0Bvw","originalUrl":"https://www.designboom.com/architecture/mad-travel-fellowship-international-edition-open-call-06-01-2018/","commentsUrl":"https://www.designboom.com/architecture/mad-travel-fellowship-international-edition-open-call-06-01-2018/#respond","outboundUrls":["http://www.i-mad.com/","http://www.i-mad.com/fellowship/","https://instagram.com/designboom/","https://www.facebook.com/designboomnews","https://twitter.com/designboom","https://plus.google.com/+designboom/posts","https://pinterest.com/designboom/"],"wordCount":"2033","dataFormat":"text","duplicateGroupId":"34206833325","media":{"audio":[],"images":[{"url":"https://www.designboom.com/wp-content/uploads/2018/06/MAD-architects-travel-fellowship-international-edition-open-call-designboom-818.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"Audi AG","symbol":"NSU","exchange":"STU","isin":"DE0006757008","titleCount":0,"contentCount":2,"primary":true},{"name":"Audi AG","symbol":"NSU","exchange":"FRA","isin":"DE0006757008","titleCount":0,"contentCount":2,"primary":true},{"name":"Audi AG","symbol":"NSU","exchange":"MUN","isin":"DE0006757008","titleCount":0,"contentCount":2,"primary":true},{"name":"Audi AG","symbol":"NSU","exchange":"DUS","isin":"DE0006757008","titleCount":0,"contentCount":2,"primary":true},{"name":"Audi AG","symbol":"NSU","exchange":"BER","isin":"DE0006757008","titleCount":0,"contentCount":2,"primary":true},{"name":"Audi AG","symbol":"NSU","exchange":"HAM","isin":"DE0006757008","titleCount":0,"contentCount":2,"primary":true},{"name":"Audi AG","symbol":"NSU","exchange":"ETR","isin":"DE0006757008","titleCount":0,"contentCount":2,"primary":true},{"name":"Audi AG","symbol":"AUDVF","exchange":"PINX","isin":"DE0006757008","titleCount":0,"contentCount":2,"primary":true},{"name":"Zip Co Ltd","symbol":"Z1P","exchange":"ASX","isin":"AU000000Z1P6","titleCount":0,"contentCount":1,"primary":false},{"name":"Zip Co Ltd","symbol":"YRR","exchange":"FRA","isin":"AU000000Z1P6","titleCount":0,"contentCount":1,"primary":false}],"author":{"name":"philip stevens I designboom","publishingPlatform":{}},"licenses":[],"source":{"name":"designboom | architecture & design magazine","homeUrl":"https://www.designboom.com","location":{"country":"Singapore","countryCode":"SG","region":"Asia","subregion":"South-Eastern Asia"},"feed":{"id":"107561110","name":"designboom | architecture & design magazine","mediaType":"Blog","publishingPlatform":"WordPress","generator":"https://wordpress.org/?v=4.9.6","description":"designboom magazine | your first source for architecture, design & art news","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"3","autoRankOrder":"9621","inboundLinkCount":"93"},"inWhiteList":"true","autoTopics":["ugc financial feeds"]}},"es_id":86990358}