{"sequenceId":"845361981894","id":"34207103964","language":"English","title":"Authentic Vintage Christmas Tree Lights","content":"Vintage Christmas Tree If you want to celebrate your Christmas holiday with an authentic vintage Christmas tree, then you need to find authentic vintage Christmas tree lights to light up your tree. Vintage Christmas lights were made differently both in shape, and style, than the strings of lights that are manufactured today, and to truly have an authentic looking vintage style Christmas tree, you should collect vintage Christmas lights as well as vintage and antique Christmas ornaments. Vintage Christmas Tree Bubble Lights Celebrations Lighting G11GR2A1 Set of 7 Multi-color Christmas Bubble Lights These bubble lights are so much fun to watch on a tree. Kids love them. As candle lights warm up, liquid starts bubbling Approx. 7' long strand with Bulb Spacing 12\" apart. Straight line set-additional sets can be strung together End-to-end connectors allow you to connect multiple sets together Multi-colored bubbling action, UL listed for indoor use only 8 vintage ST NICK Holly Christmas BUBBLE LIGHTS in ORIGINAL BOX all working $48.50 Time Remaining: 3d 5h 42m Buy It Now for only: $148.50 Buy It Now Vintage Set of 10 Tiny or Mini Bubble Christmas Tree Lights $25.00 Time Remaining: 6d 1h 32m Buy It Now for only: $25.00 Buy It Now Vintage Christmas Tree Bubble Bubbling Lights 2 sets w boxes Beacon $25.00 Time Remaining: 28d 23h 7m Buy It Now for only: $25.00 Buy It Now Vintage Look Christmas Bubble Night Light Nightlight NEW Red Green lights $6.47 Time Remaining: 13d 23h 36m Buy It Now for only: $6.47 Buy It Now Holiday WonderlandNoma Bubble Lite SetCelebrations LedNovelty Lights, Inc.Brightech™ - AmbienceChristmas Lights SetSolar Outdoor String LightsKiven ST64 Vintage EdisonGood Tidings Holiday LightsSet of 10 LED Flameless TapersSpring Rose 25 Clear GlobeConnectable Heavy Duty25 Lite Vintage LookRetro Classic Series C7Solar Powered String Lights Vintage Christmas Tree Reflectors Vintage Christmas Light Reflectors Metal FLowers 18 total $17.00 Time Remaining: 25d 2h 40m Buy It Now for only: $17.00 Buy It Now 25 Vintage Petal Christmas Reflector Light Replacements Multi Color $3.95 Time Remaining: 9d 6h 30m Buy It Now for only: $3.95 Buy It Now jd Vintage Diamond Ray Jeweled Christmas Light Reflectors 8pc set in Box $12.95 Time Remaining: 13d 6h 1m Buy It Now for only: $12.95 Buy It Now 16 Vintage Aluminum Foil Silver Star Starburst Christmas Light Reflectors $11.99 Time Remaining: 16d 6h 10m Buy It Now for only: $11.99 Buy It Now Vintage Christmas Light Reflectors One item that would help create a vintage looking Christmas tree is a collection of vintage Christmas tree aluminum light reflectors. These reflectors come in varying shapes, colors, and sizes, and are designed to reflect back the individual Christmas lights to increase the light, and sparkle on the Christmas tree. I found a lot of these reflectors on Ebay, of which I listed some on this page. This would be a very fun addition to the glitter of a vintage Christmas tree. Vintage Christmas Lights Strings 6 Vintage Christmas Light Strings with 25 C9 Lights Each and 25 Feet Long Each $20.00 Time Remaining: 19d 22h 34m Buy It Now for only: $20.00 Buy It Now Three Vintage NOMA Christmas Tree Lights 3 C7 Strings 7 Bulbs stringBakelite $15.00 Time Remaining: 29d 13h 42m Buy It Now for only: $15.00 Buy It Now 2 Vintage strings Old Fashioned Christmas Lights 160 inches each 50 multi color $5.95 Time Remaining: 20d 19h 47m Buy It Now for only: $5.95 Buy It Now Vintage Christmas Tree Lights String Red Green Metal Clips C7 $9.00 Time Remaining: 29d 20h 1m Buy It Now for only: $9.00 Buy It Now Vintage Angel Christmas Lights Vintage Davinci miniature angel Christmas lights string end to end MADE IN ITALY $24.95 Time Remaining: 6d 23h 2m Buy It Now for only: $24.95 Buy It Now Vintage SILVESTRI ANGEL FIGURINE LIGHTS 10 LIGHT STRAND Indoor CHRISTMAS in BOX $17.99 Time Remaining: 25d 22h 44m Buy It Now for only: $17.99 Buy It Now Vintage Christmas Angel Tree topper Centerpiece Working white lights $8.99 Time Remaining: 23h 20m Buy It Now for only: $15.00 Buy It Now Vintage Christmas Angel Lights Up Union Products 18 Inches Tall $39.00 Time Remaining: 10d 16h 18m Buy It Now for only: $39.00 Buy It Now Vintage Christmas Lights Sizes Just like today, vintage Christmas lights came in varying sizes and shapes. Some manufacturers had their own designations or you can search via bulb size. Ebay sellers often list the size of the bulbs, along with the bulb string length for comparison to what you already have. If you are going to want the vintage Christmas lights to actually light up, make sure you look on the listing for the fact that the vintage lights actually work. Some people might be interested in the vintage lights for recycling into new art forms, or Christmas crafts. If you are not sure, you can contact the seller on Ebay and ask them whatever questions you have. Vickerman 7 Light Clear Glitter Bubble Set with Green Wire 20-Inch Vintage Christmas Candle Lights Vintage CHRISTMAS Tree Candle Light Set CLIP ON TREE LIGHTS 2 Sets of 10 in Box $21.99 Time Remaining: 10d 2h 28m Buy It Now for only: $21.99 Buy It Now Vintage Christmas String Lights Clip on Candle Lights Tree Decorations 20 Lights $20.00 Time Remaining: 29d 6h 25m Buy It Now for only: $20.00 Buy It Now Vintage Christmas String Clip on Candle Lights Tree Decorations 10 Lights Strand $6.00 Time Remaining: 15d 5h 33m Buy It Now for only: $6.00 Buy It Now VINTAGE Christmas Tree Lights Glass Candle Lights OSRAM 16pc From Germany AS IS $39.99 Time Remaining: 7d 2h Buy It Now for only: $39.99 Buy It Now Vintage and Antique Christmas Lanterns There are some very beautiful single vintage and antique Christmas light that are meant for a lamp or a stand alone lantern. Some are actually lanterns in themselves. These single bulbs are often handmade and hand painted, real collector's items. Others house a light bulb, so that they are more like a lamp shade, than a lamp themselves. These are usually under $10.00, and can add a lot of vintage atmosphere to your Christmas theme. Vintage Christmas Lights Replacement Bulbs VINTAGE GE C 9 SWIRL CHRISTMAS LIGHT BULBS pack of 5 $13.67 Time Remaining: 4d 18h 41m Buy It Now for only: $13.67 Buy It Now 6 Vintage Christmas Light Strings with 25 C9 Lights Each and 25 Feet Long Each $20.00 Time Remaining: 19d 22h 34m Buy It Now for only: $20.00 Buy It Now Vintage Christmas Lights C9 String 15 Bulbs USA Tested Old Rare $14.95 Time Remaining: 6d 23h 48m Buy It Now for only: $14.95 Buy It Now 4 SETS VINTAGE WORKING 1955 FESTIVE LITES CHRISTMAS LIGHTS C 9 INDOOR OUTDOOR $39.99 Time Remaining: 24d 22h 39m Buy It Now for only: $39.99 Buy It Now Vintage Santa Claus Christmas Lights One of my personal favorite vintage Christmas light types are the Santa Claus shaped light bulbs and strings of light bulbs. Vintage Christmas lights are also available in other Christmas character shapes. I just love the look of the little Santa Claus heads, floating in the branches of the Christmas tree, amid the vintage ornaments. These light bulbs are usually made of glass or plastic, which are often hand painted, on milk glass or opaque glass, although you can also find them in plastic. You can also find vintage Santa Claus head covers to fit over modern light bulb strings. These add a lot of fun ambiance to your vintage Christmas tree. And they are also reasonable in price from about $10.00 to $20.00. Image Image Article publié pour la première fois le 06/09/2013 (Visited 1,566 times, 1 visits today)","contentWithMarkup":"<p>Vintage Christmas Tree If you want to celebrate your Christmas holiday with an authentic vintage Christmas tree, then you need to find authentic vintage Christmas tree lights to light up your tree. Vintage Christmas lights were made differently both in shape, and style, than the strings of lights that are manufactured today, and to truly […]</p>\n<p>The post <a rel=\"nofollow\" href=\"http://antiquevintagegallery.com/vintage-home-decor/vintage-holiday/vintage-christmas/authentic-vintage-christmas-tree-lights/\">Authentic Vintage Christmas Tree Lights</a> appeared first on <a rel=\"nofollow\" href=\"http://antiquevintagegallery.com\">Antique Vintage Gallery</a>.</p>","tags":["Vintage Christmas","authentic vintage christmas lights","christmas","christmas lights","vintage christmas","vintage christmas light bulbs","vintage christmas lights","xmas","xmas lights"],"publishedDate":"2018-06-03T00:47:02Z","harvestDate":"2018-06-02T21:22:32Z","estimatedPublishedDate":"2018-06-02T21:22:32Z","url":"http://ct.moreover.com/?a=34207103964&p=1u0&v=1&x=Jk7gogG_sUnjn0pERf0jSw","originalUrl":"http://antiquevintagegallery.com/vintage-home-decor/vintage-holiday/vintage-christmas/authentic-vintage-christmas-tree-lights/","commentsUrl":"http://antiquevintagegallery.com/vintage-home-decor/vintage-holiday/vintage-christmas/authentic-vintage-christmas-tree-lights/#respond","outboundUrls":["http://www.hupso.com/share/","http://www.amazon.com/Celebrations-Lighting-G11GR2A1-Multi-color-Christmas/dp/B000UIBR86?tag=antiquevintagegallery-20","http://www.amazon.com/Wonderland-2924-88-Christmas-Multi-Color-25-Count/dp/B000VBC0YM?tag=antiquevintagegallery-20","http://www.amazon.com/Noma-Vintage-Special-Christmas-Nostalgia/dp/B004EF5RHI?tag=antiquevintagegallery-20","http://www.amazon.com/Celebrations-Ceramic-Light-Multi-Colored-Lights/dp/B0043RH5XG?tag=antiquevintagegallery-20","http://www.amazon.com/Novelty-Lights-C9-7C-ASST-Christmas-Replacement/dp/B004Q6JFBY?tag=antiquevintagegallery-20","http://www.amazon.com/Brightech-trade-Ambience-Outdoor-Commercial/dp/B00JK4Z2M8?tag=antiquevintagegallery-20","http://www.amazon.com/Christmas-Lights-Multi-Color-Ceramic-25-Count/dp/B0009IOQQC?tag=antiquevintagegallery-20","http://www.amazon.com/Outdoor-String-Lights-Crystal-Christmas/dp/B0158GHSH8?tag=antiquevintagegallery-20","http://www.amazon.com/Kiven-Beautiful-Romantic-Decorative-Christmas/dp/B00LHPPQO2?tag=antiquevintagegallery-20","http://www.amazon.com/Good-Tidings-Holiday-25-Lights-Multi-Colored/dp/B00466IGCS?tag=antiquevintagegallery-20","http://www.amazon.com/Flameless-Removable-Suitable-Decoration-Christmas/dp/B00P68DUGW?tag=antiquevintagegallery-20","http://www.amazon.com/Spring-Rose-Clear-String-Lights/dp/B00H90KXW4?tag=antiquevintagegallery-20","http://www.amazon.com/Connectable-24-Socket-Vintage-Festoon-Strand/dp/B00ZIXU0XQ?tag=antiquevintagegallery-20","http://www.amazon.com/Vintage-Multi-Color-Light-Strand/dp/B00Y0Y6DN0?tag=antiquevintagegallery-20","http://www.amazon.com/Classic-Battery-Operated-Function-Outdoor/dp/B00P9VG8V0?tag=antiquevintagegallery-20","http://www.amazon.com/Powered-String-Blossom-lighting-Christmas/dp/B0158G91FK?tag=antiquevintagegallery-20","http://www.amazon.com/Vickerman-Glitter-20-Inch-Spacing-Connector/dp/B002TSFOOI?tag=antiquevintagegallery-20","https://www.flickr.com/photos/30673837@N02/5232073280","https://www.flickr.com/photos/marbles333/3157115158","http://www.linkwithin.com/"],"wordCount":"1202","dataFormat":"text","duplicateGroupId":"34207103964","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"Multi-Color Corp","symbol":"LABL","exchange":"NAS","isin":"US6253831043","titleCount":0,"contentCount":3,"primary":true},{"name":"Multi-Color Corp","symbol":"MUO","exchange":"FRA","isin":"US6253831043","titleCount":0,"contentCount":3,"primary":true},{"name":"New Art Co Ltd","symbol":"7638","exchange":"TKS","isin":"JP3347150009","titleCount":0,"contentCount":1,"primary":false}],"author":{"name":"lakeerieartists","publishingPlatform":{}},"licenses":[],"source":{"name":"Antique Vintage Gallery","homeUrl":"http://antiquevintagegallery.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"185166853","name":"Antique Vintage Gallery","mediaType":"Blog","publishingPlatform":"WordPress","generator":"http://wordpress.org/?v=4.2.2","description":"Unique Vintage Collectibles","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990051}