{"sequenceId":"845366617667","id":"34207246523","language":"English","title":"Chimamanda Ngozi Adichie speaks.","content":"Dear Unnamed Person Who I Am Told Is On Social Media Saying I am Her Family and Telling Me to Shut Up:  Cynicism is ugly. It doesn’t flatter anyone. Yours doesn’t suit you at all.  I remember you vaguely; I think you were in my class in primary school. And now you claim to be my ‘family’ and you are asking me to shut up.  Did you watch the video of the conversation? Did you read a full transcript?  I am tired of Nigerians who read a headline and, without bothering to get details and context, jump on the outrage bandwagon and form lazy, shallow opinions.  I am tired of Nigerians cynically thinking of anybody in public life as a ‘brand.’ No, I am not a brand. I am a person who feels strongly about certain issues. I choose to talk honestly about them. I made the choice to talk about feminism knowing very well the kind of hostility it brings – but I think it’s important and I will continue to speak my truth and hope to bring about some change, no matter how small. Adirom agba egwu ka m data ego.  No, of course you don’t actually deserve a response, but I have some free time today. So I want to make you feel a little important because it sounds like you need it.  And I want to reflect on an absolutely lovely hour spent on stage with Hillary Clinton.  I was happy when I was told that Hillary Clinton had specifically requested to be in conversation with me at the PEN World Voices festival. I am an unapologetic fan of Ms. Clinton’s. I have been for many years.  I felt quite emotional when I met her. Having read and followed her for years, it was moving to see her: the warm, human, observant, present, thoughtful person (and looking wonderful, with her hair and makeup on point!).  She said she had read my books and I restrained myself from doing cartwheels.  “Is there anything you don’t want to talk about?” I asked backstage.  “Ask me anything,” she said.  Towards the end of our conversation, I told her how, having read her writing about her own life, I think she has a great love story with Bill Clinton. A wonderful friendship. I said I feel irritated and protective of her when people dissect her personal life, but I also confessed to having an interest myself, particularly about her public Twitter profile. (I first noticed it when I was researching a piece about her during the presidential campaign). I was upset that the first word used to describe her was ‘wife.’ Was it a choice she had made or was it something done for her campaign and, if it was a choice she had made, did she think my reaction to it was fair?  Her response was very thoughtful.  I was too excited, emotional, slightly nervous, to be on stage with this remarkable woman. Had I kept in mind how easily outrage-mongers would jump on a headline, I would have phrased my question better. I would not have made it about my being upset, because it can come across as navel-gazing.  But the truth is that we were supposed to be having a ‘conversation,’ the context of our conversation was personal and warm, I had made the decision to speak from the heart, and it would be dishonest to pretend that I had not reacted personally to so many issues around Ms. Clinton, whose life has become a kind of crucible of all the questions that affect women.  We all react personally to public figures. And I WAS upset that the Twitter bio of a woman who is the most accomplished person to run for President of the United States, would begin with ‘wife.’ And considering her personal history, it just didn’t seem to fit.  I felt that ‘wife’ was used as an attempt to placate all the men and women who will not vote for a woman unless they are able to see her FIRST in domestic terms.  Yes, it’s just Twitter. But it matters. It’s a public platform. It’s where people go to hear directly from her.  And there is context to consider.  In LIVING HISTORY, Ms.Clinton writes that the two most difficult decisions she has made in her life were staying married to Bill Clinton and running for the senate seat in New York.  Women, especially women in public life, face a lot of societal pressure about how to be, how to live, much more than men do. Women in public life are considered ‘cold’ and ‘un-relatable’ unless they define themselves in domestic terms. Women’s accomplishments are often considered incomplete unless they have also ticked the ‘marriage’ box. These things are not true of men, even though marriage can be a wonderful thing for both men and women.  Feminism is indeed about choice. But it is intellectually lazy to suggest that, since everything is about ‘choice,’ none of these choices can be interrogated. Choices are never made in a vacuum. And sometimes, for women, choices are not always real choices.  After she got married, Ms. Clinton kept her name, but she was so viciously criticized for this that she then took on her husband’s name. Was this a ‘choice?’ Would she have done so if she wasn’t being attacked and if she didn’t want to feel responsible for her husband’s potential losing of votes?  During the last presidential campaign, she was expected to account for the policies of her husband’s administration. She was labeled an enabler of sexual harassment. She was accused of cynically staying married because she wanted to benefit politically.  Much of Ms. Clinton’s public image is a caricature of a person who is untrustworthy, calculated, cold, dishonest. That caricature has its roots in her early public life when she was the First Lady of Arkansas.  Her crime was that she did not conform to the traditional role of First Lady. She had kept her name. She clearly considered herself to be her husband’s equal partner. She did not intend merely to be a Wife. She had her own dreams, her own ambition. She dared to say that she wasn’t planning on ‘staying home and baking cookies,’ which was not about denigrating stay-at-home mothers but simply about saying that that was not what she wanted to do.  A small comment about a small thing, but it was significant and revolutionary because she was consciously resisting the status quo.  But she was attacked for that. Horrendously. And those attacks were repeated so often that they stuck and they contributed to her being reduced to a caricature.  It was therefore upsetting to see her first descriptor as ‘wife.’ The question isn’t about including ‘wife’ in her Twitter bio. The question is about giving ‘wife’ a certain primacy as the first word that describes her, and it speaks to larger questions about the societal expectations placed on women.  Ms. Clinton wrote in her most recent book WHAT HAPPENED, that she ran for president because she thinks she would have been a ‘damned good president.’  She certainly would have been. And so I suggested, half-joking, that ‘Would have been a damned good president’ is a perfect Twitter bio start. And then mother and wife and grandma and Senator and hair icon etc could follow!  I completely stand by my question and by my conviction that it is a subject that matters.  I had a truly enlightening evening on that stage with Ms. Clinton, and was once again awed by her grit, her humanity, her sparkling intelligence.  After the conversation, Ms. Clinton told me, “It was like talking to a friend.” She is now my Aunty For Life.  Oh, as for YOU, Unnamed Person, saying that I am ‘family’ to you, mbakwa biko. The people I consider family don’t ‘do petty.’  Saying “shut up” to a woman who airs an opinion is so unoriginal. Try and be a bit more inventive.  Try reasoning. Try intelligent debate. Try understanding things in context before you reveal your ignorant misogyny to the world. Try reading more than a headline. Try reading a whole book. Or two. And please keep talking. Keep speaking. Don’t ever shut up.  ~CNA","contentWithMarkup":"Dear Unnamed Person Who I Am Told Is On Social Media Saying I am Her Family and Telling Me to Shut Up:\n\nCynicism is ugly. It doesn’t flatter anyone. Yours doesn’t suit you at all.\n\nI remember you vaguely; I think you were in my class in primary school. And now you claim to be my ‘family’ and you are asking me to shut up.\n\nDid you watch the video of the conversation? Did you read a full transcript?\n\nI am tired of Nigerians who read a headline and, without bothering to get details and context, jump on the outrage bandwagon and form lazy, shallow opinions.\n\nI am tired of Nigerians cynically thinking of anybody in public life as a ‘brand.’ No, I am not a brand. I am a person who feels strongly about certain issues. I choose to talk honestly about them. I made the choice to talk about feminism knowing very well the kind of hostility it brings – but I think it’s important and I will continue to speak my truth and hope to bring about some change, no matter how small. Adirom agba egwu ka m data ego.<img class=\"alignnone size-full wp-image-6352\" src=\"https://olivernwokedi.files.wordpress.com/2018/06/chimamanda.jpg\" alt=\"chimamanda\" width=\"768\" height=\"512\" />\n\nNo, of course you don’t actually deserve a response, but I have some free time today. So I want to make you feel a little important because it sounds like you need it.\n\nAnd I want to reflect on an absolutely lovely hour spent on stage with Hillary Clinton.\n\nI was happy when I was told that Hillary Clinton had specifically requested to be in conversation with me at the PEN World Voices festival. I am an unapologetic fan of Ms. Clinton’s. I have been for many years.\n\nI felt quite emotional when I met her. Having read and followed her for years, it was moving to see her: the warm, human, observant, present, thoughtful person (and looking wonderful, with her hair and makeup on point!).\n\nShe said she had read my books and I restrained myself from doing cartwheels.\n\n“Is there anything you don’t want to talk about?” I asked backstage.\n\n“Ask me anything,” she said.<img class=\"alignnone size-full wp-image-6353\" src=\"https://olivernwokedi.files.wordpress.com/2018/06/1507148911_482431_1507149052_noticia_normal.jpg\" alt=\"1507148911_482431_1507149052_noticia_normal\" width=\"980\" height=\"561\" />\n\nTowards the end of our conversation, I told her how, having read her writing about her own life, I think she has a great love story with Bill Clinton. A wonderful friendship. I said I feel irritated and protective of her when people dissect her personal life, but I also confessed to having an interest myself, particularly about her public Twitter profile. (I first noticed it when I was researching a piece about her during the presidential campaign). I was upset that the first word used to describe her was ‘wife.’ Was it a choice she had made or was it something done for her campaign and, if it was a choice she had made, did she think my reaction to it was fair?\n\nHer response was very thoughtful.\n\nI was too excited, emotional, slightly nervous, to be on stage with this remarkable woman. Had I kept in mind how easily outrage-mongers would jump on a headline, I would have phrased my question better. I would not have made it about my being upset, because it can come across as navel-gazing.<img class=\"alignnone size-full wp-image-6354\" src=\"https://olivernwokedi.files.wordpress.com/2018/06/images-12.jpg\" alt=\"images (12)\" width=\"220\" height=\"229\" />\n\nBut the truth is that we were supposed to be having a ‘conversation,’ the context of our conversation was personal and warm, I had made the decision to speak from the heart, and it would be dishonest to pretend that I had not reacted personally to so many issues around Ms. Clinton, whose life has become a kind of crucible of all the questions that affect women.\n\nWe all react personally to public figures. And I WAS upset that the Twitter bio of a woman who is the most accomplished person to run for President of the United States, would begin with ‘wife.’ And considering her personal history, it just didn’t seem to fit.\n\nI felt that ‘wife’ was used as an attempt to placate all the men and women who will not vote for a woman unless they are able to see her FIRST in domestic terms.\n\nYes, it’s just Twitter. But it matters. It’s a public platform. It’s where people go to hear directly from her.\n\nAnd there is context to consider.\n\nIn LIVING HISTORY, Ms.Clinton writes that the two most difficult decisions she has made in her life were staying married to Bill Clinton and running for the senate seat in New York.\n\nWomen, especially women in public life, face a lot of societal pressure about how to be, how to live, much more than men do. Women in public life are considered ‘cold’ and ‘un-relatable’ unless they define themselves in domestic terms. Women’s accomplishments are often considered incomplete unless they have also ticked the ‘marriage’ box. These things are not true of men, even though marriage can be a wonderful thing for both men and women.<img class=\"alignnone size-full wp-image-6355\" src=\"https://olivernwokedi.files.wordpress.com/2018/06/images-14.jpg\" alt=\"images (14)\" width=\"231\" height=\"218\" />\n\nFeminism is indeed about choice. But it is intellectually lazy to suggest that, since everything is about ‘choice,’ none of these choices can be interrogated. Choices are never made in a vacuum. And sometimes, for women, choices are not always real choices.\n\nAfter she got married, Ms. Clinton kept her name, but she was so viciously criticized for this that she then took on her husband’s name. Was this a ‘choice?’ Would she have done so if she wasn’t being attacked and if she didn’t want to feel responsible for her husband’s potential losing of votes?\n\nDuring the last presidential campaign, she was expected to account for the policies of her husband’s administration. She was labeled an enabler of sexual harassment. She was accused of cynically staying married because she wanted to benefit politically.\n\nMuch of Ms. Clinton’s public image is a caricature of a person who is untrustworthy, calculated, cold, dishonest. That caricature has its roots in her early public life when she was the First Lady of Arkansas.<img class=\"alignnone size-full wp-image-6356\" src=\"https://olivernwokedi.files.wordpress.com/2018/06/rtr3s8md-e1480099993123.jpg\" alt=\"rtr3s8md-e1480099993123\" width=\"3473\" height=\"1960\" />\n\nHer crime was that she did not conform to the traditional role of First Lady. She had kept her name. She clearly considered herself to be her husband’s equal partner. She did not intend merely to be a Wife. She had her own dreams, her own ambition. She dared to say that she wasn’t planning on ‘staying home and baking cookies,’ which was not about denigrating stay-at-home mothers but simply about saying that that was not what she wanted to do.\n\nA small comment about a small thing, but it was significant and revolutionary because she was consciously resisting the status quo.\n\nBut she was attacked for that. Horrendously. And those attacks were repeated so often that they stuck and they contributed to her being reduced to a caricature.\n\nIt was therefore upsetting to see her first descriptor as ‘wife.’ The question isn’t about including ‘wife’ in her Twitter bio. The question is about giving ‘wife’ a certain primacy as the first word that describes her, and it speaks to larger questions about the societal expectations placed on women.<img class=\"alignnone size-full wp-image-6357\" src=\"https://olivernwokedi.files.wordpress.com/2018/06/images-13.jpg\" alt=\"images (13)\" width=\"275\" height=\"183\" />\n\nMs. Clinton wrote in her most recent book WHAT HAPPENED, that she ran for president because she thinks she would have been a ‘damned good president.’\n\nShe certainly would have been. And so I suggested, half-joking, that ‘Would have been a damned good president’ is a perfect Twitter bio start. And then mother and wife and grandma and Senator and hair icon etc could follow!\n\nI completely stand by my question and by my conviction that it is a subject that matters.\n\nI had a truly enlightening evening on that stage with Ms. Clinton, and was once again awed by her grit, her humanity, her sparkling intelligence.\n\nAfter the conversation, Ms. Clinton told me, “It was like talking to a friend.” She is now my Aunty For Life.<img class=\"alignnone size-full wp-image-6356\" src=\"https://olivernwokedi.files.wordpress.com/2018/06/rtr3s8md-e1480099993123.jpg\" alt=\"rtr3s8md-e1480099993123\" width=\"3473\" height=\"1960\" />\n\nOh, as for YOU, Unnamed Person, saying that I am ‘family’ to you, mbakwa biko. The people I consider family don’t ‘do petty.’\n\nSaying “shut up” to a woman who airs an opinion is so unoriginal. Try and be a bit more inventive.\n\nTry reasoning. Try intelligent debate. Try understanding things in context before you reveal your ignorant misogyny to the world. Try reading more than a headline. Try reading a whole book. Or two. And please keep talking. Keep speaking. Don’t ever shut up.\n\n~CNA","tags":["AFRICAN AMERICAN","African History","African News","Akan","Allgemein","Awailness","Awards","Biafran History","Biafran News","Biafran Time","Buhari","Chidimma","Chiukwunaebunwa Agbogho Okebram","Developments","Free Biafran World News","Goodgle","Goodluck","iiiiii","Integration Oldenburg","Kanu"],"publishedDate":"2018-06-02T21:57:18Z","harvestDate":"2018-06-02T21:57:30Z","estimatedPublishedDate":"2018-06-02T21:57:18Z","url":"http://ct.moreover.com/?a=34207246523&p=1u0&v=1&x=F8ALQGK6ENN_yzA8Br94qw","originalUrl":"https://olivernwokedi.wordpress.com/2018/06/02/chimamanda-ngozi-adichie-speaks/","outboundUrls":[],"wordCount":"1373","dataFormat":"text","duplicateGroupId":"34207246523","media":{"audio":[],"images":[{"url":"https://olivernwokedi.files.wordpress.com/2018/06/rtr3s8md-e1480099993123.jpg"},{"url":"https://olivernwokedi.files.wordpress.com/2018/06/1507148911_482431_1507149052_noticia_normal.jpg"},{"url":"https://olivernwokedi.files.wordpress.com/2018/06/images-14.jpg"},{"url":"https://olivernwokedi.files.wordpress.com/2018/06/images-13.jpg"},{"url":"https://olivernwokedi.files.wordpress.com/2018/06/chimamanda.jpg"},{"url":"https://olivernwokedi.files.wordpress.com/2018/06/images-12.jpg"}],"video":[],"logo":[]},"publishingPlatform":{"itemId":"6351"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Restore Igbo Culture and Tradition","publishingPlatform":{"userId":"79730794"}},"licenses":[],"source":{"name":"Igbo Culture and Tradition","homeUrl":"https://olivernwokedi.wordpress.com","location":{},"feed":{"id":"516140401","name":"Igbo Culture and Tradition","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"83809695","generator":"http://wordpress.com/","description":"Igbo Culture Tradition and History of Africa,","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"9","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994513}