{"sequenceId":"845367467988","id":"34207268599","language":"English","title":"Tarot: Truth or Lies?","content":"Three days ago, a nestling blue jay fell to the ground just behind my home, cracking its head. Blue jays represent communication and pride. Jays are highly competitive, aggressive birds. They make a ruckus wherever they nest. Blue jays also predate on smaller songbirds, killing and eating them. They eat the eggs of other birds, as well. They can be seen to signify the plunderer that flies brilliant colors but lives on the destruction of others. Of course, in a balanced ecosystem, everything has its place. However urban settings provide rather hostile circumstances for the song birds, where hunters and scavengers like jays and crows thrive. Robins, canaries, finches, and chickadees become rarer sights every year for city and suburban dwellers. So, too, does the urban environment cultivate cold detachment and calculation over compassion, in the people who live there. A dead bird symbolizes a death, and as with many death omens, often heralds a symbolic death more than a literal one. A death on one level means a rebirth on another, as matter transcends into spirit to assume another form. The death of a blue jay can be read as a death of predatory modes of communication, the word that seeks to destroy someone else, suppress their ideas, and undermine that person’s individual identity. This sunrise as I roused to consciousness, this question appeared in my head: Can a tool designed by liars ever tell the truth? In college, I took an Epistemology class. Epistemology explores how we know what we know. I would have followed with Ontology (studying what it is we know) but that I only had room for one in my schedule and Epistemology fit. Studying epistemology brought me to a realization that crushed the objective evaluation of some external reality. All we can ever rely on is what we can observe with our physical and metaphysical senses. When we rely on Tarot for a divinatory message, the Tarot acts as a filter on that message. It can offer a counterpoint to our own personal narrative and challenge us, but most times I find the Tarot just gets used by the reader to confirm their own bias. I have been guilty of doing the same. That’s why I’ve taken a step back. I choose to read the cards almost literally because of this, refraining from narrating around what I think I see and sticking to the facts. But the question remains: can a tool created by liars ever reveal the truth? Crowley conceptualized the Thoth deck, designed by Frieda Harris. A.E. Waite conceptualized his own deck, designed by Pamela Coleman Smith. The lie of both is that each deck gets attributed more heavily to its author rather than its artist, when the artists brought the deck into physical being and visualized the pictures as they would appear on the cards. The lies of Waite consist of intentionally masking the meanings of signs and symbols present in the deck he conceptualized, and his belief that only the formally initiated were worthy of the knowledge. The lies of Crowley consist in his faith that all humans left to their own devices will balance their Will with Love (this is naivety, since we all know that psychopaths do exist, in however small numbers), and his belief that all people can be trusted with limitless power. The truth lies somewhere in between. Chaos and order must interplay, but not intermix overmuch, or else everything loses shape. Self selection must pair with the wisdom of guidance. Self determination must be tempered with Divine authority and healthy awareness of boundaries. I think the truth emerges in spite of lies. A liar fabricates a lie to conceal truth, therefore all lies can ever offer is a concealment of the truth. They do not negate the truth, or distort the reality of the truth, just the appearance of it. If the reader can identify the truth, the lies dissolve. So what is the Truth? Stay tuned for Tarot: Truth and Consequences Advertisements","contentWithMarkup":"Three days ago, a nestling blue jay fell to the ground just behind my home, cracking its head. Blue jays represent communication and pride. Jays are highly competitive, aggressive birds. They make a ruckus wherever they nest. Blue jays also predate on smaller songbirds, killing and eating them. They eat the eggs of other birds, … <a href=\"https://reallifeintuition.wordpress.com/2018/06/02/tarot-truth-or-lies/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> \"Tarot: Truth or Lies?\"</span></a>","tags":["Mystic Monday","Personal Journey"],"publishedDate":"2018-06-02T22:01:16Z","harvestDate":"2018-06-02T22:01:21Z","estimatedPublishedDate":"2018-06-02T22:01:16Z","url":"http://ct.moreover.com/?a=34207268599&p=1u0&v=1&x=FDsX7n0k-SFhBGP_va0SPA","originalUrl":"https://reallifeintuition.wordpress.com/2018/06/02/tarot-truth-or-lies/","outboundUrls":[],"wordCount":"668","dataFormat":"text","duplicateGroupId":"34207268599","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"2519"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Faye Dancing Cloud","publishingPlatform":{"userId":"24535427"}},"licenses":[],"source":{"name":"Real Life Intuition","homeUrl":"https://reallifeintuition.wordpress.com","location":{},"feed":{"id":"352686564","name":"Real Life Intuition","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"24485405","generator":"http://wordpress.com/","description":"Holistic spiritual counselling.","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86995003}