{"sequenceId":"845363517705","id":"34207154228","language":"English","title":"Health","content":"Latest Stories 15 scary symptoms that are actually harmless Yellow spots in eye could be new biomarker for dementia: Study 16 signs your colon isn’t working well How to lose weight without eating less Is low-carb diet harmful for health? Weight Loss 20 of the wackiest weight loss tips from around the world Working out and eating right but can't lose weight? \"Workout\" Activities That Don't Burn Many Calories Trainers Recommend These 7 Exercises If You're Trying to Shed Fat and Get Lean 10 at-home kettlebell workouts to improve your overall fitness Health News 21 natural ways to prevent and treat headaches How human brains became so big Fascinating facts about the human body 21 cancer breakthroughs that could save your life Are you intelligent? Find out Food & Diet 26 surprising foods that can supposedly improve your love life What the world’s oldest people eat (or ate) every day 10 foods dietitians say you should avoid when you're sick 11 foods with more calcium than a glass of milk This is the easiest way to tell if your eggs have gone bad Yoga Feeling anxious? Just a few minutes of meditation might help How to get into yoga at any size Boost your brain through breathing High intensity yoga for weight loss 5 yoga wheel poses for beginners Videos Yoga for anxiety Yoga for digestion Headache relief Yoga breathing for congestion Firm up a flabby middle Home News Weather Entertainment Sports Money Lifestyle Health Food Travel Autos Video","tags":[],"harvestDate":"2018-06-02T21:35:04Z","estimatedPublishedDate":"2018-06-02T21:35:04Z","url":"http://ct.moreover.com/?a=34207154228&p=1u0&v=1&x=B6YW1XjeejXmiSPIOYVDpQ","originalUrl":"http://www.msn.com/en-in/health?srcref=rss","outboundUrls":[],"wordCount":"237","dataFormat":"text","duplicateGroupId":"34158715303","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"publishingPlatform":{}},"licenses":[],"source":{"name":"Style, Beauty & Fashion News, Horoscope, Relationship News | MSN India","homeUrl":"http://www.msn.com/en-in/lifestyle/","location":{"country":"India","countryCode":"IN","region":"Asia","subregion":"Southern Asia"},"feed":{"id":"182236815","name":"Style, Beauty & Fashion News, Horoscope, Relationship News | MSN India","mediaType":"Blog","description":"Get the latest beauty and fashion trends, horoscopes, relationship advice, smart living tips and more.","tags":[],"copyright":"MSN India","language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":["ugc food feeds","ugc sport feeds","ugc recreation feeds","ugc arts feeds","ugc health feeds"]}},"es_id":86991763}