{"sequenceId":"845363656283","id":"34207158964","language":"English","title":"Don't Blink! Written by Amy Krouse Rosenthal and illustrated by David Roberts. Penguin Random House, 2018. $23.99 ages 3 and up","content":"\"JEEPERS! You BLINKED again! I thought you wanted to stay awake! You do realize that each BLINK gets you closer to you- know-what?! TRY NOT TO BLINK!\" I wish I had remembered I had this book on a shelf while my granddaughters were visiting! Oh, well ... I will save it for next time. Bedtime is not always an easy time for children or their caregivers and parents. There is something about giving in to sleep that keeps an independent and in-charge three year old wanting to keep those peepers wide open. Sleep can get in the way of that independence. Watching as they fight closing their eyes can be a source of irritation. This book might make all the difference! After all, telling a young child not to do something is often the catalyst needed to make them even more persistent than usual. The book begins with a challenge. The wise and knowing owl offers it up. \"Here's how it works: If you can avoid getting to the end of this book, you can avoid bedtime, simple as that. {It's a pretty sweet deal, actually.) But each time you BLINK you have to turn a page. Those are the rules.\" Aaah! There's the rub. Many tricks are offered to keep the eyes open and unblinking. Maybe staring at the ceiling will help. Or, at something that holds more interest. Nope, that doesn't work. Pages are turned in quick succession, with every blink of the eyes. Each new tip comes up on a new page, assuring that the end is quickly approaching. Optical illusions don't work, nor staring or squinting. Will anything stop the  forward movement? \"How about using your fingers to hold your eyes open? Well, that seems to have bought you a few extra seconds. But we still need a better plan. Hmmm. Maybe try getting all your BLINKING out.\" Will this be the final straw? Ingenious, and a 'hoot' - it is as much fun to read as it is to listen. Love the design! The owl is increasingly tired as he tries to convince little ones to keep their eyes open. The ever-changing fonts offer pizzazz for the reading. What more can one ask of a bedtime book? Except to read it again ... now!                                                                  ","contentWithMarkup":"<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-PqrRAIGxoaY/WtfIcZsmxNI/AAAAAAAATJg/f7sHfO3vLz4eIjvdYgOlVoeCNV9un4YwACLcBGAs/s1600/don%2527t.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"225\" data-original-width=\"224\" height=\"200\" src=\"https://3.bp.blogspot.com/-PqrRAIGxoaY/WtfIcZsmxNI/AAAAAAAATJg/f7sHfO3vLz4eIjvdYgOlVoeCNV9un4YwACLcBGAs/s200/don%2527t.png\" width=\"199\" /></a></div>\"<strong>JEEPERS! </strong><br /><br />You <strong>BLINKED </strong>again! <br /><br />I thought you wanted to <br />stay awake! You do <br />realize that each <strong>BLINK </strong><br />gets you closer to you-<br />know-what?!<br /><br /><strong>TRY NOT TO BLINK!</strong>\"<br /><br />I wish I had remembered I had this book on a shelf while my granddaughters were visiting! Oh, well ... I will save it for next time.<br /><br />Bedtime is not always an easy time for children or their caregivers and parents. There is something about giving in to sleep that keeps an independent and in-charge three year old wanting to keep those peepers wide open. Sleep can get in the way of that independence. Watching as they fight closing their eyes can be a source of irritation. This book might make all the difference!<br /><br />After all, telling a young child not to do something is often the catalyst needed to make them even more persistent than usual. The book begins with a challenge. The wise and knowing owl offers it up.<br /><br />\"Here's how it works:<br />If you can avoid getting to the end of this book,<br />you can avoid bedtime, simple as that.<br />{It's a pretty sweet deal, actually.)<br /><br />But each time you <b style=\"font-size: x-large;\">BLINK </b>you have to turn a page.<br />Those are the rules.\"<br /><br />Aaah! There's the rub.<br /><br />Many tricks are offered to keep the eyes open and unblinking. Maybe staring at the ceiling will help. Or, at something that holds more interest. Nope, that doesn't work. Pages are turned in quick succession, with every blink of the eyes. Each new tip comes up on a new page, assuring that the end is quickly approaching. Optical illusions don't work, nor staring or squinting. Will anything stop the  forward movement?<br /><br />\"How about using your fingers to hold your eyes open?<br /><br />Well, that seems to have bought you a few extra seconds.<br />But we still need a better plan. Hmmm.<br /><br />Maybe try getting all your <b>BLINKING </b>out.\"<br /><br />Will this be the final straw?<br /><br />Ingenious, and a 'hoot' - it is as much fun to read as it is to listen. Love the design! The owl is increasingly tired as he tries to convince little ones to keep their eyes open. The ever-changing fonts offer pizzazz for the reading. What more can one ask of a bedtime book?<br /><br />Except to read it again ... now!<br />                                                                 <br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-7hP-GyOoJnU/WxL3pfRM1XI/AAAAAAAATUo/nnq2DqJZltEpHuhddqGVWlcByg5Apa6NwCLcBGAs/s1600/sleep.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"159\" data-original-width=\"318\" height=\"200\" src=\"https://1.bp.blogspot.com/-7hP-GyOoJnU/WxL3pfRM1XI/AAAAAAAATUo/nnq2DqJZltEpHuhddqGVWlcByg5Apa6NwCLcBGAs/s400/sleep.jpg\" width=\"400\" /></a></div><br />","tags":["bedtime","humor","interactive","picture book"],"publishedDate":"2018-06-02T20:07:30Z","harvestDate":"2018-06-02T21:36:27Z","estimatedPublishedDate":"2018-06-02T20:07:30Z","url":"http://ct.moreover.com/?a=34207158964&p=1u0&v=1&x=g45GTk1bDy4Akx7kS7zY-Q","originalUrl":"http://salsfictionaddiction.blogspot.com/2018/06/dont-blink-written-by-amy-krouse.html","commentsUrl":"http://salsfictionaddiction.blogspot.com/2018/06/dont-blink-written-by-amy-krouse.html#comment-form","outboundUrls":["https://3.bp.blogspot.com/-PqrRAIGxoaY/WtfIcZsmxNI/AAAAAAAATJg/f7sHfO3vLz4eIjvdYgOlVoeCNV9un4YwACLcBGAs/s1600/don%2527t.png","https://1.bp.blogspot.com/-7hP-GyOoJnU/WxL3pfRM1XI/AAAAAAAATUo/nnq2DqJZltEpHuhddqGVWlcByg5Apa6NwCLcBGAs/s1600/sleep.jpg"],"wordCount":"376","dataFormat":"text","duplicateGroupId":"34207158964","media":{"audio":[],"images":[{"url":"https://1.bp.blogspot.com/-7hP-GyOoJnU/WxL3pfRM1XI/AAAAAAAATUo/nnq2DqJZltEpHuhddqGVWlcByg5Apa6NwCLcBGAs/s400/sleep.jpg"},{"url":"https://3.bp.blogspot.com/-PqrRAIGxoaY/WtfIcZsmxNI/AAAAAAAATJg/f7sHfO3vLz4eIjvdYgOlVoeCNV9un4YwACLcBGAs/s200/don%2527t.png"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Book publishing news","group":"Media"}],"companies":[],"author":{"name":"Sal's Fiction Addiction","publishingPlatform":{}},"licenses":[],"source":{"name":"Sal's Fiction Addiction","homeUrl":"http://salsfictionaddiction.blogspot.com/","location":{},"feed":{"id":"127884175","name":"Sal's Fiction Addiction","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"I love reading books, talking about books and sharing children's and young adult books with anyone who is willing to listen and chat. I have been a kindergarten teacher, a primary teacher, a teacher-librarian, a book reviewer and a workshop presenter for","tags":["picture book","family","humor","friendship","nonfiction","concepts","adventure","animals","imagination","poetry","school","early reading","historical fiction","intermediate novel","seasons","fears","community","death","middle years novel","art and artists","making a difference","world communities"],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86991944}