{"sequenceId":"845363966911","id":"34207169057","language":"English","title":"Redistricting Reform May Be Stalled in PA: Let's Get it Moving","content":"Despite a majority of PA House members cosponsoring or supporting a bill for an independent state and redistricting amendment to the Pennsylvania Constitution in the PA General Assembly, the effort to pass a state constitutional amendment is being stalled by one person - Representative Daryl Metcalfe (R-Butler County).  On April 11, 2018, Rep. Metcalfe, chair of the House State Government Committee called for a voting meeting of all committee members that was scheduled and held with no notice as to what the meeting was about.  On April 12, he held a half-hour meeting where he gutted and substituted language to HB 722 to eliminate the proposed non-partisan, independent redistricting commission with language that would entrench control of redistricting with the party in majority control of the PA General Assembly.  Essentially this amended bill gives the party in control 2/3 of the votes on redistricting to the party in power. Fair Districts PA described what happened: “So rather than an independent commission, or rather than the five-person commission currently in place, which has two from each party and the fifth chosen by the state Supreme Court, [Metcalfe's] amendment would allow the majority leaders of both houses to select a person, which would give two from each party, and then both houses would vote for a third person from that house. Which in effect would give the majority party four members of a six-person commission composed entirely of Legislators.  What we’ve seen is the incredible unaccountable government that results from that kind of gerrymandering, and this was a demonstration. So - at 10:30 this morning, the members of this committee were given a bill which they then voted on and passed by 11:00. They had not read the bill, they had not discussed the bill, they had not invited the prime sponsors of the original bill to explain their bill or to answer questions. There was no debate. There was no transparency. There was just this blatant attempt to bypass the public interest in an independent commission.\" However, the PA Senate has done a bit better.  The Senate State Government Committee has passed an amended version of SB 22 that creates a semi-independent redistricting commission. The original bill only allowed the two controlling parties in the General Assembly to strike up to six names from the pool of commission applicants before the Department of State Secretary selects at random those qualified to serve on the independent redistricting commission.  The selection process in the amended bill allows the majority and minority leaders to select their party representatives (4 for each party) and the Governor would then select the remaining three members who have been registered as either third party or independent voters.  The final list would then be subject to approval by a two-thirds majority of the General Assembly. Once approved, this Commission would then create a map by majority vote with at least one person from each of the three pools voting for the selected plan. If this commission is not able to reach a majority decision, they would then create three maps open for public comment with a final selection vote among these three maps made by a 2/3 vote of the General Assembly.  SB 22 is expected to pass the full Senate this coming week; it will then be sent to the House for consideration.  BUT...  If it is referred back to House State Government Committee, then the effort to reform redistricting in PA is essentially dead for several years since Daryl Metcalfe will not allow a vote on any form of independent redistricting within his committee.  And we only have four weeks left to meet the constitutionally mandated process deadline to amend the PA Constitution in time for the next round of redistricting after the 2020 Census.  SO...          Here's what YOU can do!     \tAsk your state Senator to vote for SB 22 as amended. You can find your PA Senator's phone contact information here; and \tLobby PA Speaker of the House Mike Turzai (R- Allegheny County) to not assign a single redistricting bill to the State Government Committee.  That includes both SB 22 and HB 2402. HB 2402 is the reincarnated rewrite of the original HB 722 that Metcalfe gutted in April. Alternative House committees could be either the House Local Government Committee OR the House Rules Committee; and \tAsk your state representative to support and vote for both HB 2402 (in my opinion the better bill since it makes the redistricting commission entirely independent) and SB 22 if it passes the Senate without further amendment. You can find your state representative's phone contact information here  Here's a press release from the Centre County chapter of Fair Districts PA explaining in more detail what has happened and what we expect to happen throughout June:  Press Release-Redistricting Reform from CC FairDistrictsPA 5-30-2018  Fair Districts PA also has an online letter-writing campaign that you can use. However, it's best if you also make the phone calls as suggested in the above to do list.  Trust in our elections will improve if we have fair redistricting.  Do your part! Make the phone calls and write your letters asap.  Let's get this done!","contentWithMarkup":"Despite a majority of PA House members cosponsoring or supporting a bill for an independent state and redistricting amendment to the Pennsylvania Constitution in the PA General Assembly, the effort to pass a state constitutional amendment is being stalled by one person - Representative Daryl Metcalfe (R-Butler County).\n\nOn April 11, 2018, <a href=\"http://www.legis.state.pa.us/cfdocs/legis/home/member_information/House_bio.cfm?id=13\" rel=\"noopener\">Rep. Metcalfe</a>, chair of the <a href=\"http://www.legis.state.pa.us/cfdocs/CteeInfo/index.cfm?Code=36&CteeBody=H\" rel=\"noopener\">House State Government Committee</a> called for a voting meeting of all committee members that was scheduled and held with no notice as to what the meeting was about.  On April 12, he held a half-hour meeting where he gutted and substituted language to HB 722 to eliminate the proposed non-partisan, independent redistricting commission with language that would entrench control of redistricting with the party in majority control of the PA General Assembly.  Essentially this amended bill gives the party in control 2/3 of the votes on redistricting to the party in power. Fair Districts PA <a href=\"https://www.fairdistrictspa.com/updates/unaccountable-government\" rel=\"noopener\">described </a>what happened:\n<blockquote><em>“So rather than an independent commission, or rather than the five-person commission currently in place, which has two from each party and the fifth chosen by the state Supreme Court, [Metcalfe's] amendment would allow the majority leaders of both houses to select a person, which would give two from each party, and then both houses would vote for a third person from that house. Which in effect would give the majority party four members of a six-person commission composed entirely of Legislators.</em>\n\n<em>What we’ve seen is the incredible unaccountable government that results from that kind of gerrymandering, and this was a demonstration. So - at 10:30 this morning, the members of this committee were given a bill which they then voted on and passed by 11:00. They had not read the bill, they had not discussed the bill, they had not invited the prime sponsors of the original bill to explain their bill or to answer questions. There was no debate. There was no transparency. There was just this blatant attempt to bypass the public interest in an independent commission.\"</em></blockquote>\nHowever, the PA Senate has done a bit better.  The <a href=\"http://www.legis.state.pa.us/cfdocs/CteeInfo/index.cfm?Code=41&CteeBody=S\" rel=\"noopener\">Senate State Government Committee </a>has <a href=\"https://www.fairdistrictspa.com/updates/senate-state-government-committee-to-vote-on-sb22\" rel=\"noopener\">passed an amended version of SB 22 that creates a semi-independent redistricting commission</a>. The original bill only allowed the two controlling parties in the General Assembly to strike up to six names from the pool of commission applicants before the Department of State Secretary selects at random those qualified to serve on the independent redistricting commission.\n\nThe selection process in the amended bill allows the majority and minority leaders to select their party representatives (4 for each party) and the Governor would then select the remaining three members who have been registered as either third party or independent voters.  The final list would then be subject to approval by a two-thirds majority of the General Assembly. Once approved, this Commission would then create a map by majority vote with at least one person from each of the three pools voting for the selected plan. If this commission is not able to reach a majority decision, they would then create three maps open for public comment with a final selection vote among these three maps made by a 2/3 vote of the General Assembly.\n\nSB 22 is expected to pass the full Senate this coming week; it will then be sent to the House for consideration.\n\nBUT...\n\nIf it is referred back to House State Government Committee, then the effort to reform redistricting in PA is essentially dead for several years since Daryl Metcalfe will not allow a vote on any form of independent redistricting within his committee.\n\nAnd we only have four weeks left to meet the constitutionally mandated process deadline to amend the PA Constitution in time for the next round of redistricting after the 2020 Census.\n\nSO...\n\n \n\n\n\n \n\nHere's what YOU can do!\n\n \n<ol>\n\t<li>Ask your state Senator to vote for SB 22 as amended. You can find your PA Senator's phone contact information <a href=\"http://www.legis.state.pa.us/cfdocs/legis/home/findyourlegislator/\" rel=\"noopener\">here</a>; and</li>\n\t<li>Lobby PA Speaker of the House <a href=\"http://www.legis.state.pa.us/cfdocs/legis/home/member_information/House_bio.cfm?id=289\" rel=\"noopener\">Mike Turzai (R- Allegheny County)</a> to <strong><em>not</em> assign a single redistricting bill to the State Government Committee</strong>.  That includes both SB 22 and HB 2402. HB 2402 is the reincarnated rewrite of the original HB 722 that Metcalfe gutted in April. Alternative House committees could be either the <a href=\"http://www.legis.state.pa.us/cfdocs/CteeInfo/index.cfm?Code=30&CteeBody=H\" rel=\"noopener\">House Local Government Committee</a> OR the <a href=\"http://www.legis.state.pa.us/cfdocs/CteeInfo/index.cfm?Code=44&CteeBody=H\" rel=\"noopener\">House Rules Committee</a>; and</li>\n\t<li>Ask your state representative to support and vote for both HB 2402 (in my opinion the better bill since it makes the redistricting commission entirely independent) and SB 22 if it passes the Senate without further amendment. You can find your state representative's phone contact information <a href=\"http://www.legis.state.pa.us/cfdocs/legis/home/findyourlegislator/\" rel=\"noopener\">here</a></li>\n</ol>\nHere's a press release from the Centre County chapter of Fair Districts PA explaining in more detail what has happened and what we expect to happen throughout June:\n\n<a title=\"Press Release-Redistricting Reform from CC FairDistrictsPA 5-30-2018\" href=\"https://civilrightsadvocacy.files.wordpress.com/2018/06/press-release-redistricting-reform-from-cc-fairdistrictspa-5-30-2018.pdf\">Press Release-Redistricting Reform from CC FairDistrictsPA 5-30-2018</a>\n\nFair Districts PA also has an <a href=\"https://actionnetwork.org/letters/urge-your-pa-legislators-to-advance-redistricting-reform-sb-22?source=direct_link&\">online letter-writing campaign</a> that you can use. However, it's best if you also make the phone calls as suggested in the above to do list.\n\nTrust in our elections will improve if we have fair redistricting.  Do your part! Make the phone calls and write your letters asap.  Let's get this done!","tags":["Elections","daryl metcalfe","Fair Districts PA","fair redistricting","gerrymandering","HB2402","HB722","legislative redistricting","Mike Turzai","pa general assembly","PA House Local Government Committee","PA House of Representatives","PA House Rules Committee","PA House State Gov"],"publishedDate":"2018-06-02T21:38:35Z","harvestDate":"2018-06-02T21:38:41Z","estimatedPublishedDate":"2018-06-02T21:38:35Z","url":"http://ct.moreover.com/?a=34207169057&p=1u0&v=1&x=ZcQIr3RSzprja_4sp5LVfw","originalUrl":"http://civilrightsadvocacy.net/2018/06/02/redistricting-reform-may-be-stalled-in-pa-lets-get-it-moving/","outboundUrls":["http://www.legis.state.pa.us/cfdocs/legis/home/member_information/House_bio.cfm?id=13","http://www.legis.state.pa.us/cfdocs/CteeInfo/index.cfm?Code=36&CteeBody=H","https://www.fairdistrictspa.com/updates/unaccountable-government","http://www.legis.state.pa.us/cfdocs/CteeInfo/index.cfm?Code=41&CteeBody=S","https://www.fairdistrictspa.com/updates/senate-state-government-committee-to-vote-on-sb22","http://www.legis.state.pa.us/cfdocs/legis/home/findyourlegislator/","http://www.legis.state.pa.us/cfdocs/legis/home/member_information/House_bio.cfm?id=289","http://www.legis.state.pa.us/cfdocs/CteeInfo/index.cfm?Code=30&CteeBody=H","http://www.legis.state.pa.us/cfdocs/CteeInfo/index.cfm?Code=44&CteeBody=H","https://civilrightsadvocacy.files.wordpress.com/2018/06/press-release-redistricting-reform-from-cc-fairdistrictspa-5-30-2018.pdf","https://actionnetwork.org/letters/urge-your-pa-legislators-to-advance-redistricting-reform-sb-22?source=direct_link&"],"wordCount":"838","dataFormat":"text","duplicateGroupId":"34207169057","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"4216"},"adultLanguage":"false","topics":[],"companies":[{"name":"Members Co Ltd","symbol":"2130","exchange":"NGO","isin":"JP3921700005","titleCount":0,"contentCount":1,"primary":true},{"name":"Members Co Ltd","symbol":"2130","exchange":"TKS","isin":"JP3921700005","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"civilrightsactivist","publishingPlatform":{"userId":"40404433"}},"licenses":[],"source":{"name":"Civil Rights Advocacy","homeUrl":"http://civilrightsadvocacy.net","location":{},"feed":{"id":"325365875","name":"Civil Rights Advocacy","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"44046691","generator":"http://wordpress.com/","description":"Never doubt that a small group of thoughtful, committed citizens can change the world. Indeed, it is the only thing that ever has.  -- Margaret Mead","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"6","autoRankOrder":"76281","inboundLinkCount":"3"},"inWhiteList":"true","autoTopics":[]}},"es_id":86992295}