{"sequenceId":"845363614001","id":"34207157954","language":"English","title":"Brian and Lara","content":"Hi! My name is Lara and I come from Stuttgart. I study Anglistik/ Amerikanistik as my major and political science as my minor subject in Tübingen. In my free time I like to be outside explore places I didn’t know before in Tübingen and around the world, be creative and make useful daily items myself, dance, listen to good music and just spend time with my friends and family. I love to experience new things, learn other languages and get to know other cultures. One of my favorite places to be is Ireland where I spent my Erasmus semester, because of its lifely music scene, the beautiful nature and national parks.   My Buddy Brian comes originally from Los Angeles and studies Community Health in Boston. He likes to spend his free time being active, whether that is dancing, hiking, or exercising and he enjoys being out and testing the limits of his body. And he enjoys learning different types of dancing and so far, he has learned Salsa, Bachata, and Merengue, but he would love to continue learning different styles of dancing, exploring different places. His favorite place to be is any place where he feels challenged. Especially because he moved across the country to study in college, he enjoys being in new places experiencing new things that he has never seen before.","contentWithMarkup":"Hi! My name is<strong> Lara</strong> and I come from Stuttgart. I study Anglistik/ Amerikanistik as my major and political science as my minor subject in Tübingen. In my free time I like to be outside explore places I didn’t know before in Tübingen and around the world, be creative and make useful daily items myself, dance, listen to good music and just spend time with my friends and family. I love to experience new things, learn other languages and get to know other cultures. One of my favorite places to be is Ireland where I spent my Erasmus semester, because of its lifely music scene, the beautiful nature and national parks.\n\n<img class=\"alignnone  wp-image-2177\" src=\"https://iestuebingen.files.wordpress.com/2018/06/buddy-programm-lara-und-brian.jpg\" alt=\"Buddy Programm Lara und Brian\" width=\"417\" height=\"556\" />\nMy Buddy <strong>Brian</strong> comes originally from Los Angeles and studies Community Health in Boston. He likes to spend his free time being active, whether that is dancing, hiking, or exercising and he enjoys being out and testing the limits of his body. And he enjoys learning different types of dancing and so far, he has learned Salsa, Bachata, and Merengue, but he would love to continue learning different styles of dancing, exploring different places. His favorite place to be is any place where he feels challenged. Especially because he moved across the country to study in college, he enjoys being in new places experiencing new things that he has never seen before.","tags":["2018 Summer Program I","Buddy-Teams"],"publishedDate":"2018-06-02T21:36:09Z","harvestDate":"2018-06-02T21:36:11Z","estimatedPublishedDate":"2018-06-02T21:36:09Z","url":"http://ct.moreover.com/?a=34207157954&p=1u0&v=1&x=ubeqN7nN9Lc51HFjFxNsrQ","originalUrl":"https://iestuebingen.wordpress.com/2018/06/02/brian-and-lara/","outboundUrls":[],"wordCount":"223","dataFormat":"text","duplicateGroupId":"34207157954","media":{"audio":[],"images":[{"url":"https://iestuebingen.files.wordpress.com/2018/06/buddy-programm-lara-und-brian.jpg"}],"video":[],"logo":[]},"publishingPlatform":{"itemId":"2176"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"iestuebingen","publishingPlatform":{"userId":"66509199"}},"licenses":[],"source":{"name":"International & European Studies","homeUrl":"https://iestuebingen.wordpress.com","location":{},"feed":{"id":"542017569","name":"International & European Studies","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"69536075","generator":"http://wordpress.com/","description":"University of Tübingen","tags":[],"language":"Unassigned","dataFormat":"text","rank":{"autoRank":"9","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86991905}