{"sequenceId":"845362328874","id":"34207115474","language":"English","title":"Eureka: Be careful when you use Facebook by Akli Hadid","content":"In life we all tend to use a little bit of hygiene. We wake up, shower, shave, brush our teeth, us cologne or perfume, apply creams, drive carefully, don't sleep with random guys and keep strangers at a distance. Now there's no reason you shouldn't be doing that on Facebook. So here are ten commandments to using Facebook.  -If possible, keep all your private information, including birthdate, pictures, liked pages, groups, and posts private. The reason is not because that information is really private, I don't mind sharing a few pictures here and there with the public. The reason is you have some guys (mostly guys) who like to streal your information, create profiles where they copy your pictures, liked pages, birth and personal information and posts, either to “do business” in their home countries, that is use your profile as their business front, or to “date” other men, often trying to scam them and having them send “you” money. If you don't keep all that information private, there could be misunderstadings and you could have the police knocking at your door and arresting you for scamming people or dealing drugs.  -Adding friends. Only add those you have met and known physically and have been around with for some time. This is because a lot of people will get to know you in forums or groups, will add you, and will start stealing your information.  -You can vent your frustrations or talk about very personal stuff in public, it doesn't really matter. But be mindful that some people will try to gain from the information you are sharing. If you strike it rich, they will want a part of the cake. If you need money, they could offer you deceitful services.  -Dating and Facebook. A lot of guys and girls use fake information on their profiles, including their city of residence and the company they work for. Most serious guys and girls don't cite their city of residence and workplace on their profiles, because that could lead to stalkers.  For more HERE!","contentWithMarkup":"<strong>In life we all tend to use a little bit of hygiene. We wake up, shower, shave, brush our teeth, us cologne or perfume, apply creams, drive carefully, don't sleep with random guys and keep strangers at a distance. Now there's no reason you shouldn't be doing that on Facebook. So here are ten commandments to using Facebook.</strong>\n\n<img title=\"face00001_400\" src=\"http://www.ovimagazine.com/2018images/face00001_400.jpg\" alt=\"face00001_400\" width=\"400\" height=\"265\" align=\"right\" border=\"0\" />-If possible, keep all your private information, including birthdate, pictures, liked pages, groups, and posts private. The reason is not because that information is really private, I don't mind sharing a few pictures here and there with the public. The reason is you have some guys (mostly guys) who like to streal your information, create profiles where they copy your pictures, liked pages, birth and personal information and posts, either to “do business” in their home countries, that is use your profile as their business front, or to “date” other men, often trying to scam them and having them send “you” money. If you don't keep all that information private, there could be misunderstadings and you could have the police knocking at your door and arresting you for scamming people or dealing drugs.\n\n-Adding friends. Only add those you have met and known physically and have been around with for some time. This is because a lot of people will get to know you in forums or groups, will add you, and will start stealing your information.\n\n-You can vent your frustrations or talk about very personal stuff in public, it doesn't really matter. But be mindful that some people will try to gain from the information you are sharing. If you strike it rich, they will want a part of the cake. If you need money, they could offer you deceitful services.\n\n-Dating and Facebook. A lot of guys and girls use fake information on their profiles, including their city of residence and the company they work for. Most serious guys and girls don't cite their city of residence and workplace on their profiles, because that could lead to stalkers.\n\nFor more <strong><a href=\"http://www.ovimagazine.com/art/15749\" target=\"_blank\" rel=\"noopener\">HERE! </a></strong>","tags":["ovi magazine","internet","social media"],"publishedDate":"2018-06-02T21:25:11Z","harvestDate":"2018-06-02T21:25:19Z","estimatedPublishedDate":"2018-06-02T21:25:11Z","url":"http://ct.moreover.com/?a=34207115474&p=1u0&v=1&x=0Olwx78lVp4QSu50FgIfNA","originalUrl":"https://ovibite.wordpress.com/2018/06/02/eureka-be-careful-when-you-use-facebook-by-akli-hadid/","outboundUrls":["http://www.ovimagazine.com/art/15749"],"wordCount":"342","dataFormat":"text","duplicateGroupId":"34207115474","media":{"audio":[],"images":[{"url":"http://www.ovimagazine.com/2018images/face00001_400.jpg"}],"video":[],"logo":[]},"publishingPlatform":{"itemId":"2217"},"adultLanguage":"false","topics":[{"name":"Cyberculture news","group":"Internet"},{"name":"Facebook news","group":"Internet"},{"name":"Social networks news","group":"Internet"}],"companies":[],"author":{"name":"ovithanos","publishingPlatform":{"userId":"254134"}},"licenses":[],"source":{"name":"Ovi Magazine – iBite","homeUrl":"https://ovibite.wordpress.com","location":{},"feed":{"id":"324193174","name":"Ovi Magazine – iBite","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"258431","generator":"http://wordpress.com/","description":"Ovi Magazine, the best on line magazine.","tags":[],"language":"Unassigned","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990522}