{"sequenceId":"845362217964","id":"34207111818","language":"English","title":"IT FAILS EVERY TIME IT'S TRIED.","content":"This year marks the bicentennials of Illinois statehood and of the birth of Karl Marx.  I'll resist the \"tragedy\" and \"farce\" temptations tempting me, and offer what I hope is a straightforward Book Review No. 12 of the bicentennial edition of Terry Eagleton's Why Marx Was Right. Yes, it's easy enough to proceed, barrel, fish, particularly because Mr Eagleton finished the revisions and sent it to press while it was still possible to think positively of an oil-rich country using its oil revenues to increase the living standards of all the citizens.  Perhaps, somewhere in his writings, there might be yet another explanation for how another vulgarian purporting to get Marx right got it wrong. For that is the concluding message of his book.  \"Marx had a passionate faith in the individual and a deep suspicion of abstract dogma.  He had no time for the concept of a perfect society, was wary of the notion of equality, and did not dream of a future in which we would all wear boiler suits with our National Insurance numbers stamped on our backs.  It was diversity, not uniformity, that he hoped to see.\"  That's part invocation of the Marx of German Ideology, part the standard attempt to distinguish Marx-the-social-critic from Marx-the-secular-saint misinterpreted by false prophets (from Stalin to Tito to the Kim family?) The message of Mr Eagleton's book, though, might be for people, whether sympathetic to or opposed to, what they understand as Marxian thinking, to, well, take the time to read and understand the original works. Each chapter appears to be a response to a different argument, possibly raised by a public intellectual of some kind, to wit.  Marxism is finished.  It might conceivably have had some relevance to a world of factories and food riots, coal miners and chimney sweeps, widespread misery and massed working classes.  Marxism may be all very well in theory.  Whenever it has been put into practice, however, the result has been terror, tyranny and mass murder on an inconceivable scale.  Marxism is a form of determinism.  Marxism is a dream of utopia.  Marxism reduces everything to economics.  Marx was a materialist.  Nothing is more outdated about Marxism than its tedious obsession with class.  Marxists are advocates of violent political action.  Marxism believes in an all-powerful state.  All the most interesting radical movements of the past four decades have sprung up from outside Marxism.  Feminism, environmentalism, gay and ethnic policies, animal rights, antiglobalisation, the peace movement: these have now taken over from an antiquated commitment to class struggle. The ten ensuing arguments might well be responding to straw men, although they are surely an eclectic collection of straw men, and people more conversant with, or adherent to, any one of the ten positions, might find intellectual ammunition, or something to engage, in Mr Eagleton's response. That reality is sufficiently messy suggests the public intellectual Marx might have something to contribute, even if it's not the formulaic stuff of people calling themselves Marxists, or using \"Marxist\" as a pejorative.  On the first hand, \"There are a number of groups that call themselves Marxist in the U.S.—an alphabet soup whose various names and sectarian tendencies can be reviewed on Wikipedia. None of them have anything close to a large membership. Many of them spend more time tearing each other apart in sectarian squabbling than in organizing or inspiring anyone to fight the many manifest evils of capital.\"  On the second, \"It never seems to have dawned on either [Barack] Obama or [Angela] Merkel that the only people truly invested in defending the always-vaguely-defined \"liberal international order\" are the men and women who sit at the top of it. Certainly the voters are not as satisfied with current circumstances as they.\" (Cross-posted to 50 Book Challenge.)","contentWithMarkup":"This year marks the bicentennials of Illinois statehood and of the birth of Karl Marx.  I'll resist the \"tragedy\" and \"farce\" temptations tempting me, and offer what I hope is a straightforward Book Review No. 12 of the bicentennial edition of Terry Eagleton's Why Marx Was Right.\n\n\n\n\n\n\nYes, it's easy enough to proceed, barrel, fish, particularly because Mr Eagleton finished the revisions and sent","tags":["50 Book Challenge","history","logic","policy mythology","political economy"],"publishedDate":"2018-06-02T20:12:10Z","harvestDate":"2018-06-02T21:24:36Z","estimatedPublishedDate":"2018-06-02T20:12:10Z","url":"http://ct.moreover.com/?a=34207111818&p=1u0&v=1&x=_qyAdsjsua-NfAbG7GUPNg","originalUrl":"http://coldspringshops.blogspot.com/2018/06/it-fails-every-time-its-tried.html","commentsUrl":"http://www.blogger.com/comment.g?blogID=3760005&postID=6517849523932617819","outboundUrls":["https://50bookchallenge.livejournal.com/","https://www.amazon.com/Why-Marx-Right-Terry-Eagleton/dp/0300231067/ref=sr_1_1_twi_pap_1?s=books&ie=UTF8&qid=1527967316&sr=1-1&keywords=why+marx+was+right","https://2.bp.blogspot.com/-v138aKN_NUw/WxLv15WFHNI/AAAAAAAAGKY/MHpqyf4nAvIzlPAUCDM2zve3Xa9jHsAXwCLcBGAs/s1600/communism_no_food.jpg","https://www.commondreams.org/views/2018/06/01/needed-now-real-and-radical-left","http://freebeacon.com/columns/the-world-as-it-wasnt/","https://50bookchallenge.livejournal.com/13750073.html"],"wordCount":"626","dataFormat":"text","duplicateGroupId":"34207111818","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"National Insurance Co","symbol":"NIC","exchange":"XPAE","isin":"PS3002112921","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"Stephen Karlson","publishingPlatform":{}},"licenses":[],"source":{"name":"COLD SPRING SHOPS.","homeUrl":"http://coldspringshops.blogspot.com/","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"156600375","name":"COLD SPRING SHOPS.","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"Observations on economics, the academy, the wider world, and things that run on rails.","tags":["academic culture","decline and fall","policy mythology","ferroequinology","institutions","economics","hope and change","political economy","history","business follies","logic","election follies","transportation policy","infrastructure","fourth turning","good cheer","public policy","higher"],"language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"24305","inboundLinkCount":"23"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990381}