{"sequenceId":"845367184035","id":"34207258889","language":"English","title":"Moran Eye Center says recent theft caused potential disclosure of patient information","content":"SALT LAKE CITY, Utah -- A recent theft at the John A. Moran Eye Center at the University of Utah may have resulted in the disclosure of more than 600 patients' information.  According to a press release, the Moran Eye Center is notifying 607 patients of a potential disclosure of their information after the theft of electronic equipment.  The center says they learned on April 3 that a laptop computer and an external storage device used to take and store retinal images were stolen from locked storage at 65 Mario Capechi Drive in Salt Lake City.  The eye center says they've now determined the devices, \"contained limited patient information for 602 infants and 5 adults who had images taken by Moran specialists...\" The affected patients visited the U of U Hospital or Primary Children's Hospital between July 1, 2014 and March 30, 2018.  The information potentially disclosed includes retinal images, full or partial names, dates of birth, and a medical records number used to identify records within the University of Utah Health medical records system.  The center says no social security numbers or financial details were stored on either device, and those patients who are affected will receive letters in the mail.  The patients may also call 855-349-6456 between 7 a.m. and 7 p.m. MDT Monday through Friday with questions or to get information about enrollment in free credit monitoring services.  The center says police are investigating the theft, and they say the center is also \"improving its policy and procedures and enhancing security measures to reduce the risk of an event like this from occurring again.\"","contentWithMarkup":"SALT LAKE CITY, Utah -- A recent theft at the John A. Moran Eye Center at the University of Utah may have resulted in the disclosure of more than 600 patients' information.\n\nAccording to a press release, the Moran Eye Center is notifying 607 patients of a potential disclosure of their information after the theft of electronic equipment.\n\nThe center says they learned on April 3 that a laptop computer and an external storage device used to take and store retinal images were stolen from locked storage at 65 Mario Capechi Drive in Salt Lake City.\n\nThe eye center says they've now determined the devices, \"contained limited patient information for 602 infants and 5 adults who had images taken by Moran specialists...\" The affected patients visited the U of U Hospital or Primary Children's Hospital between July 1, 2014 and March 30, 2018.\n\nThe information potentially disclosed includes retinal images, full or partial names, dates of birth, and a medical records number used to identify records within the University of Utah Health medical records system.\n\nThe center says no social security numbers or financial details were stored on either device, and those patients who are affected will receive letters in the mail.\n\nThe patients may also call 855-349-6456 between 7 a.m. and 7 p.m. MDT Monday through Friday with questions or to get information about enrollment in free credit monitoring services.\n\nThe center says police are investigating the theft, and they say the center is also \"improving its policy and procedures and enhancing security measures to reduce the risk of an event like this from occurring again.\"","tags":["Local","News","data breach","Moran Eye Center","theft"],"publishedDate":"2018-06-02T21:58:47Z","harvestDate":"2018-06-02T21:59:31Z","estimatedPublishedDate":"2018-06-02T21:58:47Z","url":"http://ct.moreover.com/?a=34207258889&p=1u0&v=1&x=chCNV1SRUTK7SCFoaDz41A","originalUrl":"http://fox13now.com/2018/06/02/moran-eye-center-says-recent-theft-caused-potential-disclosure-of-patient-information/","outboundUrls":[],"wordCount":"253","dataFormat":"text","duplicateGroupId":"34207258889","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"610200"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Mark Green","publishingPlatform":{"userId":"44702499"}},"licenses":[],"source":{"name":"fox13now.com","homeUrl":"http://fox13now.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"240250708","name":"fox13now.com","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"29519479","generator":"http://wordpress.com/","description":"News for Salt Lake City, Ogden, Provo and beyond","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"1","autoRankOrder":"666","inboundLinkCount":"4987"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994669}