{"sequenceId":"845363517269","id":"34207154224","language":"English","title":"This woman's reason for plastic surgery might surprise you","content":"© Provided by Refinery29 Inc. Refinery29 In light of an annual report by the American Academy of Facial Plastic and Reconstructive Surgery that found that 57% of people get plastic surgery to stay competitive at work, we asked Raleigh Seldon, a 26-year-old marketing coordinator in L.A., to explain, in her own words, how rhinoplasty boosted her self confidence — and her career. The following story was told to Kelsey Castañon and edited for length and clarity. Growing up in Toronto, Canada, plastic surgery, or anything else that altered your natural state, was super hush-hush and taboo — I knew nothing about it. The only real introduction I got was from reality shows like the Real Housewives, and even then they only talked about Botox. So I always knew I hated photos of myself, but I never knew what could be done. It wasn't until last year, when I was working as a style editor at E! News, that I started to consider getting a nose job. These days, everyone in media is becoming the face of their own personal \"brand.\" I had all these editors around me who would include selfies of themselves in their articles or go on camera, and I just couldn't do it. I never wanted to shoot anything live because I was so worried about what my profile looked like. That absolutely hindered the path I could have taken my career on. When I wrote first-person pieces, I would either opt out of including a photo of myself, or I would reluctantly take one and my boss wouldn't be happy with the imagery. I never directly said anything about my appearance to my boss, but I had a personal relationship with her, so she knew my nose was something that bothered me. Whenever I got photos back, I'd be so picky and push it back to the retoucher. She observed that behavior and was like, \"Okay, I see what's going on here.\" © Courtesy of Raleigh Seldon. Refinery29 A good friend of mine was the beauty editor at the time, and so she was discovering all these crazy procedures that celebrities I admired were doing. I was like, \"Wait, people get lip injections and undereye filler?\" There was just so much I'd never heard of, and everyone who I thought was natural turned out not to be. Related: 13 Things Plastic Surgeons Won't Tell You (Provided by Reader's Digest) 13 Things Plastic Surgeons Won’t Tell You Once I opened that door and started looking into it, I couldn't shut it. My nose was on my mind at all times. I started analyzing past behaviors and realizing every photo of me from high school on showed me covering my face, drinking something to cover my nose, or hiding behind someone else in a group. It's crazy to go back and realize how much it was affecting me throughout my life. So I started saving up my money and researching plastic surgeons, and I found Dr. Deepak Dugar in Beverly Hills. He's originally from a town in Canada that's just outside where I grew up, and we bonded immediately. I felt completely comfortable with him. Obviously, I was also itching to get it done, so after the consultation I was like, \"When can you get me in?\" and we booked the procedure for a month later. © Courtesy of Dr. Deepak Dugar. Refinery29 After the rhinoplasty, I was so much more confident about the way I looked. Things at work just started happening. I was suddenly eager to get in front of the camera, and became way more involved with my own photoshoots. I just started making bolder choices with my career. Since moving to L.A. seven years ago, I've been really great at networking. One night, I was at a birthday dinner and one of my mentors in a completely different field was there. She introduced me to a celebrity's manager, who was looking for a marketing coordinator. Because of my newfound confidence, I wasn't shying away from going after any opportunity and I ended up getting the job! In the end, getting plastic surgery is a personal decision. If you're going to do it, figure it out within yourself first. Don't ask other people what they think. They will say you're fine, or that you don't need it, which is true — no one needs it. But personally, it helped me become a better advocate for myself. Not just to get ahead in my career, but even in the smallest ways, like on social media. My personal brand is more well-rounded than it was before because I'm not afraid to show my face. As long as you are okay with your decision, that's all that matters. Related: A New Way to the Nose You Want (Provided by: Refinery 29) Replay Video UP NEXT Dua Lipa On The Red Carpet With Refinery29 At The Billboard Awards Emily and Arianna talk with Dua Lipa about performing, confidence, and her style on the red carpet at the Billboard Awards. Refinery29\rChantel Jeffries On The Red Carpet With Refinery29 At The Billboard Awards Emily and Arianna talk to Chantel Jeffries about becoming a DJ, Janet Jackson, and her favorite artists on the red carpet at the Billboard Awards. Refinery29\rBebe Rexha On The Red Carpet At The Billboard Awards Emily and Arianna talk to Bebe Rexha on her upcoming album and also about their dresses. Refinery29\r1 Cancel SETTINGS OFF\rHD HQ SD LO\rUP NEXT Also watch: Plastic surgery apps are targeting children (Provided by Wochit) Replay Video UP NEXT Cavaliers Forward Will Not Be Suspended For Game 1 Ejection Cleveland Cavaliers forward Tristan Thompson has been fined $25,000 for his altercation with Golden State's Draymond Green during the final moments of Game 1 of the NBA Finals, but won't be suspended. Days after being ejected from the game for being issued a Flagrant Foul 2 by referees, the NBA announced that “upon review,\" Thompson’s foul has now been downgraded to a Flagrant 1. The teams will meet for Game 2 of the NBA Championship this Sunday night in Oakland. Wochit News\rBenedict Cumberbatch Helps Cyclist Being Attacked by Four People in London On Saturday, SF Gate reproted that Benedict Cumberbatch reportedly saved a cyclist who was being attacked by a group of four people in London. According to The Sun, the “Doctor Strange” actor jumped out of his Uber on in central London when he saw a food delivery cyclist for Deliveroo being hit over the head with a bottle. Witnesses say Cumberbatch sprinted to the scene yelling at the muggers. He reportedly dragged the four muggers off the victim, being able to fend them off. Wochit News\rNorth Korea Reportedly Wants Someone to Pay Its Hotel Bill For Summit With U.S. On Saturday CNN reported that US officials are trying to solve the logistical issue of who will pay for North Korean leader Kim Jong Un's housing. A week after abruptly scrapping the summit with Kim, President Donald Trump announced Friday that the historic talks were back on for June 12 in Singapore. The Washington Post reported on Friday that with its economy weakened from tough sanctions, Pyongyang is requiring that another country pay for Kim and his delegation's hotel bill. Wochit News\r1 Cancel SETTINGS OFF\rHD HQ SD LO\rUP NEXT","contentWithMarkup":"<img align=\"left\" src=\"http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAvJdoz.img?h=100&w=100&m=6&q=60&o=f&l=f&x=599&y=527\" />","tags":[],"harvestDate":"2018-06-02T21:35:04Z","estimatedPublishedDate":"2018-06-02T21:35:04Z","url":"http://ct.moreover.com/?a=34207154224&p=1u0&v=1&x=jF_ac2B62WadPfLFGrsVBQ","originalUrl":"https://www.msn.com/en-in/lifestyle/whats-hot/i-got-plastic-surgery-to-get-ahead-in-my-career/ar-AAy3GyQ?srcref=rss","outboundUrls":[],"wordCount":"1207","dataFormat":"text","duplicateGroupId":"34189253162","media":{"audio":[],"images":[{"url":"http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAvJdoz.img?h=100&w=100&m=6&q=60&o=f&l=f&x=599&y=527"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"In Media Corp","symbol":"IMDC","exchange":"PINX","isin":"US4532281080","titleCount":0,"contentCount":1,"primary":true}],"author":{"publishingPlatform":{}},"licenses":[],"source":{"name":"Style, Beauty & Fashion News, Horoscope, Relationship News | MSN India","homeUrl":"http://www.msn.com/en-in/lifestyle/","location":{"country":"India","countryCode":"IN","region":"Asia","subregion":"Southern Asia"},"feed":{"id":"182236815","name":"Style, Beauty & Fashion News, Horoscope, Relationship News | MSN India","mediaType":"Blog","description":"Get the latest beauty and fashion trends, horoscopes, relationship advice, smart living tips and more.","tags":[],"copyright":"MSN India","language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":["ugc food feeds","ugc sport feeds","ugc recreation feeds","ugc arts feeds","ugc health feeds"],"editorialTopics":["Lifestyle","Consumer"]}},"es_id":86991759}