{"sequenceId":"845361938987","id":"34207102792","language":"English","title":"Human Relationships: Living as \"Brothers and Sisters\"","content":"Dear fellow Christians: do we really believe that Jesus makes us brothers and sisters in a unity more intimate than anything in this world? Do we really know what it means to live as members of one another in Christ, journeying together toward our common destiny of eternal life and love in the Trinity? It's so easy, as Catholic Christians, to have a moment in which we recognize, \"this is the road for our journey!\" But then we walk that road like we are strangers. I have a very hard time with that. For me, the road is so weird and I get lost all the time, or go around in circles. I can't do this alone. I need something more than polite fellow-travelers on this trip. Even though I constantly fight to preserve the illusion of my \"autonomy\" and the fantasy of my own self-sufficiency, I know that I need to live my faith together with other people. So where can I go? The Church, of course! But what does that mean? There's the local church ...what do I find in the typical vibrant American [or insert your country here] parish? There are the sacraments, first of all, -- the fountains of Christian life are given in them. But how is this life lived intensely? Well, the parish has many kinds of groups. I may encounter something here that really changes me. Or I might just find lots of well-intended activity going on. That's good and worthwhile, but by themselves good activities are not enough. After they're over, I get into my car and drive back to my lonely fortress. Is that what the New Testament calls \"the fellowship of disciples\"? I need help for my whole life, relationships, everything. I need \"community.\" This is a fundamental human need, and for a Christian this need only intensifies. But let's face it: building and sustaining a real community is the hardest thing in the world. People always end up fighting and dividing into factions. Catholics? Oh boy, we fight more than anybody. So where can I find intense \"Catholic community\"? What about just giving up my mind and my freedom to someone who seems to know it all, some self-appointed \"benevolent Catholic dictator\" who just tells me what to think and what to do and relieves me of the awful burden of being a human person? I must admit that this option can be very tempting. \"Conformity\" and \"comfort,\" disguised as \"obedience,\" could shape my notions and my behavior into a formulaic routine, and give me a sense of superiority, but they would also also suffocate my heart -- that depth of me that says, \"I am someone, I have been made for a reason, I have aspiration, I have hope, I don't just want to be reduced to a 'part' of a project, not even the cosmic project!\" What else is there for me? Should I just embrace and exalt my aloneness? I could say, \"I'm gonna do what I think is 'Catholic' [i.e. whatever I want, as long as I can rationalize it by some veneer of Catholic theology or piety] and just blow off everybody else.\" For me, personally, that's the short path to the psych ward. Others seem to get by with this attitude, except that it's really crummy for their spouses (who often become ex-spouses) and their children and anyone else who needs them or tries to care about them. Not a good option. I don't want to be alone. I need people. Clubs and casual friends and the internet are not enough. But being part of some kind of \"collective\" not only is humanly unhealthy, it also just covers up the loneliness. And there can be a lot missing even from the experience of being in dedicated Catholic groups that work together for the good of the Church. People can share an activity (even passionately) without sharing their lives. Passion for the cause can become a cover for not acknowledging the poverty of my person, for not sharing myself, for not loving and for not being honest about my own vulnerability, my own need to be loved. I can even \"belong\" to a \"movement,\" and wear it like a badge, and conform myself to its external style, and do all the \"stuff,\" and still not invest myself. I can cover up the fact that I'm poor and that I need God. I can hide it from others, and from myself. I can choose mere conformity over the struggle to live with others heart-to-heart. It's so much easier than the risk of exposing my suffering to myself and others, and then suffering even more as I discover that they don't fully understand me and they can't fix me. Portrait of the Artist as a Proud Man It's also true that I don't want people meddling in my life. I don't want to let them see my faults and then tell me what they think \"I have to do.\" That's because I lack humility, first of all. I mean, let's be real here. I'm a proud man and I don't know how to be humble. I don't like being corrected by anyone else, even (especially!) when their corrections are spot on. I'm proud, therefore I'm afraid. But there is another reason for this fear that I have. So often in life, my experience has been that people come along, stand on their platform, rebuke me, and then they go away! It's as if they are saying, \"You don't really belong (and we won't really love you) until you correct these aspects of your personality, and you have to do that all by yourself. Then, after you've filled up all your own personal holes, then we will be with you and love you.\" I shouldn't be surprised by this, however, because I do the same thing to other people. We do this so much to one another. Precisely those of us who are most committed to the ideals of community and relationships and solidarity: We do this. It happens in movements and committed Christian communities. It happens (too much) in \"Catholic\" marriages and \"Catholic\" families where we pride ourselves on our Catholic values, on how we \"do things right\" and how we are so different from all those screwed up families and screwed up people out there in the bad, bad world. How different are we, really? We have an indissoluble marriage, a big family, a good Catholic community, or even an institution or movement \"that has been praised by the Pope.\" But how do we live? Do we live as \"brothers and sisters,\" really? Or, rather, do we live our real lives alone. Then we come out to \"help\" one another every so often. Then we go back to our own inner shells, to being alone. Even when we are \"together,\" we can easily live this dialectic of loneliness and invasiveness, reducing our togetherness into a kind of violence and alienation. This happens insofar as we forget about Jesus, insofar as we forget about the Holy Spirit. This forgetfulness can happen even when there's lots of talk about Jesus and the Holy Spirit and the Church and the Eucharist and the sacraments and community and the dignity of the human person and all the rest. It's easy to \"domesticate\" these words into our vocabulary and forget about the mysterious, intimate, concrete realities they signify. I don't want to belong to a group of people who just correct my behavior and call me \"brother,\" but forget the real Jesus, and therefore don't really, actively love me. That's not the life of the Church. That's manipulation. That's the dynamic of a fundamentalist sect. It's just another form of power imposing itself upon the weak. Without Jesus emptying Himself on the cross out of love for sinners, for each one of us, for every human person, without Jesus and His love to the end... what are we? Nothing! With Him, and depending completely on Him, trusting in Him, we really live the mystery of the Church. We are His presence in the world. This is our vocation, and this is what He wants so ardently, for us and for others, because He wants to love. What can I do except beg Jesus to make this happen in myself, my family, my friends, that the Holy Spirit will make this new life grow in me, change me, transform me, taking up all the weakness and the fear, opening up all the selfishness. When we talk about our relationships within the Church, we use these terms: \"brothers and sisters\" and \"members of a body.\" Why? Are we just being nice? Why these metaphors, or even better, are they just metaphors? The Church is our Mother. Baptism is a new birth. We are brothers and sisters and more, members of Christ's \"mystical\" body (and \"mystical\" means real, but in a mysterious way beyond our understanding). Thus incorporated into Christ's body, we are members of one another. Is all this just \"Christianspeak\"? I hope not. Because this is what I want! I want brothers and sisters. I want a family. I want to belong to God, to call Him \"Father,\" and to have the freedom to be with others in my life and say, \"I am your brother\" and \"you are my brother, you are my sister.\" You--my brother, my sister--you help me just by the fact that we are together, you help me even when you fail or forget. We live our fidelity to Jesus and the whole of His Catholic Church together, on the daily level. We can help one another to deal with all the junk that comes along every day, and when we look at one another, we'll start to remember that because of Jesus all of this junk has value. And, if you think I'm being stupid about something, go ahead and tell me, because that's what brothers and sisters do. Of course you might be wrong, but if you think you see something that I'm missing about myself, you'll take the chance. I might get angry, but together we'll work it out (eventually, with patience) and we'll grow. We can look to our elders whose wisdom and example are a gift to us. We can forgive one another for having different personalities and therefore bumping against one another all the time, every day. Because we know we're a family and we're not going to go away and stop loving each other. We are together in Him. Jesus. We help one another to follow Him to the place where our hearts will all finally be at home. Is it possible to live this way? Is it possible to even begin to live this way? It must be possible, because this is the life that God wants to give us. The Christian vocation is to love every person, of course, but the vitality of that love comes from the unity, openness, and freedom that Jesus gives to Christians who love one another. Thus we are exhorted to \"Lead a life worthy of the calling to which you have been called, with all humility and gentleness, with patience, bearing with one another in love, making every effort to maintain the unity of the Spirit in the bond of peace. There is one body and one Spirit, just as you were called to the one hope of your calling, one Lord, one faith, one baptism, one God and Father of all, who is above all and through all and in all\" (Ephesians 4:1-6). This is at the heart of Jesus's prayer for all his followers: \"...that they may all be one. As you, Father, are in me and I am in you, may they also be in us, so that the world may believe that you have sent me. The glory that you have given me I have given them, so that they may be one, as we are one, I in them and you in me, that they may become completely one, so that the world may know that you have sent me and have loved them even as you have loved me\" (John 17:21-23). Is it possible to live this way, daily, together? It must be possible. It is, more than anything, what the world desperately needs from us. We can at least begin. We can begin to want it, desire it, ask for it. We can begin to live this way, and then begin again the next day, and every day. As for me, I run away from this life every day. It scares me to death (why is that?). But it's still what I really want. I beg for it. Jesus, I know that this is the only way to live really, to find myself, to walk the steps of each day, to attain my destiny. Jesus, help me to begin again.","contentWithMarkup":"<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><a href=\"https://4.bp.blogspot.com/-ocNbvG28Heo/V1XPjGnIodI/AAAAAAAAzN4/2Ix7iv8kOY8T1QZtwTLbSJITm3my3j37gCLcB/s1600/zz11.jpg\" imageanchor=\"1\" style=\"background-color: transparent; clear: left; float: left; margin-bottom: 1em; margin-right: 1em; text-align: center;\"><img border=\"0\" height=\"270\" src=\"https://4.bp.blogspot.com/-ocNbvG28Heo/V1XPjGnIodI/AAAAAAAAzN4/2Ix7iv8kOY8T1QZtwTLbSJITm3my3j37gCLcB/s400/zz11.jpg\" width=\"400\" /></a><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">Dear fellow Christians: do we really believe that Jesus makes us <i>brothers and sisters </i>in a unity more intimate than anything in this world? </span><span style=\"background-color: white; color: #222222; font-family: roboto, arial, sans-serif; font-size: 13px;\">Do we really know what it means to live as</span><i style=\"color: #222222; font-family: roboto, arial, sans-serif; font-size: 13px;\"> members of one another</i><span style=\"background-color: white; color: #222222; font-family: roboto, arial, sans-serif; font-size: 13px;\"> in Christ, journeying together toward our common destiny of eternal life and love in the Trinity?</span><br /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\"><br /></span><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">It's so easy, as Catholic Christians, to have a moment in which we recognize, <i>\"this is the road for our journey!\"</i> But then we walk that road like we are strangers.</span><br /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\"><br /></span><span style=\"background-color: white; color: #222222; font-family: \"arial\" , \"tahoma\" , \"helvetica\" , \"freesans\" , sans-serif; font-size: 13.2px; line-height: 18.48px;\"></span><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">I have a very hard time with that. For me, the road is so weird and I get lost all the time, or go around in circles. I can't do this alone. I need something more than polite fellow-travelers on this trip. Even though I constantly fight to preserve the illusion of my \"autonomy\" and the fantasy of my own self-sufficiency, I <i>know </i>that I need to live my faith together with other people.</span><br /><br style=\"background-color: white; color: #222222; font-family: roboto, arial, sans-serif; font-size: 13px; line-height: 18px;\" /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">So where can I go? The Church, of course! But what does that mean? There's the local church ...what do I find in the typical vibrant American [or insert your country here] parish? There are the sacraments, first of all, -- the fountains of Christian life are given in them. But how is this life lived intensely? Well, the parish has many kinds of groups. I may encounter something here that really changes me. Or I might just find lots of well-intended activity going on. That's good and worthwhile, but by themselves good activities are not enough. After they're over, I get into my car and drive back to my lonely fortress. Is that what the New Testament calls \"the fellowship of disciples\"?</span><br /><span style=\"font-family: \"roboto\" , \"arial\" , sans-serif;\"><span style=\"font-size: 13px; line-height: 18px;\"><br /></span></span><span style=\"font-family: \"roboto\" , \"arial\" , sans-serif;\"><span style=\"font-size: 13px; line-height: 18px;\">I need help for my whole life, relationships, everything. I need \"community.\" This is a fundamental human need, and for a Christian this need only intensifies. But let's face it: <b><i>building and sustaining a real community is the hardest thing in the world</i></b>. People always end up fighting and dividing into factions. Catholics? Oh boy, we fight more than anybody.</span></span><br /><span style=\"font-family: \"roboto\" , \"arial\" , sans-serif;\"><span style=\"font-size: 13px; line-height: 18px;\"><br /></span></span><span style=\"font-family: \"roboto\" , \"arial\" , sans-serif;\"><span style=\"font-size: 13px; line-height: 18px;\">So where can I find intense \"Catholic community\"?</span></span><br /><span style=\"font-family: \"roboto\" , \"arial\" , sans-serif;\"><span style=\"font-size: 13px; line-height: 18px;\"><br /></span></span><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">What about just giving up my mind and my freedom to someone who seems to know it all, some self-appointed \"benevolent Catholic dictator\" who just tells me what to think and what to do and relieves me of the awful burden of being a human person? I must admit that this option can be very tempting. \"Conformity\" and \"comfort,\"<i> disguised as \"obedience,\"</i> could shape my notions and my behavior into a formulaic routine, and give me a sense of superiority, but they would also also suffocate my heart -- that depth of me that says, \"I am someone, I have been made for a reason, I have aspiration, I have hope, I don't just want to be reduced to a 'part' of a project, not even the cosmic project!\"</span><br /><br style=\"background-color: white; color: #222222; font-family: roboto, arial, sans-serif; font-size: 13px; line-height: 18px;\" /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">What else is there for me? Should I just embrace and exalt my aloneness? I could say, \"I'm gonna do what I think is 'Catholic' [i.e. whatever I<i> want,</i> as long as I can rationalize it by some veneer of Catholic theology or piety] and just blow off everybody else.\" For me, personally, that's the short path to the psych ward. Others seem to get by with this attitude, except that it's really crummy for their spouses (who often become ex-spouses)</span><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\"> and their children and anyone else who needs them or tries to care about them. Not a good option.</span><br /><br style=\"background-color: white; color: #222222; font-family: roboto, arial, sans-serif; font-size: 13px; line-height: 18px;\" /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">I don't want to be alone. I need people. Clubs and casual friends and the internet are not enough. But being part of some kind of \"collective\" not only is humanly unhealthy, it also just covers up the loneliness. And there can be a lot missing even from the experience of being in dedicated Catholic groups that work together for the good of the Church. People can share an activity (even passionately) without sharing their lives. Passion for the cause can become a cover for not acknowledging the poverty of my person, for not sharing myself, for not loving and for not being honest about my own vulnerability, my own need to be loved.</span><br /><br style=\"background-color: white; color: #222222; font-family: roboto, arial, sans-serif; font-size: 13px; line-height: 18px;\" /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">I can even \"belong\" to a \"movement,\" and wear it like a badge, and conform myself to its external style, and do all the \"stuff,\" and still not invest <i>myself.</i> I can cover up the fact that I'm poor and that I need God. I can hide it from others, and from myself. I can choose mere conformity over the struggle to live with others heart-to-heart. It's so much easier than the risk of exposing my suffering to myself and others, and then suffering even more as I discover that they don't fully understand me and <i>they can't fix me.</i></span><br /><br style=\"background-color: white; color: #222222; font-family: roboto, arial, sans-serif; font-size: 13px; line-height: 18px;\" /><table cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"float: right; margin-left: 1em; text-align: right;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://4.bp.blogspot.com/-S0ZVFUvJ1-8/WxFz5wv-UkI/AAAAAAABDKI/e7R9ZU_wBZYyAPNfua4wbHWbFqU_ZtFdwCLcBGAs/s1600/a136d.jpg\" imageanchor=\"1\" style=\"clear: right; margin-bottom: 1em; margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"1368\" data-original-width=\"924\" height=\"400\" src=\"https://4.bp.blogspot.com/-S0ZVFUvJ1-8/WxFz5wv-UkI/AAAAAAABDKI/e7R9ZU_wBZYyAPNfua4wbHWbFqU_ZtFdwCLcBGAs/s400/a136d.jpg\" width=\"270\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Portrait of the Artist as a Proud Man</td></tr></tbody></table><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">It's also true that I don't want people meddling in my life. I don't want to let them see my faults and then tell me what they think \"I have to do.\" That's because I lack humility, first of all. I mean, let's be real here. I'm a proud man and I don't know how to be humble. I don't like being corrected by anyone else, even (especially!) when their corrections are spot on.</span><br /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\"><br /></span><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">I'm proud, therefore I'm afraid.</span><br /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\"><br /></span><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">But there is another reason for this fear that I have. So often in life, my experience has been that people come along, stand on their platform, rebuke me, <i>and then they <b>go away</b>!</i> It's as if they are saying, \"You don't really <i>belong</i> (and we won't really love you) until you correct these aspects of your personality, and you have to do that <i>all by yourself.</i> Then, after you've filled up all your own personal holes, <i>then</i> we will be with you and love you.\"</span><br /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\"><br /></span><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">I shouldn't be surprised by this, however, because I do the same thing to other people.</span><br /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\"><br /></span><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">We do this so much to one another. Precisely those of us who are most committed to the ideals of community and relationships and solidarity: <b><i>We do this</i>.</b> It happens in movements and committed Christian communities. It happens (too much) in \"Catholic\" marriages and \"Catholic\" families where we pride ourselves on our Catholic values, on how we \"do things right\" and how we are so different <i>from all those screwed up families and screwed up people <b>out there in the bad, bad world</b></i>.</span><br /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\"><br /></span><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">How different are we, really? We have an indissoluble marriage, a big family, a good Catholic community, or even an institution or movement \"that has been praised by the Pope.\" But how do we live? Do we <i>live</i> as \"brothers and sisters,\" really? Or, rather, do we live our real lives <i>alone</i>. Then we come out to \"help\" one another every so often. Then we go back to our own inner shells, to being alone.</span><br /><span style=\"font-family: \"roboto\" , \"arial\" , sans-serif;\"><span style=\"font-size: 13px; line-height: 18px;\"><br /></span></span><span style=\"font-family: \"roboto\" , \"arial\" , sans-serif;\"><span style=\"font-size: 13px; line-height: 18px;\">Even when we are \"together,\" we can easily live this dialectic of loneliness and invasiveness, reducing our togetherness into a kind of violence and alienation. This happens insofar as we forget about Jesus, insofar as we forget about the Holy Spirit. This forgetfulness can happen even when there's lots of talk <i>about</i> Jesus and the Holy Spirit and the Church and the Eucharist and the sacraments and community and the dignity of the human person and all the rest. It's easy to \"domesticate\" these words into our vocabulary and forget about the mysterious, intimate, concrete realities they signify.</span></span><br /><span style=\"font-family: \"roboto\" , \"arial\" , sans-serif;\"><span style=\"font-size: 13px; line-height: 18px;\"><br /></span></span><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">I don't want to belong to a group of people who just correct my behavior and call me \"brother,\" but forget the real Jesus, and therefore don't really, actively love me. That's not the life of the Church. That's manipulation. That's the dynamic of a fundamentalist sect. It's just another form of power imposing itself upon the weak.</span><br /><span style=\"font-family: \"roboto\" , \"arial\" , sans-serif;\"><span style=\"font-size: 13px; line-height: 18px;\"><br /></span></span><span style=\"font-family: \"roboto\" , \"arial\" , sans-serif;\"><span style=\"font-size: 13px; line-height: 18px;\">Without Jesus emptying Himself on the cross out of love for sinners, for each one of us, for every human person, without Jesus and His love <i>to the end</i>... what are we? <b><i>Nothing!</i></b></span></span><br /><span style=\"font-family: \"roboto\" , \"arial\" , sans-serif;\"><span style=\"font-size: 13px; line-height: 18px;\"><br /></span></span><span style=\"font-family: \"roboto\" , \"arial\" , sans-serif;\"><span style=\"font-size: 13px; line-height: 18px;\">With Him, and depending completely on Him, trusting in Him, we really live the mystery of the Church. We are His presence in the world. This is our vocation, and this is what He wants so ardently, for us and for others, because He wants <i>to love</i>. What can I do except beg Jesus to make this happen in myself, my family, my friends, that the Holy Spirit will make this new life grow in me, change me, transform me, taking up all the weakness and the fear, opening up all the selfishness.</span></span><br /><span style=\"font-family: \"roboto\" , \"arial\" , sans-serif;\"><span style=\"font-size: 13px; line-height: 18px;\"><br /></span></span><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">When we talk about our relationships within the Church, we use these terms: \"brothers and sisters\" and \"members of a body.\" Why? Are we just being nice? Why these metaphors, or even better, are they<i> just metaphors</i>? The Church is our Mother. Baptism is a new birth. We are brothers and sisters and more, members of Christ's \"mystical\" body (and \"mystical\" means <i>real</i>, but in a mysterious way beyond our understanding). Thus incorporated into Christ's body, we are <i>members of one another</i>.</span><br /><br style=\"background-color: white; color: #222222; font-family: roboto, arial, sans-serif; font-size: 13px; line-height: 18px;\" /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">Is all this just \"<i>Christianspeak</i>\"? I hope not. Because this is what I want! I want brothers and sisters. I want a family. I want to belong to God, to call Him \"Father,\" and to have the freedom to be with others in my life and say, \"I am your brother\" and \"you are my brother, you are my sister.\"</span><br /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\"><br /></span><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">You--my brother, my sister--you help me just by the fact that we are together, you help me even when you fail or forget. We live our fidelity to Jesus and the whole of His Catholic Church <i>together</i>, on the daily level. We can help one another to deal with all the junk that comes along every day, and when we look at one another, we'll start to remember that because of Jesus all of this junk has value.</span><br /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\"><br /></span><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">And, if you think I'm being stupid about something, go ahead and tell me, because that's what brothers and sisters do. Of course you might be wrong, but if you think you see something that I'm missing about myself, you'll take the chance. I might get angry, but together we'll work it out (eventually, with patience) and we'll grow. We can look to our elders whose wisdom and example are a gift to us. We can forgive one another for having different personalities and therefore bumping against one another all the time, every day. Because we know we're a family and we're not going to go away and stop loving each other. We are together in Him. Jesus. We help one another to follow Him to the place where our hearts will all finally be at home.</span><br /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\"><br /></span><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">Is it possible to live this way? Is it possible to even begin to live this way? It must be possible, because this is the life that God wants to give us. The Christian vocation is to love every person, of course, but the vitality of that love comes from the unity, openness, and freedom that Jesus gives to Christians who love one another. Thus we are exhorted to</span><br /><blockquote class=\"tr_bq\"><span style=\"font-family: \"times\" , \"times new roman\" , serif;\"><b><i>\"Lead a life worthy of the calling to which you have been called, with all humility and gentleness, with patience, bearing with one another in love, making every effort to maintain the unity of the Spirit in the bond of peace. There is one body and one Spirit, just as you were called to the one hope of your calling, one Lord, one faith, one baptism, one God and Father of all, who is above all and through all and in all\" </i>(Ephesians 4:1-6).</b></span></blockquote><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">This is at the heart of Jesus's prayer for all his followers:</span><br /><blockquote class=\"tr_bq\"><span style=\"font-family: \"times\" , \"times new roman\" , serif;\"><b><i>\"...that they may all be one. As you, Father, are in me and I am in you, may they also be in us, so that the world may believe that you have sent me. The glory that you have given me I have given them, so that they may be one, as we are one, I in them and you in me, that they may become completely one, so that the world may know that you have sent me and have loved them even as you have loved me\" </i>(John 17:21-23)<i>.</i></b></span></blockquote><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">Is it possible to live this way, daily, together? It must be possible. It is, more than anything, what the world desperately needs from us. We can at least begin. We can begin to want it, desire it, ask for it. We can begin to live this way, and then begin again the next day, and every day.</span><br /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\"><br /></span><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">As for me, I run away from this life every day. It scares me to death (why is that?). But it's still what I really want. I beg for it. Jesus, I know that this is the only way to live <i>really</i>, to find myself, to walk the steps of each day, to attain my destiny.</span><br /><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\"><br /></span><span style=\"background-color: white; color: #222222; font-family: \"roboto\" , \"arial\" , sans-serif; font-size: 13px; line-height: 18px;\">Jesus, help me to begin again.</span></div>","tags":[],"publishedDate":"2018-06-02T16:28:00Z","harvestDate":"2018-06-02T21:22:20Z","estimatedPublishedDate":"2018-06-02T16:28:00Z","url":"http://ct.moreover.com/?a=34207102792&p=1u0&v=1&x=E_E4XeyEWPwratpCQZzvuQ","originalUrl":"http://www.johnjanaro.com/2018/06/human-relationships-living-as-brothers.html","commentsUrl":"http://www.blogger.com/comment.g?blogID=5399795247385186179&postID=4477800890881207793&isPopup=true","outboundUrls":["https://4.bp.blogspot.com/-ocNbvG28Heo/V1XPjGnIodI/AAAAAAAAzN4/2Ix7iv8kOY8T1QZtwTLbSJITm3my3j37gCLcB/s1600/zz11.jpg","https://4.bp.blogspot.com/-S0ZVFUvJ1-8/WxFz5wv-UkI/AAAAAAABDKI/e7R9ZU_wBZYyAPNfua4wbHWbFqU_ZtFdwCLcBGAs/s1600/a136d.jpg"],"wordCount":"2151","dataFormat":"text","duplicateGroupId":"34207102792","media":{"audio":[],"images":[{"url":"https://4.bp.blogspot.com/-ocNbvG28Heo/V1XPjGnIodI/AAAAAAAAzN4/2Ix7iv8kOY8T1QZtwTLbSJITm3my3j37gCLcB/s400/zz11.jpg"},{"url":"https://4.bp.blogspot.com/-S0ZVFUvJ1-8/WxFz5wv-UkI/AAAAAAABDKI/e7R9ZU_wBZYyAPNfua4wbHWbFqU_ZtFdwCLcBGAs/s400/a136d.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"John Janaro","publishingPlatform":{}},"licenses":[],"source":{"name":"Never Give Up","homeUrl":"http://www.johnjanaro.com/","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"281010481","name":"Never Give Up","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"An ordinary man engages the circumstances of daily life, seeking to draw closer to the Mystery who gives meaning to everything.","tags":["Jesus","Love","Family","God","Writing","Being Christian","Children","Saints","Mary","Faith","Marriage","Suffering","Benedict XVI","World","Mercy","Depression","Grace","Meaning of Life","Prayer","Beauty","Christmas","Church","America","Death","John Paul II","Pope","Human","Motherhood","Trust","History","War","Heart","N"],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990012}