{"sequenceId":"845363917913","id":"34207167846","language":"English","title":"TRUMP GIVES HOPE TO TERMINALLY ILL AMERICANS","content":"Trump Gives Hope To Terminally Ill Americans At 5 years old, Jordan McLinn had dreams of becoming a firefighter. Those hopes were dashed when he was diagnosed with a muscle-weakening disorder called Duchenne muscular dystrophy, or DMD. The condition proves fatal at around age 25, and most children are wheelchair-bound by 12. The Indiana boy’s dream was renewed when Pres. Donald J. Trump recently signed the “Right to Try Act” that opens the door for terminally ill Americans to gain access to potentially life-saving drugs stuck in FDA approval process. What Is The Right To Try Act? During the 2016 presidential campaign, Mr. Trump made a promise to help terminally ill patients get access to experimental or yet-to-be-approved drugs and treatments. He reiterated that same promise during his State of the Union speech. “Patients with terminal conditions should have access to experimental treatments that could potentially save their lives,” Pres. Trump said in January. “It is time for the Congress to give these wonderful Americans the ‘Right to Try.'” His signing the bill into law checks off another promise kept and provides a last hope for Americans fighting for their very lives. The Republican-led legislation was sponsored by Wisconsin Sen. Ron Johnson last August and finally cleared the U.S. House mostly along party lines (250-169) in late May. The president’s persistence appears to have broken the controversy and gridlock that prevented this long-overdue change to become a reality. Although states have varying regulations that provide limited access to unapproved treatments, the federal law opens new doors and unifies the nation under one policy. It also removes the burden of suffering Americans who travel to foreign lands for medications and treatments not available in the United States. In many ways, U.S. drug policy has unfairly impacted low-income families who could not afford to travel from country to country seeking a cure for their loved ones. This is what the new legislation does for desperate Americans: Allows terminally ill patients access to medications that cleared Phase 1 of the FDA’s evaluation process. These drugs are often in clinical trials but not available. Gives terminally ill people access to drugs years before they would clear the FDA hurdles. It protects people from dying while they wait for medications that are bogged down in the FDA bureaucracy. Allows your doctor to prescribe “investigational” drugs not yet approved by the FDA. Restores choice to everyday citizens, rather than have government regulations make life or death decisions for you. Enhances “compassionate use” exemptions for terminally ill patients. Only about 1,200 annually receive exemptions under the previous laws. Considering that new and emerging drugs and treatments are the final hope of people facing death, one would think the Right to Try Act would pass unanimously. It did not. Democrats Opposed Right To Try Act Despite the U.S. Senate passing the Right to Try Act by unanimous consent in 2017, House Democrats vehemently opposed the legislation. Changes were made in early March to add language that narrowed the scope to a “reasonable likelihood that death will occur within a matter of months” or “a disease or condition that would result in significant irreversible morbidity that is likely to lead to severely premature death.” Despite efforts to placate House Democrats, Minority Leader Nancy Pelosi pressed for another “resist” Trump obstruction, and the left took away the hope of dying Americans by voting the legislation down. A range of excuses surfaced that such laws empower snake oil salesmen pandering fake cures and false hope. New Jersey Rep. Frank Pallone resisted the legislation making such claims. Nothing could be further from the truth about Right To Try. From March until mid-May, the president renewed his campaign promise efforts with the help of patient advocacy groups such Freedom Partners and Americans for Prosperity. And, Indiana’s Jordan McLinn had become a significant face for the Right to Try movement. Led by the president, Republicans took Democrats to task. “Are Democrats really going to deny critically ill patients every opportunity to find treatment? This is state law in 38 states,” a senior Congressional Republican aide reportedly said. “Are they going to go against their own constituents?” Ranking House Democrat Rep. Pelosi hid behind special interests and a spokesperson before voting no. “Leader Pelosi will follow the lead of numerous patient and disease groups in opposing this legislation,” her spokesman Drew Hammill reportedly sated in an email. Fortunately for suffering Americans, Pres. Trump shamed enough Democrats to gain passage by a two-thirds vote in the House. Why Right To Try Act Matters With the young Jordan McLinn flanking him, Pres. Trump signed the measure into law and received a warm hug. The president presented the youngster with a commemorative signing pen as symbol that he and other ailing Americans have hope. These days, Jordan’s mother has identified a drug that is being developed that could stave off his condition. The boy has been named an honorary firefighter at two local fire houses where he helps out. “He’s still going to have muscle weakness, he’s not going to be in the NFL — that’s ok — but he’s going to have a longer life,” Mrs. McLinn said. ~ Conservative Zone http://www.conservativezone.com/articles/trump-gives-hope-to-terminally-ill-americans/","contentWithMarkup":"<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><h1 class=\"page-header-title\" style=\"background: rgb(255, 255, 255); border-bottom-color: rgb(0, 0, 0); border-bottom-style: solid; border-image: initial; border-left-color: initial; border-left-style: initial; border-right-color: initial; border-right-style: initial; border-top-color: initial; border-top-style: initial; border-width: 0px 0px 2px; box-sizing: border-box; color: #1e3666; font-family: Oswald, sans-serif; font-size: 28px; font-weight: 500; line-height: 1.1; margin: 20px 0px 10px; outline: 0px; padding: 0px; vertical-align: baseline; width: 787.5px;\">Trump Gives Hope To Terminally Ill Americans</h1><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"color: red; font-family: Verdana, sans-serif; font-size: large;\">At 5 years old, Jordan McLinn had dreams of becoming a firefighter. Those hopes were dashed when he was diagnosed with a muscle-weakening disorder called Duchenne muscular dystrophy, or DMD.</span></div><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; color: #424242; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"font-family: Verdana, sans-serif;\"><b>The condition proves fatal at around age 25, and most children are wheelchair-bound by 12.</b> The Indiana boy’s dream was renewed when Pres. Donald J. Trump recently signed the “Right to Try Act” that opens the door for terminally ill Americans to gain access to potentially life-saving drugs stuck in FDA approval process.</span></div><h3 style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; color: #424242; font-family: Oswald, sans-serif; font-size: 24px; line-height: 1.1; margin: 20px 0px 10px; outline: 0px; padding: 0px; vertical-align: baseline;\">What Is The Right To Try Act?</h3><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; color: #424242; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"font-family: Verdana, sans-serif;\"><b>During the 2016 presidential campaign, Mr. Trump made a promise to help terminally ill patients get access to experimental or yet-to-be-approved drugs and treatments. He reiterated that same promise during his State of the Union speech.</b></span></div><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; color: #424242; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"font-family: Verdana, sans-serif;\"><b>“Patients with terminal conditions should have access to experimental treatments that could potentially save their lives,” Pres. Trump said in January. “It is time for the Congress to give these wonderful Americans the ‘Right to Try.'”</b></span></div><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"color: red; font-family: Verdana, sans-serif;\"><b>His signing the bill into law checks off another promise kept and provides a last hope for Americans fighting for their very lives.</b> The Republican-led legislation was sponsored by Wisconsin Sen. Ron Johnson last August and finally cleared the U.S. House mostly along party lines (250-169) in late May.</span></div><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"color: red; font-family: Verdana, sans-serif;\"><b>The president’s persistence appears to have broken the controversy and gridlock that prevented this long-overdue change to become a reality. </b>Although states have varying regulations that provide limited access to unapproved treatments, the federal law opens new doors and unifies the nation under one policy. It also removes the burden of suffering Americans who travel to foreign lands for medications and treatments not available in the United States.</span></div><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"color: red; font-family: Verdana, sans-serif;\"><b>In many ways, U.S. drug policy has unfairly impacted low-income families who could not afford to travel from country to country seeking a cure for their loved ones. This is what the new legislation does for desperate Americans:</b></span></div><li style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; margin: 0px; outline: 0px; padding: 0px; vertical-align: baseline;\"><span style=\"color: blue; font-family: Verdana, sans-serif;\">Allows terminally ill patients access to medications that cleared Phase 1 of the FDA’s evaluation process. These drugs are often in clinical trials but not available.</span></li><li style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; margin: 0px; outline: 0px; padding: 0px; vertical-align: baseline;\"><span style=\"color: blue; font-family: Verdana, sans-serif;\">Gives terminally ill people access to drugs years before they would clear the FDA hurdles.</span></li><li style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; margin: 0px; outline: 0px; padding: 0px; vertical-align: baseline;\"><span style=\"color: blue; font-family: Verdana, sans-serif;\">It protects people from dying while they wait for medications that are bogged down in the FDA bureaucracy.</span></li><li style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; margin: 0px; outline: 0px; padding: 0px; vertical-align: baseline;\"><span style=\"color: blue; font-family: Verdana, sans-serif;\">Allows your doctor to prescribe “investigational” drugs not yet approved by the FDA.</span></li><li style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; margin: 0px; outline: 0px; padding: 0px; vertical-align: baseline;\"><span style=\"color: blue; font-family: Verdana, sans-serif;\">Restores choice to everyday citizens, rather than have government regulations make life or death decisions for you.</span></li><li style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; margin: 0px; outline: 0px; padding: 0px; vertical-align: baseline;\"><span style=\"color: blue; font-family: Verdana, sans-serif;\">Enhances “compassionate use” exemptions for terminally ill patients. Only about 1,200 annually receive exemptions under the previous laws.</span></li><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"color: blue; font-family: Verdana, sans-serif;\">Considering that new and emerging drugs and treatments are the final hope of people facing death, one would think the Right to Try Act would pass unanimously. It did not.</span></div><h3 style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; color: #424242; line-height: 1.1; margin: 20px 0px 10px; outline: 0px; padding: 0px; vertical-align: baseline;\"><span style=\"font-family: Verdana, sans-serif; font-size: large;\">Democrats Opposed Right To Try Act</span></h3><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; color: #424242; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"font-family: Verdana, sans-serif;\"><b>Despite the U.S. Senate passing the Right to Try Act by unanimous consent in 2017, House Democrats vehemently opposed the legislation. </b>Changes were made in early March to add language that narrowed the scope to a “reasonable likelihood that death will occur within a matter of months” or “a disease or condition that would result in significant irreversible morbidity that is likely to lead to severely premature death.”</span></div><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; color: #424242; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"font-family: Verdana, sans-serif;\"><b>Despite efforts to placate House Democrats, Minority Leader Nancy Pelosi pressed for another “resist” Trump obstruction, and the left took away the hope of dying Americans by voting the legislation down.</b> A range of excuses surfaced that such laws empower snake oil salesmen pandering fake cures and false hope. New Jersey Rep. Frank Pallone resisted the legislation making such claims. Nothing could be further from the truth about Right To Try.</span></div><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; color: #424242; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"font-family: Verdana, sans-serif;\"><b>From March until mid-May, the president renewed his campaign promise efforts with the help of patient advocacy groups such Freedom Partners and Americans for Prosperity.</b> And, Indiana’s Jordan McLinn had become a significant face for the Right to Try movement. Led by the president, Republicans took Democrats to task.</span></div><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"color: red; font-family: Verdana, sans-serif;\"><b>“Are Democrats really going to deny critically ill patients every opportunity to find treatment? This is state law in 38 states,” a senior Congressional Republican aide reportedly said. “Are they going to go against their own constituents?”</b></span></div><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"color: red; font-family: Verdana, sans-serif;\"><b>Ranking House Democrat Rep. Pelosi hid behind special interests and a spokesperson before voting no.</b></span></div><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"color: red; font-family: Verdana, sans-serif;\"><b>“Leader Pelosi will follow the lead of numerous patient and disease groups in opposing this legislation,” her spokesman Drew Hammill reportedly sated in an email.</b></span></div><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"color: red; font-family: Verdana, sans-serif;\"><b>Fortunately for suffering Americans, Pres. Trump shamed enough Democrats to gain passage by a two-thirds vote in the House.</b></span></div><h3 style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; color: #424242; font-family: Oswald, sans-serif; font-size: 24px; line-height: 1.1; margin: 20px 0px 10px; outline: 0px; padding: 0px; vertical-align: baseline;\">Why Right To Try Act Matters</h3><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; color: #424242; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"font-family: Verdana, sans-serif;\"><b>With the young Jordan McLinn flanking him, Pres. Trump signed the measure into law and received a warm hug. The president presented the youngster with a commemorative signing pen as symbol that he and other ailing Americans have hope.</b></span></div><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; color: #424242; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"font-family: Verdana, sans-serif;\"><b>These days, Jordan’s mother has identified a drug that is being developed that could stave off his condition.</b> The boy has been named an honorary firefighter at two local fire houses where he helps out.</span></div><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; color: #424242; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"font-family: Verdana, sans-serif;\"><b>“He’s still going to have muscle weakness, he’s not going to be in the NFL — that’s ok — but he’s going to have a longer life,” Mrs. McLinn said.</b></span></div><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; color: #424242; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"font-family: Verdana, sans-serif;\">~ Conservative Zone</span></div><div style=\"background: rgb(255, 255, 255); border: 0px; box-sizing: border-box; margin-bottom: 10px; outline: 0px; padding: 0px 0px 15px; vertical-align: baseline;\"><span style=\"color: #424242; font-family: Verdana, sans-serif;\">http://www.conservativezone.com/articles/trump-gives-hope-to-terminally-ill-americans/</span></div></div>","tags":[],"publishedDate":"2018-06-02T17:53:15Z","harvestDate":"2018-06-02T21:38:31Z","estimatedPublishedDate":"2018-06-02T17:53:15Z","url":"http://ct.moreover.com/?a=34207167846&p=1u0&v=1&x=0RxQbJx9yAgwkQ2mqtgnww","originalUrl":"http://calledbychristtobeone.blogspot.com/2018/06/trump-gives-hope-to-terminally-ill.html","commentsUrl":"http://calledbychristtobeone.blogspot.com/2018/06/trump-gives-hope-to-terminally-ill.html#comment-form","outboundUrls":["http://www.conservativezone.com/articles/trump-gives-hope-to-terminally-ill-americans/"],"wordCount":"853","dataFormat":"text","duplicateGroupId":"34207167846","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Tom Haeg","publishingPlatform":{}},"licenses":[],"source":{"name":"Called By Christ To Be ONE","homeUrl":"http://calledbychristtobeone.blogspot.com/","location":{},"feed":{"id":"162406771","name":"Called By Christ To Be ONE","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"Christ Jesus prayed that all those who would believe in Him would be ONE, just as He and the Father are ONE; that they be brought to complete unity so that the world would know that He was sent by the Father. (John 17:20-23)","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"7","autoRankOrder":"121620","inboundLinkCount":"1"},"inWhiteList":"true","autoTopics":[]}},"es_id":86992274}