{"sequenceId":"845363891916","id":"34207167189","language":"English","title":"Goodbye, Roseanne. It's for the Best.","content":"Share. Opinion: The ABC sitcom has been cancelled due to its star’s hateful rhetoric, but the new season never fulfilled its promise anyway. By Scott Collura Roseanne Barr, the racist, has gotten Roseanne, the revived hit ABC sitcom, cancelled after just one season back on the air. It’s a shame, as the original show is a classic and the premise of the new season had the potential to build on that legacy in a manner it was uniquely suited for. But considering how the show’s return panned out creatively during its nine-episode run this spring, and given its star’s outbursts in the real world, the series’ demise is for the best. (For more on what Roseanne tweeted, head here.) The fact that Barr -- and the writers behind the new season, which debuted to crazy-good ratings in March -- had chosen to make their eponymous character a Trump supporter brought all kinds of publicity to the show, positive, negative, and everywhere in between. But if there was ever a sitcom ideally positioned to depict the current climate of political and cultural division in the U.S., it was Roseanne. The cast of Season 10 of Roseanne When at its best back during its original run (which spanned from 1988 to 1997), Roseanne gave us a rare TV version of regular folks that didn’t pander or preach. The Conner family couldn’t get ahead and rarely caught a break; rather than facing typical sitcom shenanigans, they had ordinary problems just like many of the folks watching. (Example: It’s where I learned how to make a meatloaf on a budget -- add a lot of breadcrumbs!) Those earlier seasons offered an honest, funny and realistic look at life in Middle America that the new episodes only flirted with, and which rarely provided any honest answers that could be useful in today’s world. So while the idea of bringing back the show in 2018 for a tenth season sounded as risky as any of the other revivals of old favorites that are currently in vogue, the core premise that Roseanne would now be representative of the roughly half of American voters who put the current president in office sounded like the perfect set-up for the new season. What didn’t get as much buzz was that Roseanne’s sister, Laurie Metcalf’s Jackie, was a Hillary supporter and that the two were no longer on speaking terms due to the election. Unfortunately, Season 10 of Roseanne never fully took advantage of this ripe and topical conversation the way its previous incarnation would when it came to “real world” issues. While there would be a throwaway line here or there in the new season about the title character’s politics, the Roseanne/Jackie split was neatly resolved by the end of the first episode, with little to no fallout in the subsequent episodes. Contrast that with, say, the original show’s Becky/Mark storyline, as the Conners faced the ongoing challenges of the teen lovers' arc over multiple seasons. The new show didn’t have the stamina to stay on point on its big “ripped from the headlines” stories. Exit Theatre Mode Other attempts at topical issues often felt false or overly simplistic, as when Roseanne’s fear of her new Muslim neighbors quickly turned to her sticking up for them, or in the season-ending crisis that John Goodman’s patriarch Dan faces when “illegals,” as the show calls them, are outbidding him on construction jobs. Certainly the immigration debate -- and the consequences it has on U.S. workers who feel they’re losing jobs because of immigrants -- was a central issue in the 2016 presidential election. It’s serious and real. But Roseanne’s way of dealing with the situation was with a deus ex machina that saw the Conners’ town of Lanford, Illinois, getting hit by a big storm which results in the president declaring a state of emergency. Government funds will solve the Conners’ problems. Hooray! End Season 10. The problem is, life usually doesn’t work that way, so if Roseanne (Barr) and Roseanne (the show) wanted to truly grapple with “REAL ISSUES & REAL PEOPLE” as the star tweeted recently (while also promising to “challenge every sacred cow” in the USA next season), the unfortunate truth is that Season 10’s success rate of dealing with those topics was so-so at best. Indeed, where the new season excelled was in its interactions between the core cast and their exploration of how they got from where we left them in the late ’90s to now. (And no, that’s not including that awful lottery season that the show originally ended on, and which now feels like a premonition of how this tenth season finished things up -- probably for good this time). So yes, Season 10 of Roseanne definitely had its moments when it came to revisiting its beloved characters of old; on that level, it often felt like a return to the show that once worked so well. The Best and Worst TV Revivals 10+ IMAGES Fullscreen Image Artboard 3 Copy Artboard 3 ESC 01 17 Revival's the name of the game here and there've been quite a few of them these days. Not all of them good, but many of them great. Flip through the slideshow for a look at the best of the bunch (and a few of the worst). 01 17 Revival's the name of the game here and there've been quite a few of them these days. Not all of them good, but many of them great. Flip through the slideshow for a look at the best of the bunch (and a few of the worst). The Best and Worst TV Revivals Download Image Captions ESC But while the revival of Roseanne the show felt exciting to many of us fans of the original, the real-life Roseanne’s troubling public statements and conspiracy-theory mongering were equally problematic. You can debate Barr’s viewpoints until the (sacred) cows come home, but I had always hoped that the new show -- which is, after all, made by a variety of collaborative, creative voices -- would transcend her real-life rhetoric and shine a light on the America of 2018 just as the original series did in the ’90s. Unfortunately, it never really fulfilled that potential, and now Barr has seen to it that Roseanne doesn’t deserve another shot. Talk to Executive Editor Scott Collura on Twitter at @ScottCollura, where he's tweeting every shot from The Empire Strikes Back for some reason. Or listen to his Star Trek podcast, Transporter Room 3. Or do both!","contentWithMarkup":"Opinion: Roseanne has been cancelled due to its star’s hateful rhetoric, but the new season never fulfilled its promise anyway.","tags":[],"harvestDate":"2018-06-02T21:38:24Z","estimatedPublishedDate":"2018-06-02T21:38:24Z","url":"http://ct.moreover.com/?a=34207167189&p=1u0&v=1&x=Ks5JBID_EyRd7PkR8y2_6g","originalUrl":"http://www.ign.com/articles/2018/05/30/goodbye-roseanne-its-for-the-best","outboundUrls":["http://oyster.ignimgs.com/wordpress/stg.ign.com/2018/05/roseanne-cast.jpg","http://twitter.com/ScottCollura","http://transporterroom3.blogspot.com/2018/04/episode-134-cheers-from-enterprise-d.html"],"wordCount":"1061","dataFormat":"text","duplicateGroupId":"34174859831","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"publishingPlatform":{}},"licenses":[],"source":{"name":"IGN All","homeUrl":"http://www.ign.com/articles","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"375120611","name":"IGN All","mediaType":"Blog","generator":"http://pipes.yahoo.com/pipes/","description":"The latest IGN news, reviews and videos about video games, movies, TV, tech and comics","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"1","autoRankOrder":"320","inboundLinkCount":"15788"},"inWhiteList":"true","autoTopics":[]}},"es_id":86992235}