{"sequenceId":"845362240018","id":"34207112724","language":"English","title":"{allcanada} Streveler impresses as Bombers top Esks","content":"  Ebates.ca - Amazon.com - Amazon.ca - Wal-Mart - GameStop - Work From Home WINNIPEG — Chris Streveler wasn't thinking about how much his perfect passing game might propel him up the Blue Bombers' quarterback depth chart. Fighting for a backup spot behind starter Matt Nichols, the rookie completed all 10 passes he attempted, including an 80-yard touchdown strike to receiver Myles White, as Winnipeg defeated the Edmonton Eskimos 33-13 on Friday in CFL exhibition action. \"I don't know,\" Streveler, 23, said when asked if his performance helped his cause. \"I don't really think about that as much. It's a day-by-day process. This was just another small, little piece of everything that we've been doing. \"We've been practising for two weeks now, so to say that one game is going to make a tremendous leap for anybody, I don't know if that's the case. You just want to get better every single day and come and do your best and learn and compete.\" Streveler, who set 20 program records at the University of South Dakota, passed for 140 yards, finishing with one TD, no interceptions and a fumble. He also rushed four times for 37 yards. He's in a fight for the crucial backup spot behind Nichols, which suddenly became vacant when veteran quarterback Darian Durant retired in early May after signing with Winnipeg in the off-season. Nichols was impressed with Streveler's composure. Backup contender Alex Ross was 1 for 8 for eight yards. \"I think that (Streveler) did a great job going in there and just kind of taking command, taking control and showing that he can for sure play in this league,\" Nichols said. Bomber fans got a scare on the first play of the game, when Nichols was taken down hard on his first pass and appeared to be favouring an arm. He was briefly replaced by Ross. \"Just needed to get checked out real quick, make sure I was good to go,\" Nichols said. \"Obviously, a pre-season game, too, just want to make sure that everything's working.\" The series went two-and-out and turned worse when Eskimos running back Jordan Robinson took a Justin Medlock punt 98 yards for the TD at 1:48. Veteran receiver Adarius Bowman hung on to a 15-yard TD pass in the end zone from Nichols in his second go-round with the team to tie it 7-7. Bowman played his second and third years in the league (2009 and '10) with Winnipeg before moving to Edmonton. He returned to the Bombers as a free-agent signing this off-season. Edmonton left the majority of its starters at home, including quarterback Mike Reilly and running back C.J. Gable. Zach Kline and Danny O'Brien both had turns throwing the ball. \"The result wasn't what you want in any game, but there were a lot of hard fought plays out there and once we watch the film we'll be better for it,\" Edmonton head coach Jason Maas said. Winnipeg rookie running back Johnny Augustine ran 18 yards for another touchdown. White, who has a visor on his helmet that reflects blue under the lights, caught a long pass from Streveler and ran the rest of the way to give Winnipeg a 29-13 lead at 10:39 of the third quarter. Medlock was good on field goals from 38 and 45 yards, while rookie Felix Menard-Briere booted field goals from 25 and 43 yards out. Medlock connected on a pair of converts and Menard-Briere missed one in Winnipeg's first pre-season game in front of 23,034 fans at Investors Group Field. Edmonton kicker Sean Whyte made field goals from 46 and 51 yards, but went wide on a 37-yard attempt. He was good on one convert. The Eskimos also conceded a punt single. Entertainment Plaza - TV, Movies, Sports, Music, Soaps http://almosthuman99.com Babe Of The Month - Vote Now! http://almosthuman99.com/polls/babes/babeofthemonth.html Hunk Of The Month - Vote Now! http://almosthuman99.com/polls/hunks/hunkofthemonth.html","contentWithMarkup":"<DIV dir=ltr>  <DIV style=\"FONT-SIZE: 12pt; FONT-FAMILY: 'Arial'; COLOR: #000000\">  <DIV> </DIV>  <DIV style=\"FONT-SIZE: 12pt; FONT-FAMILY: 'Arial'; COLOR: #000000\"><A   href=\"http://www.ebates.ca/referrer?referrerid=nsAUjT4ALFQ%3D%0D%0A\"   target=_top><B>Ebates.ca</B></A> - <A   href=\"http://www.amazon.com/exec/obidos/redirect-home/almosthuman\"   target=_top><B>Amazon.com</B></A> - <A   href=\"http://www.amazon.ca/exec/obidos/redirect-home?site=amazon&tag=entertainm0cf-20\"   target=_top><B>Amazon.ca</B></A> - <A   href=\"http://linksynergy.walmart.com/fs-bin/click?id=FZTicMQOlrc&offerid=183959.10000020&type=3&subid=0\"   target=_top><B>Wal-Mart</B></A> - <A   href=\"http://click.linksynergy.com/fs-bin/click?id=FZTicMQOlrc&offerid=121938.10000068&type=3&subid=0\"   target=_top><B>GameStop</B></A> - <A   href=\"http://www.clickworker.com/become-a-clickworker?utm_source=551809&utm_campaign=CW4CW&utm_medium=email\"   target=_top><B>Work From Home</B></FONT></A><BR></DIV>  <DIV>  <P><FONT face=\"Times New Roman\">WINNIPEG — Chris Streveler wasn't thinking about   how much his perfect passing game might propel him up the Blue Bombers'   quarterback depth chart.</FONT></P>  <P><FONT face=\"Times New Roman\">Fighting for a backup spot behind starter Matt   Nichols, the rookie completed all 10 passes he attempted, including an 80-yard   touchdown strike to receiver Myles White, as Winnipeg defeated the Edmonton   Eskimos 33-13 on Friday in CFL exhibition action.</FONT></P>  <P><FONT face=\"Times New Roman\">\"I don't know,\" Streveler, 23, said when asked   if his performance helped his cause. \"I don't really think about that as much.   It's a day-by-day process. This was just another small, little piece of   everything that we've been doing.</FONT></P>  <P><FONT face=\"Times New Roman\">\"We've been practising for two weeks now, so to   say that one game is going to make a tremendous leap for anybody, I don't know   if that's the case. You just want to get better every single day and come and do   your best and learn and compete.\"</FONT></P>  <P><FONT face=\"Times New Roman\">Streveler, who set 20 program records at the   University of South Dakota, passed for 140 yards, finishing with one TD, no   interceptions and a fumble. He also rushed four times for 37 yards.</FONT></P>  <P><FONT face=\"Times New Roman\">He's in a fight for the crucial backup spot   behind Nichols, which suddenly became vacant when veteran quarterback Darian   Durant retired in early May after signing with Winnipeg in the   off-season.</FONT></P>  <P><FONT face=\"Times New Roman\">Nichols was impressed with Streveler's   composure. Backup contender Alex Ross was 1 for 8 for eight yards.</FONT></P>  <P><FONT face=\"Times New Roman\">\"I think that (Streveler) did a great job going   in there and just kind of taking command, taking control and showing that he can   for sure play in this league,\" Nichols said.</FONT></P>  <P><FONT face=\"Times New Roman\">Bomber fans got a scare on the first play of the   game, when Nichols was taken down hard on his first pass and appeared to be   favouring an arm. He was briefly replaced by Ross.</FONT></P>  <P><FONT face=\"Times New Roman\">\"Just needed to get checked out real quick, make   sure I was good to go,\" Nichols said. \"Obviously, a pre-season game, too, just   want to make sure that everything's working.\"</FONT></P>  <P><FONT face=\"Times New Roman\">The series went two-and-out and turned worse   when Eskimos running back Jordan Robinson took a Justin Medlock punt 98 yards   for the TD at 1:48.</FONT></P>  <P><FONT face=\"Times New Roman\">Veteran receiver Adarius Bowman hung on to a   15-yard TD pass in the end zone from Nichols in his second go-round with the   team to tie it 7-7.</FONT></P>  <P><FONT face=\"Times New Roman\">Bowman played his second and third years in the   league (2009 and '10) with Winnipeg before moving to Edmonton. He returned to   the Bombers as a free-agent signing this off-season.</FONT></P>  <P><FONT face=\"Times New Roman\">Edmonton left the majority of its starters at   home, including quarterback Mike Reilly and running back C.J. Gable. Zach Kline   and Danny O'Brien both had turns throwing the ball.</FONT></P>  <P><FONT face=\"Times New Roman\">\"The result wasn't what you want in any game,   but there were a lot of hard fought plays out there and once we watch the film   we'll be better for it,\" Edmonton head coach Jason Maas said.</FONT></P>  <P><FONT face=\"Times New Roman\">Winnipeg rookie running back Johnny Augustine   ran 18 yards for another touchdown. White, who has a visor on his helmet that   reflects blue under the lights, caught a long pass from Streveler and ran the   rest of the way to give Winnipeg a 29-13 lead at 10:39 of the third   quarter.</FONT></P>  <P><FONT face=\"Times New Roman\">Medlock was good on field goals from 38 and 45   yards, while rookie Felix Menard-Briere booted field goals from 25 and 43 yards   out. Medlock connected on a pair of converts and Menard-Briere missed one in   Winnipeg's first pre-season game in front of 23,034 fans at Investors Group   Field.</FONT></P>  <P><FONT face=\"Times New Roman\">Edmonton kicker Sean Whyte made field goals from   46 and 51 yards, but went wide on a 37-yard attempt. He was good on one convert.   The Eskimos also conceded a punt single.</FONT></P></DIV>  <DIV style=\"FONT-SIZE: 12pt; FONT-FAMILY: 'Arial'; COLOR: #000000\">  <P><B>Entertainment Plaza</B> - TV, Movies, Sports, Music, Soaps<BR><A   href=\"http://almosthuman99.com\">http://almosthuman99.com</A> </P>  <P><B>Babe Of The Month</B> - Vote Now!<BR><A   href=\"http://almosthuman99.com/polls/babes/babeofthemonth.html\">http://almosthuman99.com/polls/babes/babeofthemonth.html</A>     <P><B>Hunk Of The Month</B> - Vote Now!<BR><A   href=\"http://almosthuman99.com/polls/hunks/hunkofthemonth.html\">http://almosthuman99.com/polls/hunks/hunkofthemonth.html</A>   </P></DIV></DIV></DIV>","tags":[],"publishedDate":"2018-06-02T19:13:12Z","harvestDate":"2018-06-02T21:24:44Z","estimatedPublishedDate":"2018-06-02T19:13:12Z","url":"http://ct.moreover.com/?a=34207112724&p=1u0&v=1&x=aJIYSORuZAVTsdbUVnH6hQ","originalUrl":"http://newsonlinemusic.blogspot.com/2018/06/allcanada-streveler-impresses-as.html","commentsUrl":"http://newsonlinemusic.blogspot.com/2018/06/allcanada-streveler-impresses-as.html#comment-form","outboundUrls":["http://www.ebates.ca/referrer?referrerid=nsAUjT4ALFQ%3D%0D%0A","http://www.amazon.com/exec/obidos/redirect-home/almosthuman","http://www.amazon.ca/exec/obidos/redirect-home?site=amazon&tag=entertainm0cf-20","http://linksynergy.walmart.com/fs-bin/click?id=FZTicMQOlrc&offerid=183959.10000020&type=3&subid=0","http://click.linksynergy.com/fs-bin/click?id=FZTicMQOlrc&offerid=121938.10000068&type=3&subid=0","http://www.clickworker.com/become-a-clickworker?utm_source=551809&utm_campaign=CW4CW&utm_medium=email","http://almosthuman99.com/","http://almosthuman99.com/polls/babes/babeofthemonth.html","http://almosthuman99.com/polls/hunks/hunkofthemonth.html","http://almosthuman99.com"],"wordCount":"614","dataFormat":"text","duplicateGroupId":"34202168681","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"Amazon.com Inc","symbol":"AMZ","exchange":"STU","isin":"US0231351067","titleCount":0,"contentCount":1,"primary":true},{"name":"Amazon.com Inc","symbol":"AMZ","exchange":"BER","isin":"US0231351067","titleCount":0,"contentCount":1,"primary":true},{"name":"Amazon.com Inc","symbol":"AMZ","exchange":"DUS","isin":"US0231351067","titleCount":0,"contentCount":1,"primary":true},{"name":"Amazon.com Inc","symbol":"AMZ","exchange":"MUN","isin":"US0231351067","titleCount":0,"contentCount":1,"primary":true},{"name":"Amazon.com Inc","symbol":"AMZN","exchange":"NAS","isin":"US0231351067","titleCount":0,"contentCount":1,"primary":true},{"name":"Amazon.com Inc","symbol":"AMZ","exchange":"FRA","isin":"US0231351067","titleCount":0,"contentCount":1,"primary":true},{"name":"Amazon.com Inc","symbol":"AMZ","exchange":"HAM","isin":"US0231351067","titleCount":0,"contentCount":1,"primary":true},{"name":"Amazon.com Inc","symbol":"AMZN","exchange":"SWX","isin":"US0231351067","titleCount":0,"contentCount":1,"primary":true},{"name":"Amazon.com Inc","symbol":"AMZ","exchange":"ETR","isin":"US0231351067","titleCount":0,"contentCount":1,"primary":true},{"name":"Amazon.com Inc","symbol":"AMZO34","exchange":"BSP","isin":"BRAMZOBDR002","titleCount":0,"contentCount":1,"primary":true},{"name":"Amazon.com Inc","symbol":"AMZ N","exchange":"MEX","isin":"US0231351067","titleCount":0,"contentCount":1,"primary":true},{"name":"Amazon.com Inc","symbol":"AMZN","exchange":"LIM","isin":"US0231351067","titleCount":0,"contentCount":1,"primary":true},{"name":"Amazon.com Inc","symbol":"AMZN","exchange":"SGO","isin":"US0231351067","titleCount":0,"contentCount":1,"primary":true},{"name":"Amazon.com Inc","symbol":"AMZ","exchange":"HAN","isin":"US0231351067","titleCount":0,"contentCount":1,"primary":true},{"name":"Amazon.com Inc","symbol":"AMZN","exchange":"WBO","isin":"US0231351067","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"Cidinha","publishingPlatform":{}},"licenses":[],"source":{"name":"Music","homeUrl":"http://newsonlinemusic.blogspot.com/","location":{},"feed":{"id":"138863990","name":"Music","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":["ugc sport feeds","ugc arts feeds"]}},"es_id":86990408}