{"sequenceId":"845362053886","id":"34207105972","language":"English","title":"An Equal Rights Amendment In Virginia","content":"Listen Listening... / Copyright 2018 NPR. To see more, visit http://www.npr.org/. SCOTT SIMON, HOST: Illinois became the 37th state to ratify the Equal Rights Amendment this week. The ERA was overwhelmingly passed by Congress in 1972 - a guarantee that all rights apply to all citizens regardless of their sex. But the ERA needs to be ratified by three-quarters of the states to become part of the Constitution. It is now one state short. Virginia state Senator Scott Surovell would like his state to put the ERA over the top. The senator joins us now. Thanks very much for being with us. SCOTT SUROVELL: Great to be here, Scott. SIMON: I gather you grew up going to ERA rallies. SUROVELL: Yeah. My mother started taking me, actually, to both local and state meetings on the ERA back in the early 1970s when I was in a baby carriage. SIMON: Why isn't it passed? It's been a long time. SUROVELL: Well, it had a lot of momentum until, I guess, the 1980s. It was actually a part of the Republican Party platform and supported by Gerald Ford and President Nixon as well. But in the 1980s, it sort of became a lot more politicized than it had been, and efforts kind of stalled out. SIMON: What about in your state, 'cause I gather you've been trying this through several sessions? SUROVELL: Yeah. Actually, I got elected nine years ago. And about - I guess it was about six years ago - maybe five years ago, I started introducing this resolution every single session. And every year, we seem to come closer and closer. SIMON: Do you think there is added luster in the fact that Virginia could be the state to put the ERA over the top? SUROVELL: I don't think there's any question about that. There's been - at least some folks in the majority in the Virginia legislature have made noise that they think it's a dead amendment and that there's no point in ratifying it. But I think the fact that Nevada and now Illinois have ratified in the last 12 months show that there's national interest in this, and given that we're one state away, that there's definitely going to be some momentum next session. SIMON: Well, let me ask you about that - what could be more than a complication. Congress said three-quarters of the states had to ratify the ERA by 1982. As I don't have to tell you, that was a long time ago. So there are people who will say any vote in the Virginia legislature now would be symbolic. SUROVELL: There's a few different responses to that. No. 1 is that there's nothing in the Constitution which says that an amendment has to have a ratification deadline in it. So there is a question as to whether or not ratification deadlines are even valid. No court, I believe, has ever really looked at that issue. Additionally, the 27th Amendment, which was proposed by James Madison, was ratified, I think, about 202 years after it was proposed. And again, some people believe the ratification deadlines can be reopened or that Congress could simply just reopen it, and we could re-ratify or something. I mean, there's a lot of different ways, I think, you can get to home plate. But I think there is a path. SIMON: Senator, what's your, as they call them these days, elevator speech about the importance of passing the ERA now? SUROVELL: It's - I think it's important that we get this in our Constitution. Everybody has a mother. Most of us have a wife or a husband or a sister. I mean, I have three girls, and I believe that in order to fully provide them the protections that the government affords them, that gender needs to be in our Constitution to show that our society believes that people ought not to be discriminated on the basis of sex. SIMON: State Senator Scott Surovell of Virginia, thanks so much for being with us, Sir. SUROVELL: No problem. Thank you for calling in. Thanks for your interest in it. Transcript provided by NPR, Copyright NPR. TweetShareGoogle+Email","contentWithMarkup":"Copyright 2018 NPR. To see more, visit SCOTT SIMON, HOST: Illinois became the 37th state to ratify the Equal Rights Amendment this week. The ERA was overwhelmingly passed by Congress in 1972 - a guarantee that all rights apply to all citizens regardless of their sex. But the ERA needs to be...<div class=\"feedflare\">\n<a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=mpMWmjz6zJ4:qbDlNmsJIOE:I9og5sOYxJI\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?d=I9og5sOYxJI\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=mpMWmjz6zJ4:qbDlNmsJIOE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?d=qj6IDK7rITs\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=mpMWmjz6zJ4:qbDlNmsJIOE:F7zBnMyn0Lo\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?i=mpMWmjz6zJ4:qbDlNmsJIOE:F7zBnMyn0Lo\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?a=mpMWmjz6zJ4:qbDlNmsJIOE:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/GPBNewsFeed?d=yIl2AUoC8zA\" border=\"0\"></img></a>\n</div><img src=\"http://feeds.feedburner.com/~r/GPBNewsFeed/~4/mpMWmjz6zJ4\" height=\"1\" width=\"1\" alt=\"\"/>","tags":[],"publishedDate":"2018-06-02T12:28:00Z","harvestDate":"2018-06-02T21:22:58Z","estimatedPublishedDate":"2018-06-02T12:28:00Z","url":"http://ct.moreover.com/?a=34207105972&p=1u0&v=1&x=Nlphns694dZfarI2RubAEw","originalUrl":"http://gpbnews.org/post/equal-rights-amendment-virginia","outboundUrls":["https://ondemand.npr.org/npr-mp4/npr/wesat/2018/06/20180602_wesat_equal_rights_amendment.mp4?orgId=1&topicId=1014&d=197&p=7&story=616392722&ft=nprml&f=616392722","http://twitter.com/intent/tweet?url=http%3A%2F%2Fwww.tinyurl.com%2Fy7awm3h8&text=An%20Equal%20Rights%20Amendment%20In%20Virginia","http://facebook.com/sharer.php?u=http%3A%2F%2Fwww.tinyurl.com%2Fy7awm3h8&t=An%20Equal%20Rights%20Amendment%20In%20Virginia","https://plus.google.com/share?url=http%3A%2F%2Fwww.tinyurl.com%2Fy7awm3h8","http://www.npr.org/","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=mpMWmjz6zJ4:qbDlNmsJIOE:I9og5sOYxJI","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=mpMWmjz6zJ4:qbDlNmsJIOE:qj6IDK7rITs","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=mpMWmjz6zJ4:qbDlNmsJIOE:F7zBnMyn0Lo","http://feeds.feedburner.com/~ff/GPBNewsFeed?a=mpMWmjz6zJ4:qbDlNmsJIOE:yIl2AUoC8zA"],"wordCount":"684","dataFormat":"text","duplicateGroupId":"34200750444","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"No.1 Co Ltd","symbol":"3562","exchange":"TKS","isin":"JP3653590004","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"editor","publishingPlatform":{}},"licenses":[],"source":{"name":"GPB News Feed","homeUrl":"http://gpbnews.org","location":{},"feed":{"id":"186192773","name":"GPB News Feed","mediaType":"Blog","publishingPlatform":"NPR","generator":"NPR Digital Services RSS Generator 0.94","description":"Georgia Public Broadcasting gives you the latest statewide news, features, sights and sounds, all through our redesigned website at http://www.gpb.org/news!","tags":["News & Politics"],"imageUrl":"http://www.npr.org/images/stations/redesign/wjsp_fm.gif","copyright":"℗ & © 2010 Georgia Public Broadcasting","language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"27391","inboundLinkCount":"19"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990149}