{"sequenceId":"845362191526","id":"34207110966","language":"English","title":"The Virginia Zoo wants you to get fit with them this summer","content":"NORFOLK, Va. - A partnership with the Virginia Zoo and the YMCA of South Hampton Roads is allowing community members the opportunity to take a monthly fitness class at the zoo.  According to a release from the Virginia Zoo, the once a month classes will started on May 26 and will run until August 25. They are also for all ages.  \"The Y on Granby and the Blocker YMCA are excited to get people moving at the Virginia Zoo,” said Gina Adrover, Health and Wellness Director for the YMCA of South Hampton Roads. “Any type of movement is important to stay healthy in life, so we're offering a variety of group fitness classes, lead by certified instructors, for everyone to enjoy! We look forward to seeing familiar faces and some new ones, as we workout together surrounded by the unique environment of the Virginia Zoo,\" Adrover added.  The cost to attend the programs are free to all that are members of either the Virginia Zoo or of the YMCA of South Hampton Roads. General admission is the cost for those not members of either organization.  Program officials say that spots are limited for the classes, and that you can RSVP on the Virginia Zoo's website.   More information of the classes can be viewed here.  Schedule of events being held by the Virginia Zoo and YMCA of South Hampton Roads:  May 26: Mixxedfit 9-10 am  June 23: Adult & Family Yoga 9-10 am  July 28: High Intensity Interval Training & Kid Fit 9-10am  August 25: Zumba 9-10am  September 22: Zoo Tracks 10-11 am","contentWithMarkup":"NORFOLK, Va. - A partnership with the Virginia Zoo and the YMCA of South Hampton Roads is allowing community members the opportunity to take a monthly fitness class at the zoo.\n\nAccording to a release from the Virginia Zoo, the once a month classes will started on May 26 and will run until August 25. They are also for all ages.\n\n\"The Y on Granby and the Blocker YMCA are excited to get people moving at the Virginia Zoo,” said Gina Adrover, Health and Wellness Director for the YMCA of South Hampton Roads. “Any type of movement is important to stay healthy in life, so we're offering a variety of group fitness classes, lead by certified instructors, for everyone to enjoy! We look forward to seeing familiar faces and some new ones, as we workout together surrounded by the unique environment of the Virginia Zoo,\" Adrover added.\n\nThe cost to attend the programs are free to all that are members of either the Virginia Zoo or of the YMCA of South Hampton Roads. General admission is the cost for those not members of either organization.\n\nProgram officials say that spots are limited for the classes, and that you can RSVP on the Virginia Zoo's <a href=\"http://virginiazoo.org/\">website. </a>\n\nMore information of the classes can be viewed <a href=\"http://virginiazoo.org/events/\">here.</a>\n\n<em><strong>Schedule of events being held by the Virginia Zoo and YMCA of South Hampton Roads:</strong></em>\n\nMay 26: Mixxedfit 9-10 am\n\nJune 23: Adult & Family Yoga 9-10 am\n\n<span class=\"contextualExtensionHighlight ms-font-color-themePrimary ms-border-color-themePrimary ident_1632_1690\" role=\"button\">July 28: High Intensity Interval Training & Kid Fit 9-10am</span>\n\nAugust 25: Zumba 9-10am\n\nSeptember 22: Zoo Tracks 10-11 am","tags":["News","fitness classes","virginia zoo","YMCA of South Hampton Roads","Zoo"],"publishedDate":"2018-06-02T21:24:17Z","harvestDate":"2018-06-02T21:24:25Z","estimatedPublishedDate":"2018-06-02T21:24:17Z","url":"http://ct.moreover.com/?a=34207110966&p=1u0&v=1&x=eLYrYrvOurlWQm1zr3jlDA","originalUrl":"http://wtkr.com/2018/06/02/the-virginia-zoo-wants-you-to-get-fit-with-them-this-summer/","outboundUrls":["http://virginiazoo.org/","http://virginiazoo.org/events/"],"wordCount":"249","dataFormat":"text","duplicateGroupId":"34207110966","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"586907"},"adultLanguage":"false","topics":[{"name":"Hampton Roads news","group":"US regional"},{"name":"Nature news","group":"Science"}],"companies":[],"author":{"name":"Nick Boykin","publishingPlatform":{"userId":"127392172"}},"licenses":[],"source":{"name":"WTKR.com","homeUrl":"http://wtkr.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"249884135","name":"WTKR.com","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"29519738","generator":"http://wordpress.com/","description":"News from Hampton Roads and Northeast North Carolina","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"1","autoRankOrder":"1027","inboundLinkCount":"2392"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990337}