{"sequenceId":"845364024994","id":"34207170152","language":"English","title":"Celldex Presents Promising Data from Phase 1/2 Study of Varlilumab and Opdivo® at 2018 ASCO Annual Meeting","content":"-- CDX-3379 also featured in a “clinical trials in progress” presentation --   HAMPTON, N.J., June 02, 2018 (GLOBE NEWSWIRE) -- Celldex Therapeutics, Inc. (NASDAQ:CLDX) today presented two programs at the 2018 American Society of Clinical Oncology (ASCO) Annual Meeting in Chicago. Data from the Phase 1/2 study of Celldex's varlilumab, a CD27 targeting investigational immune-activating antibody, and Bristol-Myers Squibb's Opdivo® (nivolumab), an anti-PD1 immunotherapy, for patients with ovarian cancer and colorectal cancer, were presented in an oral session by Rachel E. Sanborn, M.D., Co-director of the Providence Thoracic Oncology Program and Phase 1 Clinical Trials Program, at the Earle A. Chiles Research Institute, Providence Cancer Institute, in Portland, Ore. In addition, an overview of the Phase 2 study of the anti-ErbB3 antibody CDX-3379 in combination with Erbitux® in advanced head and neck squamous cell cancer was presented in a “clinical trials in progress” poster session.   “The data presented today continue to support that varlilumab holds considerable potential as an immune activator,” said Dr. Sanborn. “This was particularly noteworthy in ovarian cancer where the combination with the anti-PD1 monoclonal antibody, Opdivo, turned “immune-cold” tumors “hot,” which in turn correlated with improved clinical outcomes, including improved response rate and progression-free survival in these patients.”   “Moving forward, we believe more work needs to be done to identify synergistic combinations and patient populations that have the best chance of responding to varlilumab treatment,” said Tibor Keler, Ph.D., Executive Vice President and Chief Scientific Officer of Celldex Therapeutics. “We are continuing to explore these opportunities through inclusion in our ongoing Phase 1 study of CDX-1140, our CD40 agonist antibody, and several investigator-initiated studies.”   “We also continue to enroll patients into our ongoing Phase 2 study of CDX-3379 in combination with Erbitux in patients with HPV negative, Erbitux-resistant, advanced head and neck squamous cell carcinoma. We look forward to completing enrollment to the first stage of this study in the third quarter of 2018 and are exploring other potential opportunities in indications where ErbB3 is believed to play a role,” concluded Dr. Keler.   ASCO Highlights   Varlilumab   Varlilumab was featured in an oral presentation that highlighted the ongoing Phase 2 study of varlilumab in combination with Opdivo. The Phase 1/2 study includes cohorts in ovarian cancer, colorectal cancer, head and neck squamous cell carcinoma, renal cell carcinoma and glioblastoma, with data from ovarian cancer (n=66) and colorectal cancer (n=42) patients included in the presentation today. The majority of patients enrolled in the study had baseline tumors that were mostly “cold” (PD-L1 negative or low, and low tumor-infiltrating lymphocyte [TIL] levels) with low expectation of responding to checkpoint inhibition therapy. The combination was well tolerated at all varlilumab dose levels tested.   Results in Ovarian Cancer Experience: n=66, 8 patients in Phase 1; 58 patients in Phase 2; median of three prior lines of therapy; 91% had Stage IV disease; 66% with PD-L1 negative tumors; multiple varlilumab dosing regimens evaluated. Detailed information by dosing cohort is included in the presentation and is available on the Celldex website.   Overall response rate: 14% (n=9) across 64 response-evaluable patients (7 confirmed, 2 unconfirmed)    Response rate by PD-L1 status:   PD-L1 positive: 20% (n=4 of 20; 3 confirmed, 1 unconfirmed)   PD-L1 negative: 14% (n=5 of 37; 4 confirmed, 1 unconfirmed)     Disease control rate (DCR), defined as best response of stable disease or better for greater than or equal to three months, was 38% (n=24 of 64). As of the cut-off for analysis, five patients continued on treatment.   For patients with tumor samples available, most patients experienced increases in tumor expression of PD-L1 (n=14 of 23; 61%) and CD8+ TIL levels (n=14 of 24; 58%). These increases were associated with improved clinical outcome, including improved progression-free survival (PFS) and response rate.                Median PFS (months)   Response Rate*   PD-L1 increase ≥5% (n=8)   PD-L1 increase <5% (n=15)   HR: 0.32; p=0.066   CD8 increase ≥5% (n=12)   CD8 increase <5% (n=12)   HR: 0.24; p=0.015   *Confirmed and unconfirmed   3 mg/kg dosing of varlilumab may have more clinical activity than other dosing regimens studied.   Results in Colorectal Cancer Experience: n=42; 21 patients in Phase 1; 21 patients in Phase 2; median of four prior lines of therapy; 100% had Stage IV disease; 87% had PD-L1 negative tumors; one patient was MSI-high and 21 patients were MSI-low/mismatch repair (MMR) proficient; MSI status for the remaining 20 patients was unknown.   One patient with PD-L1 negative, MSI-high disease experienced a confirmed partial response in the Phase 2 study portion and continues on treatment. Of note, a patient with PD-L1 negative disease, initially considered MMR proficient as determined by standard screening laboratory analysis, achieved a near complete response in the Phase 1 portion of the study, which now continues at 35 months. As part of this study, an additional molecular analysis was conducted on this patient’s tumor. The tumor had a high mutational burden and mutations in genes regulating DNA repair, which together likely contributed to the response. DCR was 20% (8/41).   CDX-3379   CDX-3379 was featured in a “clinical trials in progress” poster presentation, available on the Celldex website, that highlighted the ongoing Phase 2 study of CDX-3379, a human monoclonal antibody designed to block the activity of ErbB3 (HER3), in combination with Erbitux in patients with human papillomavirus (HPV) negative, Erbitux-resistant, advanced head and neck squamous cell carcinoma. The proposed mechanism of action for CDX-3379 sets it apart from other drugs in development in this class due to its ability to block both ligand-independent and ligand-dependent ErbB3 signaling by binding to a unique epitope. It has a favorable pharmacologic profile, including a longer half-life and slower clearance relative to other drug candidates in this class. The multicenter, open-label, Simon two-stage design study is expected to enroll approximately 27 patients (Stage 1=13; Stage 2=14). The primary objective of the study is objective response rate. Secondary objectives include assessments of clinical benefit response, duration of response, progression-free survival and overall survival, and safety and pharmacokinetics associated with the combination. Four clinical trial sites are currently open to enrollment, and Celldex is targeting to complete enrollment to the first stage of the study by the end of the third quarter of 2018. The Company continues to explore potential other opportunities in additional indications where ErbB3 is believed to play a role.   About Celldex Therapeutics, Inc.   Celldex is developing targeted therapeutics to address devastating diseases for which available treatments are inadequate. Our pipeline includes immunotherapies and other targeted biologics derived from a broad set of complementary technologies which have the ability to engage the human immune system and/or directly inhibit tumors to treat specific types of cancer or other diseases. Visit www.celldex.com.   Forward Looking Statement   This release contains \"forward-looking statements\" made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements are typically preceded by words such as \"believes,\" \"expects,\" \"anticipates,\" \"intends,\" \"will,\" \"may,\" \"should,\" or similar expressions. These forward-looking statements reflect management's current knowledge, assumptions, judgment and expectations regarding future performance or events. Although management believes that the expectations reflected in such statements are reasonable, they give no assurance that such expectations will prove to be correct or that those goals will be achieved, and you should be aware that actual results could differ materially from those contained in the forward-looking statements. Forward-looking statements are subject to a number of risks and uncertainties, including, but not limited to, our ability to successfully complete research and further development and commercialization of Company drug candidates; our ability to obtain additional capital to meet our long-term liquidity needs on acceptable terms, or at all, including the additional capital which will be necessary to complete the clinical trials that we have initiated or plan to initiate; our ability to realize the anticipated benefits from the acquisition of Kolltan and to operate the combined business efficiently; the uncertainties inherent in clinical testing and accruing patients for clinical trials; our limited experience in bringing programs through Phase 3 clinical trials; our ability to manage and successfully complete multiple clinical trials and the research and development efforts for our multiple products at varying stages of development; the availability, cost, delivery and quality of clinical and commercial grade materials produced by our own manufacturing facility or supplied by contract manufacturers, who may be our sole source of supply; the timing, cost and uncertainty of obtaining regulatory approvals; the failure of the market for the Company's programs to continue to develop; our ability to protect the Company's intellectual property; the loss of any executive officers or key personnel or consultants; competition; changes in the regulatory landscape or the imposition of regulations that affect the Company's products; and other factors listed under \"Risk Factors\" in our annual report on Form 10-K and quarterly reports on Form 10-Q.   All forward-looking statements are expressly qualified in their entirety by this cautionary notice. You are cautioned not to place undue reliance on any forward-looking statements, which speak only as of the date of this release. We have no obligation, and expressly disclaim any obligation, to update, revise or correct any of the forward-looking statements, whether as a result of new information, future events or otherwise.   Company Contact   Sarah Cavanaugh   Senior Vice President, Corporate Affairs & Administration   (781) 433-3161   Charles Liles   Associate Director, Investor Relations & Corp Communications","contentWithMarkup":"-- CDX-3379 also featured in a “clinical trials in progress” presentation --   HAMPTON, N.J., June 02, 2018 (GLOBE NEWSWIRE) -- Celldex Therapeutics, Inc. (NASDAQ:CLDX) today presented two programs at the 2018 American Society of Clinical Oncology (ASCO) Annual Meeting in Chicago. Data from the Phase 1/2 study of Celldex's varlilumab, a CD27 targeting investigational immune-activating antibody, and Bristol-Myers Squibb's Opdivo® (nivolumab), an anti-PD1 immunotherapy, for patients with ovarian cancer and colorectal cancer, were presented in an oral session by Rachel E. Sanborn, M.D., Co-director of the Providence Thoracic Oncology Program and Phase 1 Clinical Trials Program, at the Earle A. Chiles Research Institute, Providence Cancer Institute, in Portland, Ore. In addition, an overview of the Phase 2 study of the anti-ErbB3 antibody CDX-3379 in combination with Erbitux® in advanced head and neck squamous cell cancer was presented in a “clinical trials in progress” poster session.   “The data presented today continue to support that varlilumab holds considerable potential as an immune activator,” said Dr. Sanborn. “This was particularly noteworthy in ovarian cancer where the combination with the anti-PD1 monoclonal antibody, Opdivo, turned “immune-cold” tumors “hot,” which in turn correlated with improved clinical outcomes, including improved response rate and progression-free survival in these patients.”   “Moving forward, we believe more work needs to be done to identify synergistic combinations and patient populations that have the best chance of responding to varlilumab treatment,” said Tibor Keler, Ph.D., Executive Vice President and Chief Scientific Officer of Celldex Therapeutics. “We are continuing to explore these opportunities through inclusion in our ongoing Phase 1 study of CDX-1140, our CD40 agonist antibody, and several investigator-initiated studies.”   “We also continue to enroll patients into our ongoing Phase 2 study of CDX-3379 in combination with Erbitux in patients with HPV negative, Erbitux-resistant, advanced head and neck squamous cell carcinoma. We look forward to completing enrollment to the first stage of this study in the third quarter of 2018 and are exploring other potential opportunities in indications where ErbB3 is believed to play a role,” concluded Dr. Keler.   ASCO Highlights   Varlilumab   Varlilumab was featured in an oral presentation that highlighted the ongoing Phase 2 study of varlilumab in combination with Opdivo. The Phase 1/2 study includes cohorts in ovarian cancer, colorectal cancer, head and neck squamous cell carcinoma, renal cell carcinoma and glioblastoma, with data from ovarian cancer (n=66) and colorectal cancer (n=42) patients included in the presentation today. The majority of patients enrolled in the study had baseline tumors that were mostly “cold” (PD-L1 negative or low, and low tumor-infiltrating lymphocyte [TIL] levels) with low expectation of responding to checkpoint inhibition therapy. The combination was well tolerated at all varlilumab dose levels tested.   Results in Ovarian Cancer Experience: n=66, 8 patients in Phase 1; 58 patients in Phase 2; median of three prior lines of therapy; 91% had Stage IV disease; 66% with PD-L1 negative tumors; multiple varlilumab dosing regimens evaluated. Detailed information by dosing cohort is included in the presentation and is available on the Celldex website.   Overall response rate: 14% (n=9) across 64 response-evaluable patients (7 confirmed, 2 unconfirmed)    Response rate by PD-L1 status:   PD-L1 positive: 20% (n=4 of 20; 3 confirmed, 1 unconfirmed)   PD-L1 negative: 14% (n=5 of 37; 4 confirmed, 1 unconfirmed)     Disease control rate (DCR), defined as best response of stable disease or better for greater than or equal to three months, was 38% (n=24 of 64). As of the cut-off for analysis, five patients continued on treatment.   For patients with tumor samples available, most patients experienced increases in tumor expression of PD-L1 (n=14 of 23; 61%) and CD8+ TIL levels (n=14 of 24; 58%). These increases were associated with improved clinical outcome, including improved progression-free survival (PFS) and response rate.                Median PFS (months)   Response Rate*   PD-L1 increase ≥5% (n=8)   PD-L1 increase <5% (n=15)   HR: 0.32; p=0.066   CD8 increase ≥5% (n=12)   CD8 increase <5% (n=12)   HR: 0.24; p=0.015   *Confirmed and unconfirmed   3 mg/kg dosing of varlilumab may have more clinical activity than other dosing regimens studied.   Results in Colorectal Cancer Experience: n=42; 21 patients in Phase 1; 21 patients in Phase 2; median of four prior lines of therapy; 100% had Stage IV disease; 87% had PD-L1 negative tumors; one patient was MSI-high and 21 patients were MSI-low/mismatch repair (MMR) proficient; MSI status for the remaining 20 patients was unknown.   One patient with PD-L1 negative, MSI-high disease experienced a confirmed partial response in the Phase 2 study portion and continues on treatment. Of note, a patient with PD-L1 negative disease, initially considered MMR proficient as determined by standard screening laboratory analysis, achieved a near complete response in the Phase 1 portion of the study, which now continues at 35 months. As part of this study, an additional molecular analysis was conducted on this patient’s tumor. The tumor had a high mutational burden and mutations in genes regulating DNA repair, which together likely contributed to the response. DCR was 20% (8/41).   CDX-3379   CDX-3379 was featured in a “clinical trials in progress” poster presentation, available on the Celldex website, that highlighted the ongoing Phase 2 study of CDX-3379, a human monoclonal antibody designed to block the activity of ErbB3 (HER3), in combination with Erbitux in patients with human papillomavirus (HPV) negative, Erbitux-resistant, advanced head and neck squamous cell carcinoma. The proposed mechanism of action for CDX-3379 sets it apart from other drugs in development in this class due to its ability to block both ligand-independent and ligand-dependent ErbB3 signaling by binding to a unique epitope. It has a favorable pharmacologic profile, including a longer half-life and slower clearance relative to other drug candidates in this class. The multicenter, open-label, Simon two-stage design study is expected to enroll approximately 27 patients (Stage 1=13; Stage 2=14). The primary objective of the study is objective response rate. Secondary objectives include assessments of clinical benefit response, duration of response, progression-free survival and overall survival, and safety and pharmacokinetics associated with the combination. Four clinical trial sites are currently open to enrollment, and Celldex is targeting to complete enrollment to the first stage of the study by the end of the third quarter of 2018. The Company continues to explore potential other opportunities in additional indications where ErbB3 is believed to play a role.   About Celldex Therapeutics, Inc.   Celldex is developing targeted therapeutics to address devastating diseases for which available treatments are inadequate. Our pipeline includes immunotherapies and other targeted biologics derived from a broad set of complementary technologies which have the ability to engage the human immune system and/or directly inhibit tumors to treat specific types of cancer or other diseases. Visit www.celldex.com.   Forward Looking Statement   This release contains \"forward-looking statements\" made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements are typically preceded by words such as \"believes,\" \"expects,\" \"anticipates,\" \"intends,\" \"will,\" \"may,\" \"should,\" or similar expressions. These forward-looking statements reflect management's current knowledge, assumptions, judgment and expectations regarding future performance or events. Although management believes that the expectations reflected in such statements are reasonable, they give no assurance that such expectations will prove to be correct or that those goals will be achieved, and you should be aware that actual results could differ materially from those contained in the forward-looking statements. Forward-looking statements are subject to a number of risks and uncertainties, including, but not limited to, our ability to successfully complete research and further development and commercialization of Company drug candidates; our ability to obtain additional capital to meet our long-term liquidity needs on acceptable terms, or at all, including the additional capital which will be necessary to complete the clinical trials that we have initiated or plan to initiate; our ability to realize the anticipated benefits from the acquisition of Kolltan and to operate the combined business efficiently; the uncertainties inherent in clinical testing and accruing patients for clinical trials; our limited experience in bringing programs through Phase 3 clinical trials; our ability to manage and successfully complete multiple clinical trials and the research and development efforts for our multiple products at varying stages of development; the availability, cost, delivery and quality of clinical and commercial grade materials produced by our own manufacturing facility or supplied by contract manufacturers, who may be our sole source of supply; the timing, cost and uncertainty of obtaining regulatory approvals; the failure of the market for the Company's programs to continue to develop; our ability to protect the Company's intellectual property; the loss of any executive officers or key personnel or consultants; competition; changes in the regulatory landscape or the imposition of regulations that affect the Company's products; and other factors listed under \"Risk Factors\" in our annual report on Form 10-K and quarterly reports on Form 10-Q.   All forward-looking statements are expressly qualified in their entirety by this cautionary notice. You are cautioned not to place undue reliance on any forward-looking statements, which speak only as of the date of this release. We have no obligation, and expressly disclaim any obligation, to update, revise or correct any of the forward-looking statements, whether as a result of new information, future events or otherwise.   Company Contact   Sarah Cavanaugh   Senior Vice President, Corporate Affairs & Administration   (781) 433-3161   Charles Liles   Associate Director, Investor Relations & Corp Communications","tags":[],"harvestDate":"2018-06-02T21:38:54Z","estimatedPublishedDate":"2018-06-02T21:38:54Z","url":"http://ct.moreover.com/?a=34207170152&p=1u0&v=1&x=Aj35YusatFNYySKP8CmSNQ","originalUrl":"https://www.vbprofiles.com/press_releases/5b130d849490492bcdf2ffe3","outboundUrls":["https://www.globenewswire.com/Tracker?data=2l0svIm-uWxdMrKhpwMRKMISneuvzLVvMrwwfcWVsRE41XU8-mGIjFXSX5L0zFSvSLzUrbOrBc5-FgQsFkBkuH21lfEAxHCyccOmwX9b4yMUxxLwXQHAwHqpjQVNYdj2","https://www.globenewswire.com/Tracker?data=2l0svIm-uWxdMrKhpwMRKPYUyGI7JNDo-wAhkr5SJRTlRzzt7KIWWPeyxVwhNxTf3ExBWsv4i7rZ8E_B75xAtmyd1RSUZvhzC6kXKul7VlAuOLRpdKcqfM2YMzMplmNh","https://www.globenewswire.com/Tracker?data=DYlpH2Qql1__L2vp-dD-Pz4b762EpHTZ-YdGzOqey82Ntd5fFSE4dT0fZ2qyvreXHnQp6hGypu4P0CY6-tEePw==","https://www.globenewswire.com/Tracker?data=FFcQJbmNFUe1-7aCAiY4UPJJmmlg8c34Osh3MBaKuDCZ5Oh66sPPCsK00VsVD2Q9MHwWpPx3LAgN-nuVQ-OJtU9crFmAHatKJQZzv3V9RCk=","https://www.globenewswire.com/Tracker?data=NDAFJdOAMJDQ8THuULY1dQ2i-rqH_9I_RGMlP02BtvLEh_8phS9zDu4neB6QfHR-jbfkxDJQs8gKlH84mpaBnnMT0ttERK9JICrVEL5bmQA=","https://www.globenewswire.com/NewsRoom/AttachmentNg/6387bbce-eee1-473d-b267-935e48f5a27b"],"wordCount":"1463","dataFormat":"text","duplicateGroupId":"34206814240","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[{"name":"Celldex Therapeutics Inc","symbol":"TCE1","exchange":"FRA","isin":"US15117B1035","titleCount":0,"contentCount":3,"primary":true},{"name":"Celldex Therapeutics Inc","symbol":"CLDX","exchange":"NAS","isin":"US15117B1035","titleCount":0,"contentCount":3,"primary":true},{"name":"Celldex Therapeutics Inc","symbol":"TCE1","exchange":"MUN","isin":"US15117B1035","titleCount":0,"contentCount":3,"primary":true},{"name":"Celldex Therapeutics Inc","symbol":"TCE1","exchange":"STU","isin":"US15117B1035","titleCount":0,"contentCount":3,"primary":true},{"name":"Celldex Therapeutics Inc","symbol":"TCE1","exchange":"BER","isin":"US15117B1035","titleCount":0,"contentCount":3,"primary":true},{"name":"Bristol-Myers Squibb Company","symbol":"BRM","exchange":"BER","isin":"US1101221083","titleCount":0,"contentCount":1,"primary":false},{"name":"Bristol-Myers Squibb Company","symbol":"BRM","exchange":"DUS","isin":"US1101221083","titleCount":0,"contentCount":1,"primary":false},{"name":"Bristol-Myers Squibb Company","symbol":"BMY","exchange":"BUE","isin":"ARDEUT112877","titleCount":0,"contentCount":1,"primary":false},{"name":"Bristol-Myers Squibb Company","symbol":"BRM","exchange":"FRA","isin":"US1101221083","titleCount":0,"contentCount":1,"primary":false},{"name":"Bristol-Myers Squibb Company","symbol":"BRM","exchange":"HAM","isin":"US1101221083","titleCount":0,"contentCount":1,"primary":false},{"name":"Bristol-Myers Squibb Company","symbol":"BRM","exchange":"STU","isin":"US1101221083","titleCount":0,"contentCount":1,"primary":false},{"name":"Bristol-Myers Squibb Company","symbol":"BRM","exchange":"MUN","isin":"US1101221083","titleCount":0,"contentCount":1,"primary":false},{"name":"Bristol-Myers Squibb Company","symbol":"BMY","exchange":"MEX","isin":"US1101221083","titleCount":0,"contentCount":1,"primary":false},{"name":"Bristol-Myers Squibb Company","symbol":"BMYB34","exchange":"BSP","isin":"BRBMYBBDR000","titleCount":0,"contentCount":1,"primary":false},{"name":"Bristol-Myers Squibb Company","symbol":"BRM","exchange":"ETR","isin":"US1101221083","titleCount":0,"contentCount":1,"primary":false},{"name":"Bristol-Myers Squibb Company","symbol":"BMY","exchange":"SWX","isin":"US1101221083","titleCount":0,"contentCount":1,"primary":false},{"name":"Bristol-Myers Squibb Company","symbol":"BMY","exchange":"NYS","isin":"US1101221083","titleCount":0,"contentCount":1,"primary":false},{"name":"Bristol-Myers Squibb Company","symbol":"BMYMP","exchange":"PINX","isin":"US1101222073","titleCount":0,"contentCount":1,"primary":false}],"author":{"publishingPlatform":{}},"licenses":[{"name":"Publicly Available"}],"source":{"name":"Venture Beat Profiles","homeUrl":"http://www.venturebeatprofiles.com","category":"Press Wire","editorialRank":"4","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"169769573","name":"Venture Beat Profiles","mediaType":"News","tags":[],"language":"Unassigned","dataFormat":"text","rank":{"inboundLinkCount":"1"},"inWhiteList":"true","autoTopics":[],"editorialTopics":["Wires","Standard"],"genre":"Press Release"}},"es_id":86992315}