{"sequenceId":"845362182741","id":"34207110749","language":"English","title":"","content":"Genetic Intelligence Tests Are Next to Worthless (?) I take the title above from the title of a long and very readable article by Carl Zimmer, a NYT journalist.  You could almost predict the title from the fact that he is a NYT journalist. But the article is extremely well done.  It is something of a triumph of the journalist's art. He explains the facts and issues of his subject beautifully.  I wish I could write as well.  We both try for lucidity and simplicity but he does by far the better job. That he is a journalist and that I am an academic shows. I never could get teddy bears into my writing. The article is a long one so I am not even going to excerpt it.  Instead I am going  to offer what I hope is a fuller perspective on the matters he raises.  Put simply, he mistakes the major issue involved. When we look at his title, we have to ask: \"Worthless for What? His answer is that currently available genetic information is useless as a substitute for a normal IQ test.  He is absolutely right about that and his warning is well-taken.  People who claim to assess your IQ from your genetic profile are little better than quacks and their results are of no everyday use. And the reason for that is that IQ appears to be just one aspect of your body's general good functioning.  The brain is just one organ of the body and if the body overall is functioning well the brain should be working pretty well too. And from the research with IQ tests we find an amazing range of good things that high IQ correlates with -- better health, longer life more harmonious marriages etc.  You name it, more or less. So that lies behind the fact that there are a LOT of influences on your IQ. They may be scattered anywhere in your body.  What IQ researchers have said for a long time is that IQ is \"polygenetic\".  It is the sum of a whole lot of little genetic influences.  Almost anything that influences your overall health could also influences your IQ. At this stage I have to stress that I am talking about the \"in general\" case.  As elsewhere in life, there are exceptions to the general rule. There are healthy specimens who are as dumb as a brick (some Hollywood actors?) and there are other unfortunates such as Stephen Hawking and Carl Steinmetz where a brilliant brain inhabits a broken body.  Sometimes you need just one faulty gene to have a big influence on your bodily health. And it is the general case that interests scientists.  They are not actually much interested in YOU.  They are only interested in what emerges from a study of people in general. So when they find some of the many influences on IQ in people's genes they see themselves as being on the right track in seeing IQ as mainly genetic.  And the advances are already exciting.  As each new study comes out, more and more of the genetic influences on IQ are being found.  Genetics generally is in its infancy and the genetics of IQ are no exception. And so far there has not been a single study looking at epigenetic influences on IQ.  Epigenetics are bits of your genetic profile which influence how other genes work.  They can even turn a gene \"on\" or \"off\".  So to expect that current studies could give us the whole genetics of IQ is very naive.  The fact that we have at this early stage already been able to detect some of the genetics involved is the interesting and exciting part. In other words the issue is not whether or not we can measure your IQ from your genes right now but rather whether we are on the right track towards that.  And from a scientific point of view we are doing amazingly well considering the huge difficulty of such research.","contentWithMarkup":"<br /><br /><b>Genetic Intelligence Tests Are Next to Worthless (?)</b><br /><br />I take the title above from the title of a long and very readable article by Carl Zimmer, a NYT journalist.  You could almost predict the title from the fact that he is a NYT journalist.<br /><br />But the article is extremely well done.  It is something of a triumph of the journalist's art. He explains the facts and issues of his subject beautifully.  I wish I could write as well.  We both try for lucidity and simplicity but he does by far the better job. That he is a journalist and that I am an academic shows. I never could get teddy bears into my writing.<br /><br />The article is a long one so I am not even going to excerpt it.  Instead I am going  to offer what I hope is a fuller perspective on the matters he raises.  Put simply, he mistakes the major issue involved.<br /><br />When we look at his title, we have to ask: \"Worthless for What? His answer is that currently available genetic information is useless as a substitute for a normal IQ test.  He is absolutely right about that and his warning is well-taken.  People who claim to assess your IQ from your genetic profile are little better than quacks and their results are of no everyday use.<br /><br />And the reason for that is that IQ appears to be just one aspect of your body's general good functioning.  The brain is just one organ of the body and if the body overall is functioning well the brain should be working pretty well too. And from the research with IQ tests we find an amazing range of good things that high IQ correlates with -- better health, longer life more harmonious marriages etc.  You name it, more or less.<br /><br />So that lies behind the fact that there are a LOT of influences on your IQ. They may be scattered anywhere in your body.  What IQ researchers have said for a long time is that IQ is \"polygenetic\".  It is the sum of a whole lot of little genetic influences.  Almost anything that influences your overall health could also influences your IQ.<br /><br />At this stage I have to stress that I am talking about the \"in general\" case.  As elsewhere in life, there are exceptions to the general rule. There are healthy specimens who are as dumb as a brick (some Hollywood actors?) and there are other unfortunates such as Stephen Hawking and Carl Steinmetz where a brilliant brain inhabits a broken body.  Sometimes you need just one faulty gene to have a big influence on your bodily health.<br /><br />And it is the general case that interests scientists.  They are not actually much interested in YOU.  They are only interested in what emerges from a study of people in general. So when they find some of the many influences on IQ in people's genes they see themselves as being on the right track in seeing IQ as mainly genetic.  And the advances are already exciting.  As each new study comes out, more and more of the genetic influences on IQ are being found.  Genetics generally is in its infancy and the genetics of IQ are no exception.<br /><br />And so far there has not been a single study looking at epigenetic influences on IQ.  Epigenetics are bits of your genetic profile which influence how other genes work.  They can even turn a gene \"on\" or \"off\".  So to expect that current studies could give us the whole genetics of IQ is very naive.  The fact that we have at this early stage already been able to detect some of the genetics involved is the interesting and exciting part.<br /><br />In other words the issue is not whether or not we can measure your IQ from your genes right now but rather whether we are on the right track towards that.  And from a scientific point of view we are doing amazingly well considering the huge difficulty of such research.<br /><div><br /></div>","tags":[],"publishedDate":"2018-06-02T19:58:01Z","harvestDate":"2018-06-02T21:24:22Z","estimatedPublishedDate":"2018-06-02T19:58:01Z","url":"http://ct.moreover.com/?a=34207110749&p=1u0&v=1&x=Vs499if_e4AjvOKD6AUbhg","originalUrl":"http://awesternheart.blogspot.com/2018/06/genetic-intelligence-tests-are-next-to.html","commentsUrl":"http://awesternheart.blogspot.com/2018/06/genetic-intelligence-tests-are-next-to.html#comment-form","outboundUrls":[],"wordCount":"666","dataFormat":"text","duplicateGroupId":"34207110749","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"JR","publishingPlatform":{}},"licenses":[],"source":{"name":"THE PSYCHOLOGIST","homeUrl":"http://awesternheart.blogspot.com/","location":{"country":"Australia","countryCode":"AU","region":"Oceania","subregion":"Australia and New Zealand"},"feed":{"id":"83094110","name":"THE PSYCHOLOGIST","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"LIBERTARIAN/CONSERVATIVE DIGEST AND COMMENTARY FROM AN ACADEMIC PSYCHOLOGIST","tags":["Leftists","Britain","Fools","Kevin07","B. Hussein Obama","Islamism","Western World","Terrorism","Gun Control","Australian Politics","Moral Decay","Global Warming","Islam","Liberty","Taxes","American Politics","Evil","Justice Denied","Nanny State","Crime","Dhimmitude","Australia","Islamic Violence","H"],"language":"English","dataFormat":"text","rank":{"autoRank":"7","autoRankOrder":"121620","inboundLinkCount":"1"},"inWhiteList":"true","autoTopics":["ugc economics feeds","ugc science feeds"]}},"es_id":86990322}