{"sequenceId":"845365488565","id":"34207217891","language":"English","title":"'My fear is that my carers are going to come in one morning to find I've passed away in bed'","content":"A TERMINALLY ILL woman, who has been given less than six months to live by her doctors, has made an impassioned appeal to Health Minister Simon Harris for more time with her carers as her health deteriorates. Former nun Kate Tobin was diagnosed with primary progressive multiple sclerosis (PPMS) four years ago. Unlike other forms of multiple sclerosis, people who suffer from PPMS have no remission after the initial symptoms. In recent months Kate was also diagnosed with brittle bone disease. She suffered a fall while posting a birthday card and broke all the bones in her right ankle. The joint had to be entirely reconstructed with pins and plates. The day before she was due to have her plaster casts removed her leg gave way while she was moving from her wheelchair to a chair and she broke all the bones in her left leg. Following the latest incident doctors told the Waterford woman that she has between three and six months left to live. “The neurologist told me ‘Kate, you are crippled with brittle bone disease, even your ribs and your spine have it,’” she told TheJournal.ie. ‘Your battle with PPMS is coming to an end. If you get a chest infection or anything you won’t be able to make it through the winter.’ Kate worked as a palliative care nurse in the UK for more than a decade after she left the sisterhood. She lives in a specially adapted house in Clonroche, Co Wexford. The 52-year-old has carers in her home for 14 hours every week but is alone from lunchtime on Friday until lunchtime on Monday. “I have nobody. I can’t even give myself a wash or change my pyjamas,” she said. My fear is that my carers, or my neighbour, are going to come in one morning to find I’ve passed away in bed. Her standard hospital bed served her very well when she had greater mobility but now that she can’t turn she is very susceptible to pressure sores. Kate has previously campaigned for the right to die and she wears a bracelet at all times stating that she does not want to be resuscitated. She is appealing to the Department of Health for a greater allocation of carer hours to help her cope with her terminal illness. “I appealed to Simon Harris but he’s too busy appearing on TV for the referendum. He’s probably forgotten about me dying in Clonroche,” she said. Simon Harris may run the health service but he’s very much a television man. I was watching the referendum results for a few hours on Saturday. He kept appearing. I would’ve hoped I would have got a phone call that they’re sorting it out. I was petrified on my own at the weekend. TheJournal.ie contacted the Department of Health and the HSE about Kate’s case on Wednesday. They have yet to respond to the query.","contentWithMarkup":"52-year-old Kate Tobin suffers from multiple sclerosis and brittle bone disease.","tags":["Multiple Sclerosis"],"publishedDate":"2018-06-02T21:00:31Z","harvestDate":"2018-06-02T21:50:42Z","estimatedPublishedDate":"2018-06-02T21:00:31Z","url":"http://ct.moreover.com/?a=34207217891&p=1u0&v=1&x=iCwGrUQZoAZfpwQSnkGeYQ","originalUrl":"http://www.thejournal.ie/carer-ms-brittle-bone-disease-4041893-Jun2018/?utm_source=shortlink","commentsUrl":"http://www.thejournal.ie/carer-ms-brittle-bone-disease-4041893-Jun2018/#comments","outboundUrls":[],"wordCount":"483","dataFormat":"text","duplicateGroupId":"34207030287","media":{"audio":[],"images":[{"url":"http://c3.thejournal.ie/media/2018/05/kate-tobin-2-230x150.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"publishingPlatform":{}},"licenses":[],"source":{"name":"TheJournal.ie","homeUrl":"http://www.thejournal.ie/","location":{"country":"Ireland","countryCode":"IE","region":"Europe","subregion":"Northern Europe"},"feed":{"id":"155237192","name":"TheJournal.ie","mediaType":"Blog","publishingPlatform":"WordPress","generator":"http://wordpress.org/?v=3.0","description":"Ireland's Internet Newspaper","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"3","autoRankOrder":"9188","inboundLinkCount":"100"},"inWhiteList":"true","autoTopics":[]}},"es_id":86993720}