{"sequenceId":"845365770321","id":"34207222880","language":"English","title":"Me , My Self (Esteem) And I","content":"That's a fuckin snappy title eh? Half the reason I decided to write this was that for once I had a pure fuckin snappy as fuck title, but the other half of the reason is just to calm the fuck down a wee bit. Fuckin hell. Profanity laden intro's aren't how these things usually go, its so uncouth and unbecoming of the classier gentleman, but then again I'm not my usual self so this shit will be a bit all over the place, but I needed something down. Something tangible. For months I've wanted to write something in the vain hope that it'll help turn the tide back towards a state of mind that isn't irreparably fucked. Undermining everything good about me. Taking every bit of effort I've made to emerge from this current seemingly neverending depressive spell, wrapping it up in a big irrelevant ball, and rolling it down a hill while a backing track of you screaming \"I'm not fucking good enough!\" at yourself plays on a loop. Forever.  I'm a good person. This will improve and I'll be stronger for going through it. I'm a good person.   That's what you get taught at CBT (cognitive behavioural therapy btw) Every time the inner bully starts to take over, reason with it. Talk it down. Or something. It's all phrased in wee easy to remember chunks and I get why but sometimes when you're really fucking bad, and every time you close your eyes all you see is \"I hate myself\" in big neon letters, its hard to reason with this \"inner bully\" because its so incredibly ridiculous. How can I be a bully to myself? Did I walk up to myself, flick the glasses aff my own plooky face and call myself a fat fenian fuck? Anytime the inner bully starts its pish I do try but then the word \"bully\" starts bouncing around, and you see that guy that used to call you a fat wreck every time he seen you. Then you remember every other time you got called fat growing up, and how small that made you feel. Every time a throwaway comment made you retreat into your shell. Every time a stranger looked at you a bit funny when your mental health is bad and you keep going back to the same aisle in the supermarket only to completely forget why you went there in the first place, and the fact that you've been there 6 times in the past 15 minutes adding fuck all to a basket containing nothing but rapidly melting choc ices and a 15 pack of low quality ballpoint pens. Every time a stranger has looked at you funny...well at all. Whit ye lookin at strange person? I'm just err here livin'. Sometimes it just so....fast. Racing negativity. Supercharged depression. As if yer baw deep in a right good wii boxing session, only instead of rapid jabs coming at you its rapid self loathing thoughts. Walloped upside the napper by self hatred. Self doubting uppercut to the fuckin baws. A swirling vortex of \"awwww fuck here we go again......ahhhhhh\". A scaletric track in the mind but instead of wee motors whizzing about its wee guys in go-karts wae megaphones screamin \"fuck ye!\" into them. Constant. Unrelenting. Fuck.  I hate myself. So fuckin much.  It was around session three of this current batch of CBT sessions I realised this has been the root cause of most of my shit. I hate myself and I really don't know why. Always have. For a long time I hated myself so much I didn't even try. In any aspect of existence. I wasn't there. Remember very little of it apart from brief moments of respite up that pool hall with my best pal, some nice family things, all good things involving the Celtic and on occasion tasting a dessert that made me go a bit warm in the nether regions. Really aside from that I'd have been as well fuckin deid mate. One of the \"core 10\" you get asked every session is about if you've considered suicide at all since the last session and I always proudly jump to the \"not at all\" option. The only question I answer the same way consistently. Its never got to the stage where I seriously consider death. It would be lies to say death hasn't at times felt like the easier option on occasion during years of battling with this, but that's inevitable. If your own mind sooks the energy clean out your body on a daily basis, shutting it off at the source will naturally start looking like a decent option. Giving up to the point that you feel you don't even deserve the sweet release of death? That's something else entirely. I wrote a suicide note once about 10 years ago but even then I never thought I was serious about doing it, it just felt like the only way to stop the constant torrent of...everything.  I hate myself. I hate myself so fucking much. I don't belong anywhere.   2-3 years ago I finally felt at home with myself. It was surreal. Took a long time to even figure out what was happening to me when I had my first consistent spell of decent mental health in my adult life. It was all so new. Waking up hopeful. Waking up with drive. Waking up WITHOUT A CONSTANT VOICE IN YOUR HEAD ASKING YOU WHY THE FUCK YOU WOKE UP IN THE FIRST PLACE. Writing gave me that. A passion I'd long since gave up took central focus again and as much as I don't believe in fate or any other such cosmic nonsense, it was meant to happen. If I didn't re-discover my passion for writing, I dread to think where I'd be at this age. Or more accurately HOW I'd be at this age, because ye know whit man, I might no even be here. I wouldn't have met the partner who's kept me afloat at times when I didn't feel strong enough to do it myseld. That's probably why I'm so unbelievably scared of this current spell because as much as I never really thought I could get so bad that death would feel like the best option, there was only so far further down I could go. Losing her. Losing that support system because you're brain is imploding and telling you to push everyone away? Thats the fear. When you've given up so hard that you don't even see the point in trying to help yourself, what's left really? Apart from that? Pick an addiction and dedicate your life to making the lives of your loved ones that wee bit more difficult, or fuckin wipe yourself out and let them get on with it in peace. So when you go back down the way after a properly good spell, that fear is so real. Tangible. Like you could reach out, grab it, shove it between two bits of Warburtons toastie loaf, and huv a big greasy piece and THE FEAR.  I'm a good person. I am good to my family and friends. I am a good boyfriend. I will get through this.   The ratio of good days to bad right now is about 1 good day for every 4 bad ones. At my very best mental health wise before this, I dunno, I guess relapse? Is that the right word? Re-return? Re-breakdown? Who fuckin cares, point is, I'd maybe have one bad day every few weeks and I was so convinced it was just a blip by the next day there would barely be any sign of it. Really didn't appreciate how good that shit was until it was too late but convincing myself it will be reality again is at times the only way to bring any calm to this shit. Remembering that in very recent memory, I've had a situation where good days far outweigh the bad ones. I have to remember what got me to that place and do those things. Do them constantly. Do them till your eyes bleed. Write, go out, write more, each a lotta cheese and be ok with the fact that its gonnae make ye drop all sorts of deuces the next day, decide not to eat a lot of cheese and enjoy a morning without any hasty dashes to the toilet gently chanting \"oh fuck\" to yourself while holding the seat of your boxers as if that's somehow gonnae stop the torrent of rid hoat shite thats about to come out ye burning a hole through them. There's several more non cheese based reasons I was ok with myself for a while there, its just a struggle to remember them tbh. I feel so distant from that largely content human being. So distant I barely remember the cunt.  I'm a good person, I will get through this. But what if I don't?   What if I don't? Is running away from it going to help? It might. Even if 10-15 years of evidence supporting the fact that it doesn't actually help exists, who's to say it won't work this time? Being in counselling helps once every two weeks but in between I'm running away from it. Keeping myself distracted when I can, and even when I can't, vegetating. Episode after episode of a show I've seen so many times before. Naps. So many naps. Doing things purposefully designed to render the brain a monotonous pile of nothing. Never dealing with how I got so bad again. Dealing with things is fucking HARD. That's why for the most part people just don't. Its too hard and the world has so many distractions now that dealing with things can be delayed either until death or until you've pumped yourself full of so much shit you're fuck all more than a walking corpse.  You will get through this. You have before. You will again.   NAW I FUCKIN WULLNAE. Getting better before was just luck right. That's all it was. I didn't deserve the happiness then and I still don't now. I am nothing. Scum. Talent and prospect free. Ugly. A gallon of bin juice wrapped in a skin suit. A fucking perennial after thought. A failure as a boyfriend, a son, a friend, a writer, a retail employee, a human man. Its remarkable I've even made it to this stage without someone becoming so disgusted with my presence they hi-jack a double decker just to repeatedly run me over with it. I will not prevail. It WILL win this time and when it does, I won't just be as bad as I was in my late teens/early 20s, I'll be worse. Further depths of despair will reveal themselves, and I'll dive in heid first without giving it a second thought. I'll gamble compulsively again. Drink just to be comfortable being myself. Isolate myself. Let it all build up for months on end and put a hole in a door to alleviate the overwhelming stress. Fuck.  It'll turn round. You do NOT hate yourself.   Aye. I. Fuckin. Dae.  Why?  Challenge your inner bully. Laugh it off. Render it irrelevant with your laughter. Laugh some more. Ha Ha Ha. Laughing will make it better right? When I'm really bad sometimes I just laugh. Forced smiling and laughing releases endorphins and I dunno if me doing this is a result of reading this fact and it seeping into my subconscious but when I'm at my worst, sometimes I just laugh. Self pitying \"It can't get worse than this!\" fuckin nonsense laughter. When I first caught myself starting to do that again months back it filled me with incredible anxiety. As if I was watching a nice wee buddy-cop film that suddenly became fuck all but jump scares with a death metal cover of Penny Arcade playing in the background. Less than 2 years ago I was someone relatively comfortable with who and what I was, and now? I'm a guy that laughs at fuck all in order to gain just a wee bit of respite from the self hating shitshow that is my psyche. In the immortal words of Ronan Keating, life is a rollercoaster, just gotta ride itttttt (all night long)  Why do I hate myself?  Most of it stems from feeling like I haven't done enough. It always has. Something happened a year and a half or so ago and every day I wish I had done more. Thinking about it logically, there's no way I could have and it's too much to expect of myself, but illogically? I hate myself more and more every day. Constantly followed by the nagging self doubt. Making me hide from everything. Its all temporary fixes when its like this. Its all taking cover behind a desk, instead of standing up and firing a few shots back. Its bringing a blunt knife and some out of date anti depressants to a gun fight. Its useless. What worked before? Writing. Keeping out of my head. Reminding myself on paper. Why I'm a good person. What makes me good. Writing it down again. Reading it back. When loved ones tell you why THEY like you, believing them. Ignoring the voice that tells you they're lying. Why  would they lie? What does anyone you love have to gain from pretending they love you back? If you cant buy them shit, then the answer is nothing. If you can buy them shit? its probably all the shit you buy them tbh.  I hate myself right now. I hope one day I don't.  That's the truth. I really do. I still don't know why. I'm a good person. A solid contributor to a long term relationship that somehow continues to thrive despite the participants of it being, for the lack of a better term, aff their fuckin heids. A good son. A good brother. A good friend (brotherrrr). I treat people with respect. I give a fuck. This will not beat me. This will not get the better of me when I have so much good shit to be mentally healthy for. I've got a nephew to see grow up. A family to make proud by becoming a world famous author of books and such. Another half to travel the world with (somecunt gies like....aw the money). Pals to grope inappropriately whilst inordinately steamin at wrestling shows. There's so much living to do and it almost feels like its just starting for me after spending so much time in my adult life hiding from everything. So much to experience. Don't lose it all to misery. Keep fighting. Keep landing clean shots on its chin. You'll knock the cunt out eventually. You will get through this. You will.  But what if I don't?","contentWithMarkup":"That's a fuckin snappy title eh? Half the reason I decided to write this was that for once I had a pure fuckin snappy as fuck title, but the other half of the reason is just to calm the fuck down a wee bit. Fuckin hell. Profanity laden intro's aren't how these things usually go, its so uncouth and unbecoming of the classier gentleman, but then again I'm not my usual self so this shit will be a bit all over the place, but I needed something down. Something tangible. For months I've wanted to write something in the vain hope that it'll help turn the tide back towards a state of mind that isn't irreparably fucked. Undermining everything good about me. Taking every bit of effort I've made to emerge from this current seemingly neverending depressive spell, wrapping it up in a big irrelevant ball, and rolling it down a hill while a backing track of you screaming \"I'm not fucking good enough!\" at yourself plays on a loop. Forever.\n\n<strong><em>I'm a good person. This will improve and I'll be stronger for going through it. I'm a good person. </em></strong>\n\nThat's what you get taught at CBT (cognitive behavioural therapy btw) Every time the inner bully starts to take over, reason with it. Talk it down. Or something. It's all phrased in wee easy to remember chunks and I get why but sometimes when you're really fucking bad, and every time you close your eyes all you see is \"I hate myself\" in big neon letters, its hard to reason with this \"inner bully\" because its so incredibly ridiculous. How can I be a bully to myself? Did I walk up to myself, flick the glasses aff my own plooky face and call myself a fat fenian fuck? Anytime the inner bully starts its pish I do try but then the word \"bully\" starts bouncing around, and you see that guy that used to call you a fat wreck every time he seen you. Then you remember every other time you got called fat growing up, and how small that made you feel. Every time a throwaway comment made you retreat into your shell. Every time a stranger looked at you a bit funny when your mental health is bad and you keep going back to the same aisle in the supermarket only to completely forget why you went there in the first place, and the fact that you've been there 6 times in the past 15 minutes adding fuck all to a basket containing nothing but rapidly melting choc ices and a 15 pack of low quality ballpoint pens. Every time a stranger has looked at you funny...well at all. Whit ye lookin at strange person? I'm just err here livin'. Sometimes it just so....fast. Racing negativity. Supercharged depression. As if yer baw deep in a right good wii boxing session, only instead of rapid jabs coming at you its rapid self loathing thoughts. Walloped upside the napper by self hatred. Self doubting uppercut to the fuckin baws. A swirling vortex of \"awwww fuck here we go again......ahhhhhh\". A scaletric track in the mind but instead of wee motors whizzing about its wee guys in go-karts wae megaphones screamin \"fuck ye!\" into them. Constant. Unrelenting. Fuck.\n\n<strong><em>I hate myself. So fuckin much.</em></strong>\n\nIt was around session three of this current batch of CBT sessions I realised this has been the root cause of most of my shit. I hate myself and I really don't know why. Always have. For a long time I hated myself so much I didn't even try. In any aspect of existence. I wasn't there. Remember very little of it apart from brief moments of respite up that pool hall with my best pal, some nice family things, all good things involving the Celtic and on occasion tasting a dessert that made me go a bit warm in the nether regions. Really aside from that I'd have been as well fuckin deid mate. One of the \"core 10\" you get asked every session is about if you've considered suicide at all since the last session and I always proudly jump to the \"not at all\" option. The only question I answer the same way consistently. Its never got to the stage where I seriously consider death. It would be lies to say death hasn't at times felt like the easier option on occasion during years of battling with this, but that's inevitable. If your own mind sooks the energy clean out your body on a daily basis, shutting it off at the source will naturally start looking like a decent option. Giving up to the point that you feel you don't even deserve the sweet release of death? That's something else entirely. I wrote a suicide note once about 10 years ago but even then I never thought I was serious about doing it, it just felt like the only way to stop the constant torrent of...everything.\n\n<strong><em>I hate myself. I hate myself so fucking much. I don't belong anywhere. </em></strong>\n\n2-3 years ago I finally felt at home with myself. It was surreal. Took a long time to even figure out what was happening to me when I had my first consistent spell of decent mental health in my adult life. It was all so new. Waking up hopeful. Waking up with drive. Waking up WITHOUT A CONSTANT VOICE IN YOUR HEAD ASKING YOU WHY THE FUCK YOU WOKE UP IN THE FIRST PLACE. Writing gave me that. A passion I'd long since gave up took central focus again and as much as I don't believe in fate or any other such cosmic nonsense, it was meant to happen. If I didn't re-discover my passion for writing, I dread to think where I'd be at this age. Or more accurately HOW I'd be at this age, because ye know whit man, I might no even be here. I wouldn't have met the partner who's kept me afloat at times when I didn't feel strong enough to do it myseld. That's probably why I'm so unbelievably scared of this current spell because as much as I never really thought I could get so bad that death would feel like the best option, there was only so far further down I could go. Losing her. Losing that support system because you're brain is imploding and telling you to push everyone away? Thats the fear. When you've given up so hard that you don't even see the point in trying to help yourself, what's left really? Apart from that? Pick an addiction and dedicate your life to making the lives of your loved ones that wee bit more difficult, or fuckin wipe yourself out and let them get on with it in peace. So when you go back down the way after a properly good spell, that fear is so real. Tangible. Like you could reach out, grab it, shove it between two bits of Warburtons toastie loaf, and huv a big greasy piece and THE FEAR.\n\n<strong><em>I'm a good person. I am good to my family and friends. I am a good boyfriend. I will get through this. </em></strong>\n\nThe ratio of good days to bad right now is about 1 good day for every 4 bad ones. At my very best mental health wise before this, I dunno, I guess relapse? Is that the right word? Re-return? Re-breakdown? Who fuckin cares, point is, I'd maybe have one bad day every few weeks and I was so convinced it was just a blip by the next day there would barely be any sign of it. Really didn't appreciate how good that shit was until it was too late but convincing myself it will be reality again is at times the only way to bring any calm to this shit. Remembering that in very recent memory, I've had a situation where good days far outweigh the bad ones. I have to remember what got me to that place and do those things. Do them constantly. Do them till your eyes bleed. Write, go out, write more, each a lotta cheese and be ok with the fact that its gonnae make ye drop all sorts of deuces the next day, decide not to eat a lot of cheese and enjoy a morning without any hasty dashes to the toilet gently chanting \"oh fuck\" to yourself while holding the seat of your boxers as if that's somehow gonnae stop the torrent of rid hoat shite thats about to come out ye burning a hole through them. There's several more non cheese based reasons I was ok with myself for a while there, its just a struggle to remember them tbh. I feel so distant from that largely content human being. So distant I barely remember the cunt.\n\n<strong><em>I'm a good person, I will get through this. But what if I don't? </em></strong>\n\nWhat if I don't? Is running away from it going to help? It might. Even if 10-15 years of evidence supporting the fact that it doesn't actually help exists, who's to say it won't work this time? Being in counselling helps once every two weeks but in between I'm running away from it. Keeping myself distracted when I can, and even when I can't, vegetating. Episode after episode of a show I've seen so many times before. Naps. So many naps. Doing things purposefully designed to render the brain a monotonous pile of nothing. Never dealing with how I got so bad again. Dealing with things is fucking HARD. That's why for the most part people just don't. Its too hard and the world has so many distractions now that dealing with things can be delayed either until death or until you've pumped yourself full of so much shit you're fuck all more than a walking corpse.\n\n<strong><em>You will get through this. You have before. You will again. </em></strong>\n\nNAW I FUCKIN WULLNAE. Getting better before was just luck right. That's all it was. I didn't deserve the happiness then and I still don't now. I am nothing. Scum. Talent and prospect free. Ugly. A gallon of bin juice wrapped in a skin suit. A fucking perennial after thought. A failure as a boyfriend, a son, a friend, a writer, a retail employee, a human man. Its remarkable I've even made it to this stage without someone becoming so disgusted with my presence they hi-jack a double decker just to repeatedly run me over with it. I will not prevail. It WILL win this time and when it does, I won't just be as bad as I was in my late teens/early 20s, I'll be worse. Further depths of despair will reveal themselves, and I'll dive in heid first without giving it a second thought. I'll gamble compulsively again. Drink just to be comfortable being myself. Isolate myself. Let it all build up for months on end and put a hole in a door to alleviate the overwhelming stress. Fuck.\n\n<strong><em>It'll turn round. You do NOT hate yourself. </em></strong>\n\nAye. I. Fuckin. Dae.\n\n<strong><em>Why?</em></strong>\n\nChallenge your inner bully. Laugh it off. Render it irrelevant with your laughter. Laugh some more. Ha Ha Ha. Laughing will make it better right? When I'm really bad sometimes I just laugh. Forced smiling and laughing releases endorphins and I dunno if me doing this is a result of reading this fact and it seeping into my subconscious but when I'm at my worst, sometimes I just laugh. Self pitying \"It can't get worse than this!\" fuckin nonsense laughter. When I first caught myself starting to do that again months back it filled me with incredible anxiety. As if I was watching a nice wee buddy-cop film that suddenly became fuck all but jump scares with a death metal cover of Penny Arcade playing in the background. Less than 2 years ago I was someone relatively comfortable with who and what I was, and now? I'm a guy that laughs at fuck all in order to gain just a wee bit of respite from the self hating shitshow that is my psyche. In the immortal words of Ronan Keating, life is a rollercoaster, just gotta ride itttttt (all night long)\n\n<strong><em>Why do I hate myself?</em></strong>\n\nMost of it stems from feeling like I haven't done enough. It always has. Something happened a year and a half or so ago and every day I wish I had done more. Thinking about it logically, there's no way I could have and it's too much to expect of myself, but illogically? I hate myself more and more every day. Constantly followed by the nagging self doubt. Making me hide from everything. Its all temporary fixes when its like this. Its all taking cover behind a desk, instead of standing up and firing a few shots back. Its bringing a blunt knife and some out of date anti depressants to a gun fight. Its useless. What worked before? Writing. Keeping out of my head. Reminding myself on paper. Why I'm a good person. What makes me good. Writing it down again. Reading it back. When loved ones tell you why THEY like you, believing them. Ignoring the voice that tells you they're lying. Why  would they lie? What does anyone you love have to gain from pretending they love you back? If you cant buy them shit, then the answer is nothing. If you can buy them shit? its probably all the shit you buy them tbh.\n\n<strong><em>I hate myself right now. I hope one day I don't.</em></strong>\n\nThat's the truth. I really do. I still don't know why. I'm a good person. A solid contributor to a long term relationship that somehow continues to thrive despite the participants of it being, for the lack of a better term, aff their fuckin heids. A good son. A good brother. A good friend (brotherrrr). I treat people with respect. I give a fuck. This will not beat me. This will not get the better of me when I have so much good shit to be mentally healthy for. I've got a nephew to see grow up. A family to make proud by becoming a world famous author of books and such. Another half to travel the world with (somecunt gies like....aw the money). Pals to grope inappropriately whilst inordinately steamin at wrestling shows. There's so much living to do and it almost feels like its just starting for me after spending so much time in my adult life hiding from everything. So much to experience. Don't lose it all to misery. Keep fighting. Keep landing clean shots on its chin. You'll knock the cunt out eventually. You will get through this. You will.\n\n<em><strong>But what if I don't?</strong></em>","tags":[],"publishedDate":"2018-06-02T21:51:24Z","harvestDate":"2018-06-02T21:51:32Z","estimatedPublishedDate":"2018-06-02T21:51:24Z","url":"http://ct.moreover.com/?a=34207222880&p=1u0&v=1&x=V1I2VMik1JO5T2d0shihyQ","originalUrl":"https://deprestling.wordpress.com/2018/06/02/me-my-self-esteem-and-i/","outboundUrls":[],"wordCount":"2456","dataFormat":"text","duplicateGroupId":"34207222880","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"537"},"adultLanguage":"true","topics":[],"companies":[{"name":"Walking Co Holdings Inc","symbol":"WALKQ","exchange":"PINX","isin":"US9320361069","titleCount":0,"contentCount":1,"primary":true},{"name":"With Inc","symbol":"WWTH","exchange":"PINX","isin":"US9773991040","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"snapmarenecks","publishingPlatform":{"userId":"59853749"}},"licenses":[],"source":{"name":"A Mental Health Blog","homeUrl":"https://deprestling.wordpress.com","location":{},"feed":{"id":"495884367","name":"A Mental Health Blog","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"78529311","generator":"http://wordpress.com/","description":"A blog about mental illness and my experiences with it","tags":[],"language":"Unassigned","dataFormat":"text","rank":{"autoRank":"9","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86993791}