{"sequenceId":"845363727954","id":"34207160975","language":"English","title":"Down the Pipe & Natty Lite - Episode 5: Lindell Wigginton is BACK!!","content":"After declaring for the NBA draft process, Lindell Wigginton went through various workouts with a handful of NBA teams to get feedback on what they like and don't like about him, as well as what his draft status looks like heading into next season. On the deadline day for playerss to withdraw from the draft, Wigginton elected to return to Iowa State for his sophomore season. Levi, Cole, and Marchie all gave their thoughts on what his return could mean for the team's outlook next season.  Also, with the NBA Finals beginning, the guys took a look at the matchup between the two teams, and what their predictions were for the series (SPOILER ALERT: they all like Golden State). Does LeBron have enough help to overcome the obvious talent gap between the Cavs and Warriors? If LeBron leaves for Houston, how will it affect his legacy?","contentWithMarkup":"After declaring for the NBA draft process, Lindell Wigginton went through various workouts with a handful of NBA teams to get feedback on what they like and don't like about him, as well as what his draft status looks like heading into next season. On the deadline day for playerss to withdraw from the draft, Wigginton elected to return to Iowa State for his sophomore season. Levi, Cole, and Marchie all gave their thoughts on what his return could mean for the team's outlook next season.\n\nAlso, with the NBA Finals beginning, the guys took a look at the matchup between the two teams, and what their predictions were for the series (SPOILER ALERT: they all like Golden State). Does LeBron have enough help to overcome the obvious talent gap between the Cavs and Warriors? If LeBron leaves for Houston, how will it affect his legacy?","tags":["Sports"],"publishedDate":"2018-05-31T23:50:41Z","harvestDate":"2018-06-02T21:36:56Z","estimatedPublishedDate":"2018-05-31T23:50:41Z","url":"http://ct.moreover.com/?a=34207160975&p=1u0&v=1&x=kECpWss_xpskxD4_nJYpjg","originalUrl":"http://www.blogtalkradio.com/wrnl/2018/05/31/down-the-pipe-natty-lite--episode-5-lindell-wigginton-is-back","commentsUrl":"http://www.blogtalkradio.com/wrnl/2018/05/31/down-the-pipe-natty-lite--episode-5-lindell-wigginton-is-back/#comments","outboundUrls":[],"wordCount":"146","dataFormat":"text","duplicateGroupId":"34194036460","media":{"audio":[{"url":"http://www.blogtalkradio.com/wrnl/2018/05/31/down-the-pipe-natty-lite--episode-5-lindell-wigginton-is-back.mp3","mimeType":"audio/mpeg"}],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"publishingPlatform":{}},"licenses":[],"source":{"name":"Blog Talk Radio.com Networks","homeUrl":"http://www.blogtalkradio.com/","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"176165821","name":"Blog Talk Radio.com Networks","mediaType":"Blog","generator":"EZ Rss 0.1","description":"Most Recent Network Episodes on BlogTalkRadio.com . At BlogTalkRadio we offer the best in online entertainment  and have a show for every niche you can think of. If you find that we don't, consider it an opportunity for you  to be the first and make your","tags":[],"imageUrl":"http://www.blogtalkradio.com/img/btrbetalogo.gif","copyright":"BlogTalkRadio.com. All Rights Reserved.","language":"English","dataFormat":"Audio","rank":{"autoRank":"4","autoRankOrder":"17867","inboundLinkCount":"38"},"inWhiteList":"true","autoTopics":[]}},"es_id":86992040}