{"sequenceId":"845367340459","id":"34207263816","language":"English","title":"Hubby Deported but Cindy Garcia Refuses to Bash Trump","content":"A Michigan woman who watched as Immigration and Customs Enforcement (ICE) officers deported her illegal immigrant husband stunned CNN anchor Brooke Baldwin by refusing to bash President Donald Trump. Cindy Garcia’s story made national headlines in January when TV cameras captured her tearful goodbye to husband Jorge Garcia, who had lived in the United States for 30 years after his parents brought him here illegally at age 10. Garcia has not abandoned her efforts to bring her husband back to the United States, but on Tuesday she declined the invitation to blame Trump. \"I am not upset at the government, due to the fact that I am a U.S. citizen and that our laws come first,\" she said. \"Our laws are broken and need to be fixed. But I can't be mad at Trump for doing his job, because that is his job, to protect us, as U.S. citizens, from criminals.\" \"A lot of people would be critical of this administration,\" she said. \"I'm not hearing criticism from you.\" That is not to say that Garcia has given up trying to reverse the decision. She said her husband is not a criminal. \"We need to fix a pathway to citizenship for them,\" she said. Trump has called on Congress to give amnesty to people whose parents brought them illegally to the United States as children — but only if border security measures and reforms to the illegal immigration system are part of the package. Jorge Garcia, however, likely is too old to benefit from a legislative solution. Proposals have tended to focus on those illegal immigrants covered by the Deferred Action for Childhood Arrivals (DACA) program, which excludes people who were 31 or older on June 15, 2012. The Garcias tried in 2005 to fix Jorge's immigration status. The U.S. immigration appeals office rejected the family's bid in 2009. But then-President Barack Obama's administration agreed to defer his deportation as long as Jorge Garcia regularly checked in with ICE authorities, which he did. In November, however, ICE informed Garcia he would be detained unless he voluntarily returned to Mexico. Cindy Garcia told Baldwin she went to Mexico in April and spent 2½ months with her husband. She said he has lost about 30 pounds. \"We were glad to be able to go see him,\" she said. Garcia told Baldwin that she has gotten no indication from the government that the decision might be reconsidered. \"I have not had any news from the White House,\" she said. \"We are in the process of trying to get our appointment in Juárez to see what their decision is when we go.\" PoliZette senior writer Brendan Kirby can be reached at . Follow him on Twitter.cindy-garciacnnillegal-immigrationimmigrationjorge-garciapresident-donald-trump Source https://www.lifezette.com/polizette/hubby-deported-but-cindy-garcia-refuses-to-bash-trump/","contentWithMarkup":"<div><div><p>A Michigan woman who watched as Immigration and Customs Enforcement (ICE) officers deported her illegal immigrant husband stunned CNN anchor Brooke Baldwin by refusing to bash President Donald Trump.</p><p>Cindy Garcia’s story made national headlines in January when TV cameras captured her tearful goodbye to husband Jorge Garcia, who had lived in the United States for 30 years after his parents brought him here illegally at age 10.</p><p>Garcia has not abandoned her efforts to bring her husband back to the United States, but on Tuesday she declined the invitation to blame Trump.</p><p>\"I am not upset at the government, due to the fact that I am a U.S. citizen and that our laws come first,\" she said. \"Our laws are broken and need to be fixed. But I can't be mad at Trump for doing his job, because that is his job, to protect us, as U.S. citizens, from criminals.\"</p><p>\"A lot of people would be critical of this administration,\" she said. \"I'm not hearing criticism from you.\"</p><p>That is not to say that Garcia has given up trying to reverse the decision. She said her husband is not a criminal.</p><p>\"We need to fix a pathway to citizenship for them,\" she said.</p><p>Trump has called on Congress to give amnesty to people whose parents brought them illegally to the United States as children — but only if border security measures and reforms to the illegal immigration system are part of the package.</p><p>Jorge Garcia, however, likely is too old to benefit from a legislative solution. Proposals have tended to focus on those illegal immigrants covered by the Deferred Action for Childhood Arrivals (DACA) program, which excludes people who were 31 or older on June 15, 2012.</p><p>The Garcias tried in 2005 to fix Jorge's immigration status. The U.S. immigration appeals office rejected the family's bid in 2009. But then-President Barack Obama's administration agreed to defer his deportation as long as Jorge Garcia regularly checked in with ICE authorities, which he did.</p><p>In November, however, ICE informed Garcia he would be detained unless he voluntarily returned to Mexico.</p><p>Cindy Garcia told Baldwin she went to Mexico in April and spent 2½ months with her husband. She said he has lost about 30 pounds.</p><p>\"We were glad to be able to go see him,\" she said.</p><p>Garcia told Baldwin that she has gotten no indication from the government that the decision might be reconsidered.</p><p>\"I have not had any news from the White House,\" she said. \"We are in the process of trying to get our appointment in Juárez to see what their decision is when we go.\"</p><p><em>PoliZette senior writer Brendan Kirby can be reached at . Follow him on Twitter.</em></p><ol><li>cindy-garcia</li><li>cnn</li><li>illegal-immigration</li><li>immigration</li><li>jorge-garcia</li><li>president-donald-trump</li></ol></div></div><div><h4>Source</h4><p>https://www.lifezette.com/polizette/hubby-deported-but-cindy-garcia-refuses-to-bash-trump/</p></div>","tags":["Trending"],"publishedDate":"2018-06-02T22:00:19Z","harvestDate":"2018-06-02T22:00:26Z","estimatedPublishedDate":"2018-06-02T22:00:19Z","url":"http://ct.moreover.com/?a=34207263816&p=1u0&v=1&x=e_rG_m6VOUcVU-tJoE_csQ","originalUrl":"http://straylitemedia.com/2018/06/02/hubby-deported-but-cindy-garcia-refuses-to-bash-trump/","outboundUrls":["https://www.lifezette.com/polizette/hubby-deported-but-cindy-garcia-refuses-to-bash-trump/"],"wordCount":"443","dataFormat":"text","duplicateGroupId":"34178251999","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"33132"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Straylite","publishingPlatform":{"userId":"65724266"}},"licenses":[],"source":{"name":"Straylite Media","homeUrl":"http://straylitemedia.com","location":{},"feed":{"id":"562029658","name":"Straylite Media","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"68726527","generator":"http://wordpress.com/","description":"...on time, on trend & on fire","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"6","autoRankOrder":"58587","inboundLinkCount":"5"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994854}