{"sequenceId":"845367336473","id":"34207263731","language":"English","title":"Defined","content":"Palm Springs California 1:49 PM  June 2  2018  Defined.  One of the definitions of the word animals is \"a person whose behavior is regarded as devoid of human attributes or civilizing influences, especially someone who is very cruel, violent, or repulsive\". An adjective describing the same is \"characteristic of the physical and instinctive needs of animals; of the flesh rather than the spirit or intellect\". I am so disgusted by what not only my family has done to me but also what they along with the Crossings Church did to over one hundred twenty million innocent Americans I cannot get it out of mind. The murders of so many that happened in private, the murders of so many innocent gay men by my half brother in front of an audience full of movie stars but also my former friends and family but also the murders of innocent young boys by the Harmon family in front of the same audience is just the tip of the iceberg.  My niece and nephew were forced to watch my half brother Sean murder those men in New York City by their parents and my mother. They begged their parents and my mother to stop what they were being forced to watch but also almost daily to stop what was being done to me. My grandfather is in both of those children as much as he is in me and are now finally in protective custody and are likely being deprogrammed. My sister and brother in law put meth pipes in their children's mouths at the ages of ten and eleven and explained to them murder and theft were to be the way of the New World Order. The same was done to Bob Turzilli's niece and nephew who are also now in protective custody. Those are the only four children of anyone involved with the Crossings Church or the New World Order that will not be killed. My nephew will wear the coat I was passed to me by my grandfather and the Genovese family when I die.  Disorder.  From what have heard come out of the mouths of so many lunatics over the past few years I have learned of the secret plans of both Hillary and a few others. Germaine told her cannibal friends she was the wealthiest woman in the world and planned to kill Hillary and the rest and she planned to be the New World Order. Hillary told many she planned to kill George H.W. Bush and Dick Cheney so she could finally be boss and she intended to kill everyone on the planet with U.S. bombs and missiles.  Germaine blackmailed Hillary and Dick for one billion dollars which they did pay her for the taped telephone calls of theirs she had in her possession. I knew it was her who blackmailed her after her nephew blabbed on that network all about what Germaine had done. Why they did not kill her is beyond me. The United States New World Order would never have succeeded with or without me as they did nothing right in preparation for Martial Law day especially them enslaving not brainwashing the United States Military and most police nationwide.  I am not certain how stable the governments of nations worldwide will be in a few weeks when Donald Trump finally makes his speech on the news. However I am certain there will be no chaos and confusion among the half the population of the world that remains as the world will turn to the United States and Donald Trump for direction and solidification. Those not involved in the New World Order conspiracy who were to be killed by the New World Order include many of the best and the brightest and most civilized in every nation. If England wishes to put a new Royal family in place which has been only a symbolic Royal family for hundreds of years now they will. The French and the Japanese and the Australians and the Italians and the Mexicans will rebuild their governments how they see fit. Of course they will follow the lead of Donald Trump who was enslaved by Dick and Hillary then became President of the United States and did what he wanted not what they wanted as just after the presidential election of 2016 the CIA who had been spying on all of them put him into protective custody in plain sight just as they did me.  Utopia is an imagined community or society that possesses highly desirable or nearly perfect qualities for its citizens.The opposite of a utopia is a dystopia. One could also say that utopia is a perfect place that has been designed so there are no problems. As those enslaved will be the order of our new world hopefully a Utopian society will exist worldwide and finally there will be world peace with no fear of bombs or murders in the middle of the night or firing squads of innocent people for fun by Hillary and Dick. I have no doubt in my mind the Central Intelligence Agency will make the order of our new world a Utopian society.  Peace.  Scott T. Kemery","contentWithMarkup":"Palm Springs California 1:49 PM\n\nJune 2  2018\n\nDefined.\n\nOne of the definitions of the word animals is \"a person whose behavior is regarded as devoid of human attributes or civilizing influences, especially someone who is very cruel, violent, or repulsive\". An adjective describing the same is \"characteristic of the physical and instinctive needs of animals; of the flesh rather than the spirit or intellect\". I am so disgusted by what not only my family has done to me but also what they along with the Crossings Church did to over one hundred twenty million innocent Americans I cannot get it out of mind. The murders of so many that happened in private, the murders of so many innocent gay men by my half brother in front of an audience full of movie stars but also my former friends and family but also the murders of innocent young boys by the Harmon family in front of the same audience is just the tip of the iceberg.\n\nMy niece and nephew were forced to watch my half brother Sean murder those men in New York City by their parents and my mother. They begged their parents and my mother to stop what they were being forced to watch but also almost daily to stop what was being done to me. My grandfather is in both of those children as much as he is in me and are now finally in protective custody and are likely being deprogrammed. My sister and brother in law put meth pipes in their children's mouths at the ages of ten and eleven and explained to them murder and theft were to be the way of the New World Order. The same was done to Bob Turzilli's niece and nephew who are also now in protective custody. Those are the only four children of anyone involved with the Crossings Church or the New World Order that will not be killed. My nephew will wear the coat I was passed to me by my grandfather and the Genovese family when I die.\n\nDisorder.\n\nFrom what have heard come out of the mouths of so many lunatics over the past few years I have learned of the secret plans of both Hillary and a few others. Germaine told her cannibal friends she was the wealthiest woman in the world and planned to kill Hillary and the rest and she planned to be the New World Order. Hillary told many she planned to kill George H.W. Bush and Dick Cheney so she could finally be boss and she intended to kill everyone on the planet with U.S. bombs and missiles.\n\nGermaine blackmailed Hillary and Dick for one billion dollars which they did pay her for the taped telephone calls of theirs she had in her possession. I knew it was her who blackmailed her after her nephew blabbed on that network all about what Germaine had done. Why they did not kill her is beyond me. The United States New World Order would never have succeeded with or without me as they did nothing right in preparation for Martial Law day especially them enslaving not brainwashing the United States Military and most police nationwide.\n\nI am not certain how stable the governments of nations worldwide will be in a few weeks when Donald Trump finally makes his speech on the news. However I am certain there will be no chaos and confusion among the half the population of the world that remains as the world will turn to the United States and Donald Trump for direction and solidification. Those not involved in the New World Order conspiracy who were to be killed by the New World Order include many of the best and the brightest and most civilized in every nation. If England wishes to put a new Royal family in place which has been only a symbolic Royal family for hundreds of years now they will. The French and the Japanese and the Australians and the Italians and the Mexicans will rebuild their governments how they see fit. Of course they will follow the lead of Donald Trump who was enslaved by Dick and Hillary then became President of the United States and did what he wanted not what they wanted as just after the presidential election of 2016 the CIA who had been spying on all of them put him into protective custody in plain sight just as they did me.\n\nUtopia is an imagined community or society that possesses highly desirable or nearly perfect qualities for its citizens.The opposite of a utopia is a dystopia. One could also say that utopia is a perfect place that has been designed so there are no problems. As those enslaved will be the order of our new world hopefully a Utopian society will exist worldwide and finally there will be world peace with no fear of bombs or murders in the middle of the night or firing squads of innocent people for fun by Hillary and Dick. I have no doubt in my mind the Central Intelligence Agency will make the order of our new world a Utopian society.\n\nPeace.\n\nScott T. Kemery","tags":[],"publishedDate":"2018-06-02T22:00:19Z","harvestDate":"2018-06-02T22:00:24Z","estimatedPublishedDate":"2018-06-02T22:00:19Z","url":"http://ct.moreover.com/?a=34207263731&p=1u0&v=1&x=TY1lQGFJ-fBcCDbA9sgHeg","originalUrl":"https://stkemery.wordpress.com/2018/06/02/defined-2/","outboundUrls":[],"wordCount":"859","dataFormat":"text","duplicateGroupId":"34207263731","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"26663"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Scott T. Kemery","publishingPlatform":{"userId":"74999776"}},"licenses":[],"source":{"name":"stkemery","homeUrl":"https://stkemery.wordpress.com","location":{},"feed":{"id":"495666847","name":"stkemery","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"78622645","generator":"http://wordpress.com/","description":"What they did to me...","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"9","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":["ugc financial feeds"]}},"es_id":86994844}