{"sequenceId":"845361938616","id":"34207102790","language":"English","title":"Hospitality: Hosting Dialogue on Big Questions as a Form of Counter-Cultural Learning","content":"By Andrew DeCort, The Ethiopian Graduate School of Theology  Sometimes what we need to tackle big questions in the classroom is not simply more knowledge but a wider network of friends and warmer hospitality. For me at least, the instinct is to read a ton, prepare a compelling lecture, and then field questions from my students based on the question(s) I want to address.  But that is not always the most fruitful approach. Instead, I’d suggest inviting someone to come have a conversation with you and thus modeling for your students how to ask questions in a respectful and thoughtful manner, how to listen carefully and charitably, and how to follow up with fresh comments and questions that can extend the dialogue, enrich learning, and deepen relationship.  For example, last year I taught a new seminar at the Ethiopian Graduate School of Theology entitled “The Command of Neighbor-Love: History, Theology, and Ethics.” This course rather ambitiously poured over the biblical texts on neighbor love within their cultural contexts, then marched through major figures in the history of theology and philosophy, and finally addressed specific questions of practical relevance for neighbor-love in the Ethiopian context. One of these questions was how Islam approaches neighbor-love and whether Christians and Muslims can work together to promote a shared vision of neighbor-love for the common good in Ethiopia.  As I said above, my initial instinct was to read closely our assigned texts; to immerse myself in the Quran, Hadith, and other secondary sources on the topic; and to come to class with a dense lecture that would impress and challenge my students. Frankly, outpacing my students’ knowledge on this topic wouldn’t have been very difficult, and we could have easily had a safe and even stimulating class session on our questions.  But I decided against this, and I invited my friend Abduletif Khedir, a lecturer in Human Rights at Addis Ababa University and a devout Muslim, to visit my class for that session. In truth, I was unsure how this was going to work. To my knowledge, my Christian institution had never invited a Muslim into the classroom, and the session was three hours long, so there was plenty of room for misunderstanding or awkwardness. But this turned into one of the, if not simply the, most energizing and thought-provoking sessions of the entire semester.  First, I gave a very brief introduction on the ethics of listening to others based on Dietrich Bonhoeffer’s Life Together, what he calls “the first service” of loving our neighbor. Then I gave a very respectful introduction to my friend Abduletif, expressing my gratitude for his willingness to come to EGST and why he was qualified to educate us on this topic. Next, Abduletif and I had a focused but free-flowing dialogue for over an hour based on questions I had prepared in advance and the spontaneous back-and-forth that resulted. Here I was able to model for my students how to ask relevant and respectful questions, engaging sensitive topics (e.g., jihad and the Islamic State) without being offensive or arrogant. After a short break, the seminar resumed, and I opened the classroom for Q&A between the students and Abduletif, which lasted for well over another hour.  I was very pleased with the result. The students followed my lead in expressing gratitude and respectfulness to our guest. They also did a good job of formulating real questions that combined sensitivity with seriousness and importance. What followed was a warm, rich, and thought-provoking dialogue. Far from having too much time, we went over time because the students wanted to keep asking questions and learn more from our guest instructor/dialogue-partner.  Afterward, several of the students told me that they loved that session and that they had never talked with a Muslim at such length and in such depth about Scripture, faith, and ethics. This was striking to me, because approximately 35% of the Ethiopian population follows Islam, so meeting and talking with Muslims requires little effort. And yet my students told me that what we did in class was unprecedented for them and eye-opening.  Frankly, I think we all left the classroom with a sense of deep gratitude and awe, because our conversation partner modeled such kindness toward us and command of his tradition, offering nuanced and honest responses to our questions that left us feeling respect for his faith and rich possibility for further dialogue. Far from a dry lecture or an apologetic debate, that session truly was an energizing, mind-expanding conversation.  In fact, what I loved the most about this session was that it performatively embodied the topic we were dealing with: practicing neighbor-love beyond our Christian bubble with Muslims and trying to figure out how we can pursue the common good together. So rather than theory or sheer information, the students got to observe and then participate in the subject matter – to do it for themselves with a Muslim neighbor who is actively involved in our shared city.  Of course, I’m not suggesting that inviting a guest is the only good way to tackle big questions in the classroom. But I’ve found that it can be an especially fruitful way to break down barriers, stimulate deeper curiosity, and give your students an opportunity to practice the real dialogue that all big questions should generate.  In conclusion, let me mention a few practical tips that I think contributed to the success of this session.  First, I had organized a few previous dialogues with Abduletif when I brought my Wheaton College students to Ethiopia, so we already had a relationship and I was confident that he was comfortable with and skillful at conversation with passionate students. I was also confident in his expertise and capacity to communicate his knowledge of Islamic thought with fluency.  Knowing your dialogue partner before addressing sensitive and potentially controversial questions is important. If you haven’t already cultivated friendships with relevant dialogue partners for a big question you want to ask, this is a great opportunity to build bridges with other scholars and community leaders who can engage your classroom. I encourage you to think about people you know and/or potential contacts that you can start cultivating dialogue with now to avoid last-minute invitations and unnecessary blunders.  Second, I gave my students plenty of readings in advance of the session that laid the groundwork for the dialogue, challenged stereotypical assumptions, and stimulated a desire to learn more from our guest. Those readings – mostly from Muslims on neighbor-love rather than Christian interpretations of Muslims, which can be a temptation in confessional settings – gave fruitful reference points for the students to ask exegetical questions of the Quran and Hadith, as well as more immediate questions of practice and ethics today. Setting strong context for the dialogue is crucial.  Third, I did my homework and prepared about ten carefully formulated questions to ask Abduletif in front of my classroom for our live dialogue. Again, my primary goal here was to model for my students how to formulate compact, precise, important questions that were respectful and real rather than rhetorical or cornering. I’ve found that students can struggle to articulate what they actually want to ask and easily end up asking something else or confusing what they want to know. Thus, it’s valuable to model for students the thoughtfulness and care that goes into formulating clear, concise, crucial questions, including mentioning that these questions were actually prepared and written in advance rather than spontaneously generated by their teacher’s genius.  Asking questions well requires time and effort. At the beginning of the session, I invited my students to write down their questions and to work on them as they listened, so that when the open Q&A started, they would be focused and prepared. This worked well.  The capacity to ask questions – big and small – is essential to what makes us uniquely human. For all we know, we are the only species that can formulate questions, listen carefully to responses, and then change how we think and live based on this free flow of language (dia-logos). Given the ideological polarization of our age fueled by arrogance and insecurity, it would be easy to fabricate (pseudo)questions as tees off of which to hit home-runs with our answers for our students as passive consumers of information.  But what our students may need most from us is not our convincing answers but our courageous questions and our patient capacity to model the moral virtues of dialogue that make learning possible, worthwhile, and life-changing. Inviting a thoughtful, passionate dialogue partner into the classroom is one way to perform this counter-cultural practice. As one of my UChicago mentors, Professor Donald Levine, insisted, this is the very heart of education: “conversation about the meaning of life, as each sees some part of it, on behalf of everyone.”[1]  In many cases, this begins by extending hospitality toward others with different points of view, sharing honest conversation, and discovering that there is often far more that unites us than divides us.     P.S. If you’re interested in my class’s conversation with Abduletif Khedir, you can access a transcript of it entitled “Love Your Neighbor: A Christian-Muslim Dialogue on God, Jihad, and Neighbor-Love” on my Facebook here.  [1] Donald Levine, Wax and Gold: Tradition and Innovation in Ethiopian Culture (Chicago, IL: University of Chicago Press, 1965), xii.","contentWithMarkup":"By Andrew DeCort, <em>The Ethiopian Graduate School of Theology</em><a href=\"https://craftofteachingreligion.files.wordpress.com/2017/10/decort_3.jpg\"><img class=\" wp-image-1059 alignright\" src=\"https://craftofteachingreligion.files.wordpress.com/2017/10/decort_3.jpg?w=300\" alt=\"\" width=\"144\" height=\"104\" /></a>\n\nSometimes what we need to tackle big questions in the classroom is not simply more knowledge but a wider network of friends and warmer hospitality. For me at least, the instinct is to read a ton, prepare a compelling lecture, and then field questions from my students based on the question(s) I want to address.\n\nBut that is not always the most fruitful approach. Instead, I’d suggest inviting someone to come have a conversation with you and thus modeling for your students how to ask questions in a respectful and thoughtful manner, how to listen carefully and charitably, and how to follow up with fresh comments and questions that can extend the dialogue, enrich learning, and deepen relationship.\n\nFor example, last year I taught a new seminar at the Ethiopian Graduate School of Theology entitled “The Command of Neighbor-Love: History, Theology, and Ethics.” This course rather ambitiously poured over the biblical texts on neighbor love within their cultural contexts, then marched through major figures in the history of theology and philosophy, and finally addressed specific questions of practical relevance for neighbor-love in the Ethiopian context. One of these questions was how Islam approaches neighbor-love and whether Christians and Muslims can work together to promote a shared vision of neighbor-love for the common good in Ethiopia<em>.</em>\n\nAs I said above, my initial instinct was to read closely our assigned texts; to immerse myself in the Quran, Hadith, and other secondary sources on the topic; and to come to class with a dense lecture that would impress and challenge my students. Frankly, outpacing my students’ knowledge on this topic wouldn’t have been very difficult, and we could have easily had a safe and even stimulating class session on our questions.\n\nBut I decided against this, and I invited my friend Abduletif Khedir, a lecturer in Human Rights at Addis Ababa University and a devout Muslim, to visit my class for that session. In truth, I was unsure how this was going to work. To my knowledge, my Christian institution had never invited a Muslim into the classroom, and the session was three hours long, so there was plenty of room for misunderstanding or awkwardness. But this turned into one of the, if not simply <em>the</em>, most energizing and thought-provoking sessions of the entire semester.\n\nFirst, I gave a very brief introduction on the ethics of listening to others based on Dietrich Bonhoeffer’s <em>Life Together</em>, what he calls “the first service” of loving our neighbor. Then I gave a very respectful introduction to my friend Abduletif, expressing my gratitude for his willingness to come to EGST and why he was qualified to educate us on this topic. Next, Abduletif and I had a focused but free-flowing dialogue for over an hour based on questions I had prepared in advance and the spontaneous back-and-forth that resulted. Here I was able to model for my students how to ask relevant and respectful questions, engaging sensitive topics (e.g., jihad and the Islamic State) without being offensive or arrogant. After a short break, the seminar resumed, and I opened the classroom for Q&A between the students and Abduletif, which lasted for well over another hour.\n\nI was very pleased with the result. The students followed my lead in expressing gratitude and respectfulness to our guest. They also did a good job of formulating real questions that combined sensitivity with seriousness and importance. What followed was a warm, rich, and thought-provoking dialogue. Far from having too much time, we went over time because the students wanted to keep asking questions and learn more from our guest instructor/dialogue-partner.\n\nAfterward, several of the students told me that they loved that session and that they had never talked with a Muslim at such length and in such depth about Scripture, faith, and ethics. This was striking to me, because approximately 35% of the Ethiopian population follows Islam, so meeting and talking with Muslims requires little effort. And yet my students told me that what we did in class was unprecedented for them and eye-opening.\n\nFrankly, I think we all left the classroom with a sense of deep gratitude and awe, because our conversation partner modeled such kindness toward us and command of his tradition, offering nuanced and honest responses to our questions that left us feeling respect for his faith and rich possibility for further dialogue. Far from a dry lecture or an apologetic debate, that session truly was an energizing, mind-expanding conversation.\n\nIn fact, what I loved the most about this session was that it performatively embodied the topic we were dealing with: practicing neighbor-love beyond our Christian bubble with Muslims and trying to figure out how we can pursue the common good together. So rather than theory or sheer information, the students got to observe and then participate in the subject matter – to <em>do</em> it for themselves with a Muslim neighbor who is actively involved in our shared city.\n\nOf course, I’m not suggesting that inviting a guest is the only good way to tackle big questions in the classroom. But I’ve found that it can be an especially fruitful way to break down barriers, stimulate deeper curiosity, and give your students an opportunity to practice the real dialogue that all big questions should generate.\n\nIn conclusion, let me mention a few practical tips that I think contributed to the success of this session.\n\nFirst, I had organized a few previous dialogues with Abduletif when I brought my <a href=\"https://craftofteachingreligion.wordpress.com/2018/03/05/pilgrimage-an-ancient-model-for-transformative-theological-education/\">Wheaton College students to Ethiopia</a>, so we already had a relationship and I was confident that he was comfortable with and skillful at conversation with passionate students. I was also confident in his expertise and capacity to communicate his knowledge of Islamic thought with fluency.\n\nKnowing your dialogue partner before addressing sensitive and potentially controversial questions is important. If you haven’t already cultivated friendships with relevant dialogue partners for a big question you want to ask, this is a great opportunity to build bridges with other scholars and community leaders who can engage your classroom. I encourage you to think about people you know and/or potential contacts that you can start cultivating dialogue with now to avoid last-minute invitations and unnecessary blunders.\n\nSecond, I gave my students plenty of readings in advance of the session that laid the groundwork for the dialogue, challenged stereotypical assumptions, and stimulated a desire to learn more from our guest. Those readings – mostly from Muslims on neighbor-love rather than Christian interpretations of Muslims, which can be a temptation in confessional settings – gave fruitful reference points for the students to ask exegetical questions of the Quran and Hadith, as well as more immediate questions of practice and ethics today. Setting strong context for the dialogue is crucial.\n\nThird, I did my homework and prepared about ten carefully formulated questions to ask Abduletif in front of my classroom for our live dialogue. Again, my primary goal here was to model for my students how to formulate compact, precise, important questions that were respectful and real rather than rhetorical or cornering. I’ve found that students can struggle to articulate what they actually want to ask and easily end up asking something else or confusing what they want to know. Thus, it’s valuable to model for students the thoughtfulness and care that goes into formulating clear, concise, crucial questions, including mentioning that these questions were actually prepared and written in advance rather than spontaneously generated by their teacher’s genius.\n\nAsking questions well requires time and effort. At the beginning of the session, I invited my students to write down their questions and to work on them as they listened, so that when the open Q&A started, they would be focused and prepared. This worked well.\n\nThe capacity to ask questions – big and small – is essential to what makes us uniquely human. For all we know, we are the only species that can formulate questions, listen carefully to responses, and then change how we think and live based on this free flow of language (<em>dia</em>-<em>logos</em>). Given the ideological polarization of our age fueled by arrogance and insecurity, it would be easy to fabricate (pseudo)questions as tees off of which to hit home-runs with our answers for our students as passive consumers of information.\n\nBut what our students may need most from us is not our convincing answers but our courageous questions and our patient capacity to model the moral virtues of dialogue that make learning possible, worthwhile, and life-changing. Inviting a thoughtful, passionate dialogue partner into the classroom is one way to perform this counter-cultural practice. As one of my UChicago mentors, Professor Donald Levine, insisted, this is the very heart of education: “conversation about the meaning of life, as each sees some part of it, on behalf of everyone.”<a href=\"#_ftn1\" name=\"_ftnref\">[1]</a>\n\nIn many cases, this begins by extending hospitality toward others with different points of view, sharing honest conversation, and discovering that there is often far more that unites us than divides us.\n\n \n\nP.S. If you’re interested in my class’s conversation with Abduletif Khedir, you can access a transcript of it entitled “Love Your Neighbor: A Christian-Muslim Dialogue on God, Jihad, and Neighbor-Love” on my Facebook <a href=\"https://www.facebook.com/notes/andrew-decort/love-your-neighbor-a-christian-muslim-dialogue-on-god-jihad-and-neighbor-love/10154770797907702/\">here</a>.\n\n<a href=\"#_ftnref\" name=\"_ftn1\">[1]</a> Donald Levine, <em>Wax and Gold: Tradition and Innovation in Ethiopian Culture</em> (Chicago, IL: University of Chicago Press, 1965), xii.","tags":[],"publishedDate":"2018-06-02T21:22:14Z","harvestDate":"2018-06-02T21:22:20Z","estimatedPublishedDate":"2018-06-02T21:22:14Z","url":"http://ct.moreover.com/?a=34207102790&p=1u0&v=1&x=ZF7yBlYRTtKJJpOAZPq9aQ","originalUrl":"https://craftofteachingreligion.wordpress.com/2018/06/02/hospitality-hosting-dialogue-on-big-questions-as-a-form-of-counter-cultural-learning/","outboundUrls":["https://www.facebook.com/notes/andrew-decort/love-your-neighbor-a-christian-muslim-dialogue-on-god-jihad-and-neighbor-love/10154770797907702/"],"wordCount":"1551","dataFormat":"text","duplicateGroupId":"34207102790","media":{"audio":[],"images":[{"url":"https://craftofteachingreligion.files.wordpress.com/2017/10/decort_3.jpg?w=300"}],"video":[],"logo":[]},"publishingPlatform":{"itemId":"1190"},"adultLanguage":"false","topics":[],"companies":[{"name":"Free Flow Inc","symbol":"FFLO","exchange":"PINX","isin":"US35645U1007","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"craftofteachingreligion","publishingPlatform":{"userId":"73221804"}},"licenses":[],"source":{"name":"The Craft of Teaching in the Academic Study of Religion","homeUrl":"https://craftofteachingreligion.wordpress.com","location":{},"feed":{"id":"557674826","name":"The Craft of Teaching in the Academic Study of Religion","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"76682529","generator":"http://wordpress.com/","description":"The official blog of the University of Chicago Divinity School's Craft of Teaching Program","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"9","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990011}