{"sequenceId":"845365519628","id":"34207218250","language":"English","title":"An Intellectual Collision And The Good Thing It Is","content":"I went to Mississippi College's freshman orientation which would last all day Thursday and half-a-day Friday. I wouldn't be able to stay long on Thursday since I had other things that needed tending to. But I did want to be there for a little while mainly just to give support to Matthew who is attending there in the Fall. There were activities planned for the students for this whole day and a half experience, but parents also had things planned for them for much of the day Thursday.  I stayed long enough to hear several talks from an administrator and former students of MC as well as other students who wanted to help welcome and encourage and \"inspire\" this incoming freshman class.  One of the first things said (by a school administrator; sorry, but I can't remember his name) was his giving of a synopsis of what going to college is like. He quoted several people but one person he quoted said this, \"A part of coming to college is about experiencing an intellectual collision.\" (This is not the exact phrase but it was something like this; and I don't remember who said that either; sorry.)  But that's probably the one thing that stuck in my mind throughout the day. I had never heard such a phrase before: \"intellectual collision.\" But is suppose we all have some sort of intellectual collision everyday. Yes? Wouldn't you agree?  You could certainly see this happening in all of life whether its colleges, universities, churches, a small gathering at a coffeehouse, old retired men gathering for coffee at McDonald's each morning, family gatherings around the dinner table and on and I could go. We all have some \"level\" of intellect and that brings on a collision because we all have our own viewpoints and opinions and \"takes\" and understandings on things. This is not a bad thing. It's good for us because it can keep us human. Yeah. That's right, keep us human.  How could intellectual collision keep us human? Well, it keeps me drawn to another and keeps me with an attention toward another. It keeps me with an interest toward another as well. I like the company of others (sometimes) and I hope they sometimes like my company too. I like listening to others share things with me in whatever it is that's on their minds. I suppose that every conversation you have with someone is an intellectual collision of some sort.  But anyway, back to what I heard at MC from the college administrator. I know that the issue of having an intellectual collision in a college setting is certainly much deeper because it is a place of learning and education and knowledge-gaining. Most of these young freshman coming in are having such a collision because some adults have the opinion that these mostly-18 year olds think they know everything already. Ask any parent and they will mostly agree with that statement. Then these know-it-all 18 year olds have a collision because they realize that they don't know everything and that there are some things (even many things) yet to be learned and known. Yet they bring with them what they've already learned and know and hence the collision.  Well I don't know where I'm really going with all this because I find myself in an intellectual collision even in writing this. I know those of you who are reading this are saying the same thing, like, what is he saying in all this? Where is he going with all this? I'm sorry. I really am. This topic is a deep one for my small mind and intellect. But I can see where this topic could go on for quite a while and go off on many side streets. But that could be a good thing because again it involves me spending time with others, showing others that I think enough of them to spend time with them and to also take time to listen to them. So maybe this is what this particular blog is all about: being thankful for having the time to spend with others in what does include intellectual collisions. It sounds fun and challenging and life-giving all at the same time.  Maybe one day someone will write a book entitled something like  \"Hitting Intellectual Collisions Head-On\". Does that sound bad as a title? I don't know. If so, you can let me know.  But anyway I need to get up now and help my wife clean a bit more of the house. I'm sure we will have an intellectual collision over that, too, since her view of cleaning the house is not necessarily my view and ... well ... there you have it.","contentWithMarkup":"I went to Mississippi College's freshman orientation which would last all day Thursday and half-a-day Friday. I wouldn't be able to stay long on Thursday since I had other things that needed tending to. But I did want to be there for a little while mainly just to give support to Matthew who is attending there in the Fall. There were activities planned for the students for this whole day and a half experience, but parents also had things planned for them for much of the day Thursday.\n\nI stayed long enough to hear several talks from an administrator and former students of MC as well as other students who wanted to help welcome and encourage and \"inspire\" this incoming freshman class.\n\nOne of the first things said (by a school administrator; sorry, but I can't remember his name) was his giving of a synopsis of what going to college is like. He quoted several people but one person he quoted said this, \"A part of coming to college is about experiencing an intellectual collision.\" (This is not the exact phrase but it was something like this; and I don't remember who said that either; sorry.)\n\nBut that's probably the one thing that stuck in my mind throughout the day. I had never heard such a phrase before: \"intellectual collision.\" But is suppose we all have some sort of intellectual collision everyday. Yes? Wouldn't you agree?\n\nYou could certainly see this happening in all of life whether its colleges, universities, churches, a small gathering at a coffeehouse, old retired men gathering for coffee at McDonald's each morning, family gatherings around the dinner table and on and I could go. We all have some \"level\" of intellect and that brings on a collision because we all have our own viewpoints and opinions and \"takes\" and understandings on things. This is not a bad thing. It's good for us because it can keep us human. Yeah. That's right, keep us human.\n\nHow could intellectual collision keep us human? Well, it keeps me drawn to another and keeps me with an attention toward another. It keeps me with an interest toward another as well. I like the company of others (sometimes) and I hope they sometimes like my company too. I like listening to others share things with me in whatever it is that's on their minds. I suppose that every conversation you have with someone is an intellectual collision of some sort.\n\nBut anyway, back to what I heard at MC from the college administrator. I know that the issue of having an intellectual collision in a college setting is certainly much deeper because it is a place of learning and education and knowledge-gaining. Most of these young freshman coming in are having such a collision because some adults have the opinion that these mostly-18 year olds think they know everything already. Ask any parent and they will mostly agree with that statement. Then these know-it-all 18 year olds have a collision because they realize that they don't know everything and that there are some things (even many things) yet to be learned and known. Yet they bring with them what they've already learned and know and hence the collision.\n\nWell I don't know where I'm really going with all this because I find myself in an intellectual collision even in writing this. I know those of you who are reading this are saying the same thing, like, what is he saying in all this? Where is he going with all this? I'm sorry. I really am. This topic is a deep one for my small mind and intellect. But I can see where this topic could go on for quite a while and go off on many side streets. But that could be a good thing because again it involves me spending time with others, showing others that I think enough of them to spend time with them and to also take time to listen to them. So maybe this is what this particular blog is all about: being thankful for having the time to spend with others in what does include intellectual collisions. It sounds fun and challenging and life-giving all at the same time.\n\nMaybe one day someone will write a book entitled something like  \"Hitting Intellectual Collisions Head-On\". Does that sound bad as a title? I don't know. If so, you can let me know.\n\nBut anyway I need to get up now and help my wife clean a bit more of the house. I'm sure we will have an intellectual collision over that, too, since her view of cleaning the house is not necessarily my view and ... well ... there you have it.","tags":[],"publishedDate":"2018-06-02T21:50:42Z","harvestDate":"2018-06-02T21:50:45Z","estimatedPublishedDate":"2018-06-02T21:50:42Z","url":"http://ct.moreover.com/?a=34207218250&p=1u0&v=1&x=R1HpDVyPHcWYetat6HEReQ","originalUrl":"https://toddsanders64.wordpress.com/2018/06/02/an-intellectual-collision-and-the-good-thing-it-is/","outboundUrls":[],"wordCount":"784","dataFormat":"text","duplicateGroupId":"34207218250","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"3517"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"LOL: Live Out Loud","publishingPlatform":{"userId":"13568576"}},"licenses":[],"source":{"name":"LOL: Live Out Loud","homeUrl":"https://toddsanders64.wordpress.com","location":{},"feed":{"id":"131203040","name":"LOL: Live Out Loud","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"13171926","generator":"http://wordpress.com/","description":"Living life out loud, on purpose","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86993733}