{"sequenceId":"845365634139","id":"34207220591","language":"English","title":"FOOD: How to get good goat breeds","content":"A farmer all happy after inspecting his goats. Below goats are resting in their shelter. Photo by Lominda Afedraru  DAILY MONITOR - Goat farming business is not a new idea for farmers to generate income. It has been existent for quite a long time. Farmers have been rearing goats since the time when human beings discovered they were a great source of food, milk and clothing. Nowadays goat meat has a great demand throughout the world because it is very tasty, easily digestible and there are no religious taboos for consuming the meat. Goats are very hardy and they can adopt themselves with almost all types of environment However a farmer wishing to rear goats must take into consideration factors such as availability of market facilities, availability of medicines and veterinary doctor to help in case of disease outbreak. Seeds of Gold caught up for with the programme officer for small ruminants at the National Animal Genetic Resource Centre and Databank (NAGRC&DB) Dr Benda Kirungi Katali with expertise in goat rearing and he analyses the excerpts as below. Suitable breeds Farmers are advised to choose suitable breeds for rearing and this depends on the geographical location. For the first time a farmer can keep numerous breeds and keep selecting those which produce high in order to get readily available market. The typical goat breeds commonly bred in Uganda are categorized into two, the indigenous which include Mubende goats, Kigezi breed, the Small East African goats mainly reared by farmers in West Nile and Eastern Uganda, Karamoja goat suitable for arid regions and Sebei goat suitable for high altitude areas. Mubende goat breed is highly recommended for farmers to keep because it does well in growth and has readily available market. The other local breeds have the advantage of minimum feeding requirements and are tolerant to most diseases which affect goats. Others are the exotic breeds which scientists introduced into the country from South Africa for cross breeding with a target of improving on goat meat production in the country. The breeds include the Boer goats and South African Savanah distributed across the country. It has a very stocky body, strong muscles and bones. It usually has a white body with brown spots, with a high twins kidding rate. It is valuable for its meat, milk and skin production. A mature one can weigh 100 kilogrammes and the cross breed with local breeds can weigh between 60 and 80 kilogrammes. If well fed they are capable of adding 160 grammes per day. Pasture and feeding Goats can be grazed in any pasture land provided it is not poisonous. They are browsers in their feeding habit therefore it is important to feed them on tree leaves, shrubs and tall grass because they have a tendency of pulling their feed from the source. Farmers who are practicing zero grazing must ensure the feed is placed on a raised manner to enable them pull it. The recommended pasture include Napier grass, brachiaria mulato, Rhodes grass, these are rich in carbohydrates. Others rich in protein are legumes such as lablab, alphalpha and green leaf desmodium. The tree species include Calliandra and sesbania. It is important to feed them with green matter and mineral made in block form at all times to improve on the growth rate. Feeding is very important for maximizing meat production. Always feed your goats on fresh and nutritious pasture. If natural food from pasture land is not sufficient, then feed them on highly nutritious supplementary food. It is important to serve them sufficient fresh and clean water according to their demand. Housing and shelter Highly meat productive goat breeds need a house or shelter for taking rest, ruminating and staying at night because they are sensitive to extreme weather conditions such as heat and cold weather. Farmers can make the shelter from simple material like off cut wood and ensure the ventilation is good to allow free aeration. The floor has to be elevated for easy cleaning which must be done on daily basis to avoid accumulated urine and feces, a major cause of pneumonia. Always make sure the shelter faces the direction where the wind is blowing from to avoid destruction of the roof. Ensure sufficient flow of fresh air and light inside the house. It is important to keep hygiene by cleaning the shelter every other time. Major diseases and healthcare The diseases which commonly affect farmer’s goats countrywide are categorized as tick bone diseases which include heart water which causes high temperature thereby destroying organs in the chest. The others are Anaplasmosis and Babesiosis with similar symptoms. These can be controlled by spraying the ticks twice a week using appropriate acaricides. This must be done after consulting veterinary personnel for the right diagnostics. Other major diseases are those caused by helminthes such as gastro internal parasites which include haemoncashus worm which sucks the blood of the infected animal thereby causing anemia conditions. This causes dehydration thereby retarding growth of the animal and eventual death. Farmers are advised to deworm the animals with drugs such as Albendazole and Levermisole as prescribed by the Veterinary Doctor. Another category is goat disease called Enterotoxaemia which is a toxin caused by bacterial infection affecting the intestines. This can be controlled by vaccinating the animals with toxipra vaccine. It is a deadly disease which infects healthy animals that are prone to die instantly. Animals must be vaccinated twice a year and the pregnant ones must be vaccinated 3 weeks to giving birth. There common diseases which affect goats and most farmers are aware about them and they include Brucellosis, Peste des petits ruminant (PPR) which almost wiped out goats in Uganda and Contagious Caprine Pleuropneumonia (CCPP). These diseases lead to animals suffering from flue, diarrhea and causing abortion in pregnant animals. Farmers are advised to administer appropriate vaccines against these diseases as prescribed by the veterinary Doctor.","contentWithMarkup":"<img src=\"http://www.monitor.co.ug/image/view/-/4591552/highRes/1993835/-/maxw/600/-/13wvyebz/-/farm04pix.jpg\" /><br />A farmer all happy after inspecting his goats. Below goats are resting in their shelter. Photo by Lominda Afedraru <div><br /></div><div>DAILY MONITOR - Goat farming business is not a new idea for farmers to generate income. It has been existent for quite a long time. <br />Farmers have been rearing goats since the time when human beings discovered they were a great source of food, milk and clothing.<br /><br />Nowadays goat meat has a great demand throughout the world because it is very tasty, easily digestible and there are no religious taboos for consuming the meat.<br /><br />Goats are very hardy and they can adopt themselves with almost all types of environment <br />However a farmer wishing to rear goats must take into consideration factors such as availability of market facilities, availability of medicines and veterinary doctor to help in case of disease outbreak.<br /><br />Seeds of Gold caught up for with the programme officer for small ruminants at the National Animal Genetic Resource Centre and Databank (NAGRC&DB) Dr Benda Kirungi Katali with expertise in goat rearing and he analyses the excerpts as below.<br /><br />Suitable breeds<br />Farmers are advised to choose suitable breeds for rearing and this depends on the geographical location.<br />For the first time a farmer can keep numerous breeds and keep selecting those which produce high in order to get readily available market.<br /><br />The typical goat breeds commonly bred in Uganda are categorized into two, the indigenous which include Mubende goats, Kigezi breed, the Small East African goats mainly reared by farmers in West Nile and Eastern Uganda, Karamoja goat suitable for arid regions and Sebei goat suitable for high altitude areas.<br /><br />Mubende goat breed is highly recommended for farmers to keep because it does well in growth and has readily available market.<br /><br />The other local breeds have the advantage of minimum feeding requirements and are tolerant to most diseases which affect goats.<br /><br />Others are the exotic breeds which scientists introduced into the country from South Africa for cross breeding with a target of improving on goat meat production in the country.<br /><br />The breeds include the Boer goats and South African Savanah distributed across the country.<br />It has a very stocky body, strong muscles and bones. It usually has a white body with brown spots, with a high twins kidding rate. It is valuable for its meat, milk and skin production.<br /><br />A mature one can weigh 100 kilogrammes and the cross breed with local breeds can weigh between 60 and 80 kilogrammes. If well fed they are capable of adding 160 grammes per day.<br /><br />Pasture and feeding<br />Goats can be grazed in any pasture land provided it is not poisonous. They are browsers in their feeding habit therefore it is important to feed them on tree leaves, shrubs and tall grass because they have a tendency of pulling their feed from the source.<br /><br />Farmers who are practicing zero grazing must ensure the feed is placed on a raised manner to enable them pull it.<br />The recommended pasture include Napier grass, brachiaria mulato, Rhodes grass, these are rich in carbohydrates. <br />Others rich in protein are legumes such as lablab, alphalpha and green leaf desmodium. The tree species include Calliandra and sesbania.<br /><br />It is important to feed them with green matter and mineral made in block form at all times to improve on the growth rate.<br /><br />Feeding is very important for maximizing meat production. Always feed your goats on fresh and nutritious pasture. If natural food from pasture land is not sufficient, then feed them on highly nutritious supplementary food.<br />It is important to serve them sufficient fresh and clean water according to their demand.<br /><br />Housing and shelter<br />Highly meat productive goat breeds need a house or shelter for taking rest, ruminating and staying at night because they are sensitive to extreme weather conditions such as heat and cold weather.<br />Farmers can make the shelter from simple material like off cut wood and ensure the ventilation is good to allow free aeration.<br /><br />The floor has to be elevated for easy cleaning which must be done on daily basis to avoid accumulated urine and feces, a major cause of pneumonia.<br />Always make sure the shelter faces the direction where the wind is blowing from to avoid destruction of the roof. <br />Ensure sufficient flow of fresh air and light inside the house. It is important to keep hygiene by cleaning the shelter every other time.<br /><br />Major diseases and healthcare <br />The diseases which commonly affect farmer’s goats countrywide are categorized as tick bone diseases which include heart water which causes high temperature thereby destroying organs in the chest.<br /><br />The others are Anaplasmosis and Babesiosis with similar symptoms.<br /><br />These can be controlled by spraying the ticks twice a week using appropriate acaricides. <br />This must be done after consulting veterinary personnel for the right diagnostics.<br /><br />Other major diseases are those caused by helminthes such as gastro internal parasites which include haemoncashus worm which sucks the blood of the infected animal thereby causing anemia conditions.<br /><br />This causes dehydration thereby retarding growth of the animal and eventual death.<br />Farmers are advised to deworm the animals with drugs such as Albendazole and Levermisole as prescribed by the Veterinary Doctor.<br />Another category is goat disease called Enterotoxaemia which is a toxin caused by bacterial infection affecting the intestines. <br />This can be controlled by vaccinating the animals with toxipra vaccine. It is a deadly disease which infects healthy animals that are prone to die instantly.<br /><br />Animals must be vaccinated twice a year and the pregnant ones must be vaccinated 3 weeks to giving birth.<br /><br />There common diseases which affect goats and most farmers are aware about them and they include Brucellosis, Peste des petits ruminant (PPR) which almost wiped out goats in Uganda and Contagious Caprine Pleuropneumonia (CCPP). These diseases lead to animals suffering from flue, diarrhea and causing abortion in pregnant animals.<br /><br />Farmers are advised to administer appropriate vaccines against these diseases as prescribed by the veterinary Doctor.</div>","tags":["Business","Uganda"],"publishedDate":"2018-06-02T20:01:20Z","harvestDate":"2018-06-02T21:51:15Z","estimatedPublishedDate":"2018-06-02T20:01:20Z","url":"http://ct.moreover.com/?a=34207220591&p=1u0&v=1&x=wjs41xqNx8HahGt-E1c-Zg","originalUrl":"http://nangalama.blogspot.com/2018/06/food-how-to-get-good-goat-breeds.html","commentsUrl":"http://nangalama.blogspot.com/2018/06/food-how-to-get-good-goat-breeds.html#comment-form","outboundUrls":[],"wordCount":"978","dataFormat":"text","duplicateGroupId":"34205886841","media":{"audio":[],"images":[{"url":"http://www.monitor.co.ug/image/view/-/4591552/highRes/1993835/-/maxw/600/-/13wvyebz/-/farm04pix.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Martha Leah Nangalama","publishingPlatform":{}},"licenses":[],"source":{"name":"Martha Leah Nangalama","homeUrl":"http://nangalama.blogspot.com/","location":{"country":"South Africa","countryCode":"ZA","region":"Africa","subregion":"Southern Africa"},"feed":{"id":"620031664","name":"Martha Leah Nangalama","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","tags":["IFTTT","Twitter","Uganda","World News","YouTube","Politics","Business","Videos","Education","Museveni","Crime","Kenya","NRM Thugs","Entertainment","Library of Congress","South Sudan","DR Congo","Rwanda","Facebook","Tanzania","Health and Fitness","Human Rights","Opinion","News","Trump","Africa","Sports","Corr"],"language":"English","dataFormat":"text","rank":{"autoRank":"6","autoRankOrder":"65826","inboundLinkCount":"4"},"inWhiteList":"true","autoTopics":[]}},"es_id":86993772}