{"sequenceId":"845361802219","id":"34207097635","language":"English","title":"Pentecostal leader T.F. Tenney dies at 84","content":"ALEXANDRIA -- Tom Fred Tenney, a United Pentecostal Church International leader credited with greatly increasing the denomination's missionary work abroad, has died. He was 84. Rev. Tenney was a minister for more than 65 years. He was in his late 20s when he became the denomination's national youth president in 1960. Ten years later, he was named head of its foreign missions (now global missions). He also was the church's Louisiana District superintendent for 27 years, starting in 1978. \"He was an innovator. He introduced many new plans and ideas, one being the concept of partners in missions, whereby individual churches would sponsor missionaries around the world. That created a tremendous increase in giving and a tremendous increase in world missions,\" denomination General Superintendent David Bernard said Saturday (June 2). The denomination has 40,000 churches in 190 countries and 35 territories. Bernard said Rev. Tenney was a well-known speaker, teacher and mentor, and the Louisiana District is \"one of our leading districts.\" He was called Bishop Tenney, an honorary title rather than an official one, Bernard said. The current district superintendent, Rev. Kevin Cox, said Rev. Tenney died Friday. He had health problems for years but spoke Sunday in his church, The Pentecostals of Alexandria, talking from a wheelchair because of a broken ankle. Cox said Rev. Tenney's wife of 65 years, Thetus Tenney, told him Friday, \"It was if it was 10 years ago, he felt the anointing of the spirit and spoke so well.\" Rev. Tenney was 19 and his wife was 18 when they were chosen to lead a Home Missions church in Monroe in 1953, months after their wedding, according to the denomination's biography. They worked together from then on. \"Both were influential, and they worked very closely together,\" Bernard said. Rev. Tenney is also survived by two children, five grandchildren and two great-grandchildren. Cox described Rev. Tenney as a friend to all, from the U.S. presidents he had met to \"the most unfortunate person around.\" He also seemed to remember almost everyone in any church he'd ever visited, greeting them by name and asking after relatives by name, Cox said. He said Rev. Tenney's memorial service will be held Tuesday at The Pentecostals of Alexandria. Visitation begins at 1 p.m., the service at 7 p.m.","contentWithMarkup":"65-year ministry included 27 years as Louisiana District superintendent","tags":["tag:alexandria","tag:br-homepage","tag:christianity","tag:homepage","tag:news","tag:pentecostalism"],"publishedDate":"2018-06-02T20:19:54Z","harvestDate":"2018-06-02T21:21:06Z","estimatedPublishedDate":"2018-06-02T20:19:54Z","url":"http://ct.moreover.com/?a=34207097635&p=1u0&v=1&x=g9nRVbtxCKW1QbbGvMz4xg","originalUrl":"http://www.nola.com/religion/index.ssf/2018/06/pentecostal_leader_tf_tenney_d.html","outboundUrls":[],"wordCount":"363","dataFormat":"text","duplicateGroupId":"34206625262","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Executive moves news","group":"Business"}],"companies":[],"author":{"name":"The Associated Press","publishingPlatform":{}},"licenses":[],"source":{"name":"NOLA River","homeUrl":"http://blog.nola.com/nola_river/","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"304532292","name":"NOLA River","mediaType":"Blog","publishingPlatform":"Movable Type","generator":"Movable Type Enterprise 4.29-advance http://www.sixapart.com/movabletype/","tags":[],"language":"English","dataFormat":"Image","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86989864}