{"sequenceId":"845363650759","id":"34207158886","language":"English","title":"Meet PATRICK MELROSE","content":"Article first published as TV Review: PATRICK MELROSE on Seat42F. Showtime has adapted the five PATRICK MELROSE novels by Edward St. Aubyn into a five-episode miniseries currently airing. Each book gets an hour to unfold, with a different chapter in the life of the titular character presented. Plagued by childhood trauma, addicted to drugs to help cope with his past, Patrick is anything but healthy. But at least he realizes that he’s in a negative cycle and would like to break free. Will he be able to? Benedict Cumberbatch (Sherlock, Doctor Strange) is excellent as Patrick. The actor has some experience playing eccentric, substance-abusing men, and only gets better with each iteration. He captures the subtlety of the emotional journey, and somehow keeps Patrick somewhat sympathetic, even in his darkest moments. This is important when the central protagonist is not very likeable, as Patrick isn’t from the moment we meet him. It’s a case study of a broken man, and Cumberbatch exceeds expectations. Despite Cumberbatch’s work, though, PATRICK MELROSE is still hard to watch. It is hard to see someone you care about, as viewers are apt to care for Patrick, wrestle with their demons. It’s difficult to see a battle being fought and lost. It’s even more wrenching when one knows Patrick’s problems stem from things that are not his fault, and you desperately want him to be able to claw his way out of the hole, even knowing there is nothing you can do to help. It’s easy to identify with the supportive characters in the series. Except when it isn’t because of the circumstances Patrick lives in. It’s interesting that PATRICK MELROSE reverses the order of the first two books in the series. Part two, “Never Mind,” is an origin story of sorts, taking place when Patrick is just a boy (played by newcomer Sebastian Maltz). With Cumberbatch’s version in the throes of withdrawal, flashing back to his childhood, the installment mainly shows us Eleanor (Jennifer Jason Leigh, Atypical) and David Melrose (Hugo Weaving, The Matrix), and how they fail as parents at every opportunity. It provides much-needed insight, mostly missing from the first part, “Bad News.” The omission means it takes awhile to really root for Patrick. And while the boy isn’t immediately recognizable as the adult, given a pattern of behavior merely glimpsed in this one weekend, it’s clear how he could eventually become so. There are questions raised here on nature versus nurture. How much of who Patrick turned out to be is the fault of Eleanor and David? How much is he responsible for his own actions, now that he is out of their home and his own man? At some point, personal responsibility must kick in, but the man is operating at such a deficit that it’s hard to fault him for much of what he does, especially when we only see him hurting himself, not putting anyone else in danger. Not yet, anyway. It’s sort of a problem that Patrick is rich. Without money, he could not afford to behave as he does. He’d be penniless, on the streets, begging for his next fix. Arguably, a poor Patrick would be a more important and common story. Instead, this Patrick lives relatively free of consequences. This gives him the space and opportunity to figure himself out, a luxury most people would not have. But it’s also possible such a tale wouldn’t play out under other circumstances, with an earlier, more tragic ending. Many viewers may have to confront a bias against such a person to try to appreciate the story. The first hour of PATRICK MELROSE is hard to get through without having the understanding of the second, though it makes sense to get Cumberbatch out in front at the start of the miniseries. Still, even as the backstory is revealed, and amid terrific performances, the miniseries is a hard one to sit through. Patrick isn’t a character most people will relate to, and as sympathetic as his upbringing makes him, his wealth is almost used as an excuse, at least by the character. Bad behavior unchecked is also depressing. Whether it will be worth it in the end remains to be seen. PATRICK MELROSE is currently airing Saturday nights on Showtime.","contentWithMarkup":"<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><i><span style=\"font-size: x-small;\">Article first published as <a href=\"https://seat42f.com/tv-review-patrick-melrose.html\" target=\"_blank\">TV Review: PATRICK MELROSE</a> on Seat42F.</span></i><br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-nxabtM5oEMo/Ww__iAH-FUI/AAAAAAAAT1E/I7z8-1dDWw4p5IqtifTHP-7hJwERJxSxgCLcBGAs/s1600/Patrick-Melrose-Showtime-Benedict-Cumberbatch.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"825\" data-original-width=\"1100\" height=\"480\" src=\"https://1.bp.blogspot.com/-nxabtM5oEMo/Ww__iAH-FUI/AAAAAAAAT1E/I7z8-1dDWw4p5IqtifTHP-7hJwERJxSxgCLcBGAs/s640/Patrick-Melrose-Showtime-Benedict-Cumberbatch.jpg\" width=\"640\" /></a></div><br /><div style=\"background-color: white; border: 0px; color: #222222; font-family: Rubik, serif; font-size: 18.4px; line-height: 29.44px; margin-bottom: 20px; padding: 0px; text-align: justify; vertical-align: baseline;\">Showtime has adapted the five PATRICK MELROSE novels by Edward St. Aubyn into a five-episode miniseries currently airing. Each book gets an hour to unfold, with a different chapter in the life of the titular character presented. Plagued by childhood trauma, addicted to drugs to help cope with his past, Patrick is anything but healthy. But at least he realizes that he’s in a negative cycle and would like to break free. Will he be able to?</div><div style=\"background-color: white; border: 0px; color: #222222; font-family: Rubik, serif; font-size: 18.4px; line-height: 29.44px; margin-bottom: 20px; padding: 0px; text-align: justify; vertical-align: baseline;\"><span style=\"font-size: 18.4px;\">Benedict Cumberbatch (Sherlock, Doctor Strange) is excellent as Patrick. The actor has some experience playing eccentric, substance-abusing men, and only gets better with each iteration. He captures the subtlety of the emotional journey, and somehow keeps Patrick somewhat sympathetic, even in his darkest moments. This is important when the central protagonist is not very likeable, as Patrick isn’t from the moment we meet him. It’s a case study of a broken man, and Cumberbatch exceeds expectations.</span></div><div style=\"background-color: white; border: 0px; color: #222222; font-family: Rubik, serif; font-size: 18.4px; line-height: 29.44px; margin-bottom: 20px; padding: 0px; text-align: justify; vertical-align: baseline;\">Despite Cumberbatch’s work, though, PATRICK MELROSE is still hard to watch. It is hard to see someone you care about, as viewers are apt to care for Patrick, wrestle with their demons. It’s difficult to see a battle being fought and lost. It’s even more wrenching when one knows Patrick’s problems stem from things that are not his fault, and you desperately want him to be able to claw his way out of the hole, even knowing there is nothing you can do to help. It’s easy to identify with the supportive characters in the series. Except when it isn’t because of the circumstances Patrick lives in.</div><div style=\"background-color: white; border: 0px; color: #222222; font-family: Rubik, serif; font-size: 18.4px; line-height: 29.44px; margin-bottom: 20px; padding: 0px; text-align: justify; vertical-align: baseline;\">It’s interesting that PATRICK MELROSE reverses the order of the first two books in the series. Part two, “Never Mind,” is an origin story of sorts, taking place when Patrick is just a boy (played by newcomer Sebastian Maltz). With Cumberbatch’s version in the throes of withdrawal, flashing back to his childhood, the installment mainly shows us Eleanor (Jennifer Jason Leigh, Atypical) and David Melrose (Hugo Weaving, The Matrix), and how they fail as parents at every opportunity. It provides much-needed insight, mostly missing from the first part, “Bad News.” The omission means it takes awhile to really root for Patrick. And while the boy isn’t immediately recognizable as the adult, given a pattern of behavior merely glimpsed in this one weekend, it’s clear how he could eventually become so.</div><div style=\"background-color: white; border: 0px; color: #222222; font-family: Rubik, serif; font-size: 18.4px; line-height: 29.44px; margin-bottom: 20px; padding: 0px; text-align: justify; vertical-align: baseline;\"><span style=\"font-size: 18.4px;\">There are questions raised here on nature versus nurture. How much of who Patrick turned out to be is the fault of Eleanor and David? How much is he responsible for his own actions, now that he is out of their home and his own man? At some point, personal responsibility must kick in, but the man is operating at such a deficit that it’s hard to fault him for much of what he does, especially when we only see him hurting himself, not putting anyone else in danger. Not yet, anyway.</span></div><div style=\"background-color: white; border: 0px; color: #222222; font-family: Rubik, serif; font-size: 18.4px; line-height: 29.44px; margin-bottom: 20px; padding: 0px; text-align: justify; vertical-align: baseline;\">It’s sort of a problem that Patrick is rich. Without money, he could not afford to behave as he does. He’d be penniless, on the streets, begging for his next fix. Arguably, a poor Patrick would be a more important and common story. Instead, this Patrick lives relatively free of consequences. This gives him the space and opportunity to figure himself out, a luxury most people would not have. But it’s also possible such a tale wouldn’t play out under other circumstances, with an earlier, more tragic ending. Many viewers may have to confront a bias against such a person to try to appreciate the story.</div><div style=\"background-color: white; border: 0px; color: #222222; font-family: Rubik, serif; font-size: 18.4px; line-height: 29.44px; margin-bottom: 20px; padding: 0px; text-align: justify; vertical-align: baseline;\"><span style=\"font-size: 18.4px;\">The first hour of PATRICK MELROSE is hard to get through without having the understanding of the second, though it makes sense to get Cumberbatch out in front at the start of the miniseries. Still, even as the backstory is revealed, and amid terrific performances, the miniseries is a hard one to sit through. Patrick isn’t a character most people will relate to, and as sympathetic as his upbringing makes him, his wealth is almost used as an excuse, at least by the character. Bad behavior unchecked is also depressing. Whether it will be worth it in the end remains to be seen.</span></div><div style=\"background-color: white; border: 0px; color: #222222; font-family: Rubik, serif; font-size: 18.4px; line-height: 29.44px; margin-bottom: 20px; padding: 0px; text-align: justify; vertical-align: baseline;\">PATRICK MELROSE is currently airing Saturday nights on Showtime.</div></div><img src=\"http://feeds.feedburner.com/~r/blogspot/DDOXj/~4/oInct3zvtyI\" height=\"1\" width=\"1\" alt=\"\"/>","tags":["Benedict Cumberbatch","Hugo Weaving","Jennifer Jason Leigh","Patrick Melrose","Sebastian Maltz","Showtime"],"publishedDate":"2018-06-02T13:58:19Z","harvestDate":"2018-06-02T21:36:25Z","estimatedPublishedDate":"2018-06-02T13:58:19Z","url":"http://ct.moreover.com/?a=34207158886&p=1u0&v=1&x=fPR5vvQigLlpHgybCg8yYQ","originalUrl":"http://jeromewetzeltv.blogspot.com/2018/06/meet-patrick-melrose.html","commentsUrl":"http://jeromewetzeltv.blogspot.com/2018/06/meet-patrick-melrose.html#comment-form","outboundUrls":["https://seat42f.com/tv-review-patrick-melrose.html","https://1.bp.blogspot.com/-nxabtM5oEMo/Ww__iAH-FUI/AAAAAAAAT1E/I7z8-1dDWw4p5IqtifTHP-7hJwERJxSxgCLcBGAs/s1600/Patrick-Melrose-Showtime-Benedict-Cumberbatch.jpg"],"wordCount":"710","dataFormat":"text","duplicateGroupId":"34207158886","media":{"audio":[],"images":[{"url":"https://1.bp.blogspot.com/-nxabtM5oEMo/Ww__iAH-FUI/AAAAAAAAT1E/I7z8-1dDWw4p5IqtifTHP-7hJwERJxSxgCLcBGAs/s640/Patrick-Melrose-Showtime-Benedict-Cumberbatch.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Jerome Wetzel","publishingPlatform":{}},"licenses":[],"source":{"name":"Jerome Wetzel TV","homeUrl":"http://jeromewetzeltv.blogspot.com/","location":{},"feed":{"id":"126501608","name":"Jerome Wetzel TV","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"Jerome Wetzel is the Chief Television Critic for Seat42F and a regular contributing reviewer on Blogcritics. He also appears on The Good, The Bad, and the Geeky podcast and Let's Talk TV With Barbara Barnett.","tags":["fox","ABC","NBC","CBS","HBO","Glee","CW","FX","BBC","USA","Lea Michele","AMC","Showtime","chris colfer","Jane Lynch","Doctor Who","matthew morrison","Cory Monteith","Once Upon a Time","The Walking Dead","Jennifer Morrison","Naya Rivera","BBC America","Darren Criss","Amber Riley","Netflix","Lana Parrilla","co"],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86991933}