{"sequenceId":"845366752835","id":"34207249794","language":"English","title":"First Couple of Rows Might Get Glittered","content":"First Couple of Rows Might Get Glittered.  A review of Buffy The Vampire Slayer the Musical: Once More With Feeling at The Theatre on King in Peterborough, Ontario. Produced by Eryn Lidster, directed by Samantha Mansfield.  By Derek Newman-Stille.    I fell in love with the Buffy the Vampire Slayer episode \"Once More With Feeling\" when I was doing my undergraduate degree. We would gather in the common room and watch Buffy episodes together and the episode Once More With Feeling left us singing for weeks.  I had thought that Buffy was a hallmark of an older generation, so I was extremely excited to see that the Theatre on King brought Buffy right into Peterborough, transforming my town into Sunnydale for a few magical minutes.    When I had first watched \"Once More With Feeling\" on television, it was aired with an “adult content” warning because of a lesbian kiss, so it was wonderful to see that there was no need for a content warning in the performance at the Theatre on King and there were children in the audience. It is hopeful to see a space where queerness wasn’t censored.  Although presented without the magic of television special effects, the show allowed for some of the magic to be brought close to the audience with glitter, make up, and great performances. The smaller theatre space also allowed for an intimacy with the characters and their experiences that television or even a larger theatre wouldn’t permit. The cast were able to access the power of local theatre and make Buffy’s story their own.  The cast was able to capture the nuances of the original Buffy cast while bringing their own understandings of the characters and their own dynamics to their parts. This was Canadian local theatre at its best and it will leave you singing about demons, witches, and vampire slayers until you burn up with passion and excitement.  To discover more about the Theatre on King, go to http://ttok.ca","contentWithMarkup":"First Couple of Rows Might Get Glittered.\n\nA review of <u>Buffy The Vampire Slayer the Musical: Once More With Feeling</u> at The Theatre on King in Peterborough, Ontario. Produced by Eryn Lidster, directed by Samantha Mansfield.\n\nBy Derek Newman-Stille.\n\n<img src=\"https://speculatingcanada.files.wordpress.com/2018/06/img_0365.jpg\" class=\"size-full wp-image-3639\" height=\"3024\" width=\"4032\"/>\n\nI fell in love with the <u>Buffy the Vampire Slayer</u> episode \"Once More With Feeling\" when I was doing my undergraduate degree. We would gather in the common room and watch Buffy episodes together and the episode Once More With Feeling left us singing for weeks.\n\nI had thought that Buffy was a hallmark of an older generation, so I was extremely excited to see that the Theatre on King brought Buffy right into Peterborough, transforming my town into Sunnydale for a few magical minutes.\n\n<img src=\"https://speculatingcanada.files.wordpress.com/2018/06/img_5722.jpg\" class=\"wp-image-3640 size-full\" height=\"240\" width=\"320\"/>\n\nWhen I had first watched \"Once More With Feeling\" on television, it was aired with an “adult content” warning because of a lesbian kiss, so it was wonderful to see that there was no need for a content warning in the performance at the Theatre on King and there were children in the audience. It is hopeful to see a space where queerness wasn’t censored.\n\nAlthough presented without the magic of television special effects, the show allowed for some of the magic to be brought close to the audience with glitter, make up, and great performances. The smaller theatre space also allowed for an intimacy with the characters and their experiences that television or even a larger theatre wouldn’t permit. The cast were able to access the power of local theatre and make Buffy’s story their own.\n\nThe cast was able to capture the nuances of the original Buffy cast while bringing their own understandings of the characters and their own dynamics to their parts. This was Canadian local theatre at its best and it will leave you singing about demons, witches, and vampire slayers until you burn up with passion and excitement.\n\nTo discover more about the Theatre on King, go to http://ttok.ca","tags":["Other Reviews","Buffy the Vampire Slayer","community theatre","LGBTQ2","Magic","Monstrosity","musicals","Once More With Feeling","Peterborough","reviews","The Theatre on King"],"publishedDate":"2018-06-02T21:57:37Z","harvestDate":"2018-06-02T21:58:01Z","estimatedPublishedDate":"2018-06-02T21:57:37Z","url":"http://ct.moreover.com/?a=34207249794&p=1u0&v=1&x=dVVwJVh6rL5DQNaT7_kEbQ","originalUrl":"http://speculatingcanada.ca/2018/06/02/first-couple-of-rows-might-get-glittered/","outboundUrls":["http://ttok.ca/"],"wordCount":"328","dataFormat":"text","duplicateGroupId":"34207249794","media":{"audio":[],"images":[{"url":"https://speculatingcanada.files.wordpress.com/2018/06/img_0365.jpg"},{"url":"https://speculatingcanada.files.wordpress.com/2018/06/img_5722.jpg"}],"video":[],"logo":[]},"publishingPlatform":{"itemId":"3641"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"dereknewmanstille","publishingPlatform":{"userId":"37517726"}},"licenses":[],"source":{"name":"Speculating Canada: Canadian Horror, Science Fiction, and Fantasy","homeUrl":"http://speculatingcanada.ca","location":{"country":"Canada","countryCode":"CA","region":"Americas","subregion":"Northern America"},"feed":{"id":"476410019","name":"Speculating Canada: Canadian Horror, Science Fiction, and Fantasy","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"38024839","generator":"http://wordpress.com/","description":"Challenging the barriers of the way we define reality","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"45516","inboundLinkCount":"8"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994545}