{"sequenceId":"845363547287","id":"34207155365","language":"English","title":"Chamblee Dentists | Calming Dental Fears","content":"We all have something we are afraid of—spiders, the dark, heights, maybe even going to the dentist. Sometimes, you can avoid scary things. You do not like heights? Stay close to the ground. But seeing the dentist is one fear you should not dodge. Here are some things you can do to help you get to the dental office and through the appointment:⁃  Speak up. Let our office know that you are anxious. Tell the receptionist when you book the appointment, and tell our staff members when you arrive. And most importantly, tell your dentist. Let us know what makes you nervous or if you have had a bad experience in the past. It is especially important to let us know if you have felt pain before. Sometimes patients experience unnecessary pain even though they have been given a local anesthetic.  Talk to our team about the coping skills that have worked for you in the past and those that you would like to try. Also, ask to start with simple, shorter appointments if possible.  Do not be afraid to ask questions. Some people worry about what is going to happen before and during the procedure. If you are curious, ask the dentist what the treatment involves or to briefly explain as you go along.  Agree on a signal you can give—like raising your hand—if you need to take a break during treatment.1  Distract yourself. You have a lot of options for distracting yourself to help take your mind off the treatment.  Bring headphones and some music or an audiobook to listen to;  Occupy your hands by squeezing a soft stress ball or playing with a fidget toy;  It may sound silly, but go to your happy place. Try imagining yourself someplace else. It might help you escape your surroundings and stay calm  Breathe. Deep breathing brings oxygen into your body, helping slow your heart rate and relax your muscles. You can practice deep breathing anywhere—on the way to the appointment, in the waiting room, or in the chair before treatment begins.  These are just a few coping techniques. Work with your dental team to develop a plan that not only gets you in the door, but keeps you coming back for visits on a regular basis.  Novy Scheinfeld, DDS, PC  ZoAnna Scheinfeld, MS, DMD  Hanna Orland, DMD  3781 Chamblee Dunwoody Road  Chamblee, GA 30341  770-455-6076  and  290 Carpenter Drive, 200A  Sandy Springs, GA 30328  404-256-3620  info@rightsmilecenter.com  www.rightsmilecenter.com","contentWithMarkup":"<a href=\"https://therightsmile.wordpress.com/2017/05/17/dentist-sandy-springs-tooth-loss-linked-to-depression-and-anxiety/fear-3/\" rel=\"attachment wp-att-4671\"><img class=\"alignright wp-image-4671\" src=\"https://therightsmile.files.wordpress.com/2014/04/fear.jpg\" alt=\"Chamblee | Brookhaven dentist near me\" width=\"456\" height=\"304\" /></a>We all have something we are afraid of—spiders, the dark, heights, maybe even going to the dentist. Sometimes, you can avoid scary things. You do not like heights? Stay close to the ground. But seeing the dentist is one fear you should not dodge. Here are some things you can do to help you get to the dental office and through the appointment:⁃\n\n<em>Speak up.</em> Let our office know that you are anxious. Tell the receptionist when you book the appointment, and tell our staff members when you arrive. And most importantly, tell your dentist. Let us know what makes you nervous or if you have had a bad experience in the past. It is especially important to let us know if you have felt pain before. Sometimes patients experience unnecessary pain even though they have been given a local anesthetic.\n\nTalk to our team about the coping skills that have worked for you in the past and those that you would like to try. Also, ask to start with simple, shorter appointments if possible.\n\nDo not be afraid to ask questions. Some people worry about what is going to happen before and during the procedure. If you are curious, ask the dentist what the treatment involves or to briefly explain as you go along.\n\nAgree on a signal you can give—like raising your hand—if you need to take a break during treatment.<sup>1</sup>\n\n<em>Distract yourself.</em> You have a lot of options for distracting yourself to help take your mind off the treatment.\n\nBring headphones and some music or an audiobook to listen to;\n\nOccupy your hands by squeezing a soft stress ball or playing with a fidget toy;\n\nIt may sound silly, but go to your happy place. Try imagining yourself someplace else. It might help you escape your surroundings and stay calm\n\n<em>Breathe.</em> Deep breathing brings oxygen into your body, helping slow your heart rate and relax your muscles. You can practice deep breathing anywhere—on the way to the appointment, in the waiting room, or in the chair before treatment begins.\n\nThese are just a few coping techniques. Work with your dental team to develop a plan that not only gets you in the door, but keeps you coming back for visits on a regular basis.\n\nNovy Scheinfeld, DDS, PC\n\nZoAnna Scheinfeld, MS, DMD\n\nHanna Orland, DMD\n\n3781 Chamblee Dunwoody Road\n\nChamblee, GA 30341\n\n770-455-6076\n\nand\n\n290 Carpenter Drive, 200A\n\nSandy Springs, GA 30328\n\n404-256-3620\n\ninfo@rightsmilecenter.com\n\nwww.rightsmilecenter.com","tags":["Oral health","Brookhaven Dentist","Chamblee Dentist"],"publishedDate":"2018-06-02T21:33:55Z","harvestDate":"2018-06-02T21:35:24Z","estimatedPublishedDate":"2018-06-02T21:33:55Z","url":"http://ct.moreover.com/?a=34207155365&p=1u0&v=1&x=2Uuj7J5AflKPKl0j0FTNqw","originalUrl":"https://therightsmile.wordpress.com/2018/06/02/chamblee-dentists-calming-dental-fears/","outboundUrls":[],"wordCount":"402","dataFormat":"text","duplicateGroupId":"34207155365","media":{"audio":[],"images":[{"url":"https://therightsmile.files.wordpress.com/2014/04/fear.jpg"}],"video":[],"logo":[]},"publishingPlatform":{"itemId":"5908"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Drs. Novy and ZoAnna Scheinfeld and Hanna Orland","publishingPlatform":{"userId":"20776306"}},"licenses":[],"source":{"name":"the right smile","homeUrl":"https://therightsmile.wordpress.com","location":{},"feed":{"id":"206050853","name":"the right smile","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"20190050","generator":"http://wordpress.com/","description":"Dentists Educating Patients on their Oral Health Options","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":["ugc technology feeds","ugc medical feeds"]}},"es_id":86991828}