{"sequenceId":"845362184812","id":"34207110507","language":"English","title":"When Should You Use a Personal Loan in an Emergency?","content":"Personal loans are versatile financial tools.    You can use a personal loan for nearly any purpose, so long as you can qualify for the loan.    Of course, because personal loans are loans, you’ll have to pay interest on the money you borrow. That means you shouldn’t take on a personal loan lightly.    They should be something that you use only when it is necessary.    However, if you’re facing a true financial emergency, a personal loan can be a big help.   What is a Personal Loan   A personal loan is an installment loan that is made directly to you, which can be used for nearly any purpose.    This differentiates them from most other types of loans.    Credit cards , for example, can only be used to make purchases at stores that accept cards. Mortgages must be used to buy real estate. Auto loans can only be used to buy a vehicle.    What makes personal loans unique is their flexibility.   Secured vs. Unsecured Personal Loan   There are two main types of personal loan, secured personal loans and unsecured personal loans .          Unsecured Loans     Secured Loans         Pros   Great option if you are trying to consolidate existing debts   Does not require any kind of collateral so there is less risk for you   Usually only takes at most a few days to receive funds   Pros   Easier to qualify for if you have lower credit and/or lower income   Often lower interest rate than unsecured loans   Typically can borrow a larger amount      Cons   Interest rates can be higher than secured loans    Harder to qualify for   Lower lending limits   Cons   You put your own assets on the line so you're at risk to lose more   Application process may take longer which could lead to more fees and longer waiting period   If you use savings as collateral, that money becomes unavailable for the duration of the loan       A secured personal loan requires that you provide some form of collateral to the lender.    This could be the balance of a savings account, the title to your vehicle, or something else of value. If you fail to make payments on your loan, the lender will take possession of the collateral to compensate for its loss. You get the collateral back if you pay the loan off.    Secured loans are easier to qualify for because the lender takes on much less risk.    Unsecured personal loans don’t require any collateral.    You get the loan purely on your word that you’ll pay the loan back. These loans are harder to get because the lender takes on more risk.    Generally, you need to have a good credit score to qualify for an unsecured loan.   Fees   There are a few fees to watch out for when you’re looking for a personal loan.    Many lenders charge application fees to compensate for the trouble of processing your application. These are usually a small lump sum of $20-$50.    Once you’ve gotten approved for the loan, some lenders also charge an origination fee. This covers the cost of depositing the money into your account.    Origination fees are usually a percentage of the amount you borrow. For example, if you get a $10,000 loan and pay a 5% origination fee, your starting loan balance will be $10,500.    Finally, some lenders charge early repayment penalties. If you pay your loan back ahead of schedule, the lender might charge you a fee to compensate for its lost interest.      Type of fee Typical cost      Application  fee $25 to $50    Origination  fee 1% to 6% of the loan amount    Prepayment  penalty 2% to 5% of the loan amount    Late payment fee $25 to $50 or 3% to 5% of monthly payment    Returned check fee $20 to $50    Payment protection insurance 1% of the loan amount      Rates   Generally, personal loans charge higher interest rates than loans like mortgages or auto loans, but less interest than credit cards do.    Secured loans of all type charge less interest, so a secured personal loan will charge less than an unsecured personal loan will.    The Best Uses for Personal Loans   There are a number of reasons that you might be tempted to use a personal loan.   Debt consolidation   If you have a lot of debt you can use a personal loan to consolidate it. Get a personal loan and use the money to pay off all your existing debts .    That will leave you with one monthly bill to pay instead of many, making it easier to handle.   Home improvement   If you want to do some home improvement or other renovation a personal loan can get you the money you need.    It’s especially helpful if you don’t have enough equity to qualify for a home equity loan or line of credit.   Credit improvement   Your credit score is based on how you’ve handled debt in the past. If you don’t have good credit, you still have a good chance of qualifying for a secured personal loan.    If you make timely payments on the loan you can greatly improve your credit .   Personal Loans Cannot Substitute for an Emergency Fund   It’s important to remember that personal loans aren’t free. You have to pay interest on the money you borrow. Even though the rate is lower than the rate that other loans charge, it can still be expensive.    The goal of an emergency fund is to make dealing with emergencies cheaper by letting you avoid debt.    For that reason, you should not substitute a personal loan with your emergency fund.   Size of an emergency fund   Your emergency fund should be large enough that it will cover any unexpected expenses that come your way. This could be a surprise medical bill, car break down, or some other unpredictable bill.    Also, consider that your emergency fund should be able to cover your expenses for a while should you lose your source of income.    Given these two needs, the common rule of thumb is that your emergency fund should be equal to 3-6 months of expenses.    The exact amount can vary based on your budget’s flexibility and how secure your source of income is.   Use an online savings account   If you have an emergency fund or need to start building one, we recommend that you use an online savings account to store your money.    These accounts tend to charge low or no fees.    They also tend to pay much more interest than savings accounts at traditional banks. That makes them ideal for savings that you don’t need to access on a regular basis.   When Personal Loans Make Sense for Emergencies   If you don’t have an emergency fund, you might need to use a personal loan in a financial emergency.   An absolute last resort   The first thing you should remember is that personal loans should be a last resort reaction to an emergency.    Depending on the size and interest rate of the loan, you could wind up paying thousands of dollars more than you need by getting the loan.    Try to find another way to pay your bill, whether it’s by finding a part-time job, asking friends and family for help, or selling some of your extra possessions.    If you’re still unable to cover the expense, the three things that you should use a personal loan to cover are your shelter, health, and income.   Shelter   If your financial emergency leaves you with the option of taking out a loan or getting evicted or having the heat turned off, go for the personal loan.    It is difficult to escape homelessness or having your essential utilities like heat and electricity turned off.    Using a personal loan to keep the lights on makes sense.   Health   If you are forgoing vital medical care because you can’t afford it, you should take out a personal loan so you can get the help you need.    You shouldn’t let money get in the way of essential medical attention. Your health should always come first.   Income   If your unexpected expense will result in you being unable to earn money, take out a personal loan to cover it.    For example, if your car breaks down and you need your car to get to work, it’s worth taking on a loan to pay for the repair.    If you don’t take out the loan, you’ll have no car and no way to earn the money to repair it, putting you an even worse spot.   Choosing an Affordable Loan   If you do need to get a personal loan, you should try to find the best deal available to you.   What to look for   The first thing to look for in a personal loan is whether the lender will let you borrow enough to cover your expense.    If the lender does offer a large enough loan, then look at the loan’s interest rate and fees. You want to find the loan with the lowest fees and lowest interest rate.    Ideally, you’ll choose the cheapest loan available.    [mbt_calculator_widget type=personal_loans]   Your credit   Like anything that involves borrowing money, your credit score will have a big effect on the loan.       It will determine which loans you qualify for and the interest rate that you are charged.    If you have good credit , look for lenders that target people with good credit as they will be able to offer lower interest rates.   Job loss protection   If you have unstable employment, look for a lender that offers unemployment protection.    Under one of these plans, you can stop making payments if you lose your job, without it affecting your credit. Interest will continue to accrue, but your credit score won’t drop.    That takes some of the stress out of losing your job when you have a lot of bills to pay.   Conclusion   While they shouldn’t be your first or even second choice, personal loans can be a good last resort if you find yourself in a financial emergency.    Their flexibility means you can use one to cover nearly any kind of expense.    Just make sure that you’ve taken the time to look for the best deal available.","contentWithMarkup":"<p><img class=\"aligncenter size-full wp-image-279914\" src=\"https://d187qskirji7ti.cloudfront.net/news/wp-content/uploads/2018/06/car-needs-emergency-repair-e1527964171853.jpg\" alt=\"\" width=\"786\" height=\"524\" data-id=\"279914\" /></p>\n<p><a href=\"https://www.mybanktracker.com/personal-loans\">Personal loans</a> are versatile financial tools.</p>\n<p>You can use a personal loan for nearly any purpose, so long as you can qualify for the loan.</p>\n<p>Of course, because personal loans are loans, you’ll have to pay interest on the money you borrow. That means you shouldn’t take on a personal loan lightly.</p>\n<p>They should be something that you use only when it is necessary.</p>\n<p>However, if you’re facing a true financial emergency, a personal loan can be a big help.</p>\n<h2>What is a Personal Loan</h2>\n<p>A personal loan is an installment loan that is made directly to you, which can be used for nearly any purpose.</p>\n<p>This differentiates them from most other types of loans.</p>\n<p><a href=\"https://www.mybanktracker.com/credit-cards\">Credit cards</a>, for example, can only be used to make purchases at stores that accept cards. Mortgages must be used to buy real estate. Auto loans can only be used to buy a vehicle.</p>\n<p>What makes personal loans unique is their flexibility.</p>\n<h2>Secured vs. Unsecured Personal Loan</h2>\n<p>There are two main types of personal loan, <a href=\"https://www.mybanktracker.com/personal-loans/faq/compare-secured-vs-unsecured-personal-loans-272708\">secured personal loans and unsecured personal loans</a>.</p>\n\n<table id=\"tablepress-164666\" class=\"tablepress tablepress-id-164666\">\n<thead>\n<tr class=\"row-1 odd\">\n\t<th class=\"column-1\"> </th><th class=\"column-2\"> </th><th class=\"column-3\">Unsecured Loans</th><th class=\"column-4\"> </th><th class=\"column-5\"> </th><th class=\"column-6\">Secured Loans </th>\n</tr>\n</thead>\n<tbody class=\"row-hover\">\n<tr class=\"row-2 even\">\n\t<td class=\"column-1\"></td><td class=\"column-2\"></td><td class=\"column-3\"></td><td class=\"column-4\"></td><td class=\"column-5\"></td><td class=\"column-6\"></td>\n</tr>\n<tr class=\"row-3 odd\">\n\t<td class=\"column-1\"><strong>Pros</strong></td><td class=\"column-2\"></td><td class=\"column-3\"><ul><br />\n<li>Great option if you are trying to consolidate existing debts</li><br />\n<li>Does not require any kind of collateral so there is less risk for you</li><br />\n<li>Usually only takes at most a few days to receive funds</li><br />\n</li></td><td class=\"column-4\"><strong>Pros</strong></td><td class=\"column-5\"></td><td class=\"column-6\"><ul><br />\n<li> Easier to qualify for if you have lower credit and/or lower income</li><br />\n<li>Often lower interest rate than unsecured loans</li><br />\n<li>Typically can borrow a larger amount </li><br />\n</ul></td>\n</tr>\n<tr class=\"row-4 even\">\n\t<td class=\"column-1\"><strong>Cons</strong></td><td class=\"column-2\"></td><td class=\"column-3\"><ul><br />\n<li>Interest rates can be higher than secured loans</li> <br />\n<li>Harder to qualify for</li><br />\n<li>Lower lending limits</li><br />\n</ul></td><td class=\"column-4\"><strong>Cons</strong></td><td class=\"column-5\"></td><td class=\"column-6\"><ul><br />\n<li>You put your own assets on the line so you're at risk to lose more</li><br />\n<li>Application process may take longer which could lead to more fees and longer waiting period</li><br />\n<li>If you use savings as collateral, that money becomes unavailable for the duration of the loan </td>\n</tr>\n</tbody>\n</table>\n<!-- #tablepress-164666 from cache -->\n<p>A <strong>secured personal loan</strong> requires that you provide some form of collateral to the lender.</p>\n<p>This could be the balance of a savings account, the title to your vehicle, or something else of value. If you fail to make payments on your loan, the lender will take possession of the collateral to compensate for its loss. You get the collateral back if you pay the loan off.</p>\n<p>Secured loans are easier to qualify for because the lender takes on much less risk.</p>\n<p><strong>Unsecured personal loans</strong> don’t require any collateral.</p>\n<p>You get the loan purely on your word that you’ll pay the loan back. These loans are harder to get because the lender takes on more risk.</p>\n<p>Generally, you need to have a good credit score to qualify for an unsecured loan.</p>\n<h2>Fees</h2>\n<p>There are a <a href=\"https://www.mybanktracker.com/personal-loans/faq/personal-loan-fees-273285\">few fees to watch out for</a> when you’re looking for a personal loan.</p>\n<p>Many lenders charge application fees to compensate for the trouble of processing your application. These are usually a small lump sum of $20-$50.</p>\n<p>Once you’ve gotten approved for the loan, some lenders also charge an origination fee. This covers the cost of depositing the money into your account.</p>\n<p>Origination fees are usually a percentage of the amount you borrow. For example, if you get a $10,000 loan and pay a 5% origination fee, your starting loan balance will be $10,500.</p>\n<p>Finally, some lenders charge early repayment penalties. If you pay your loan back ahead of schedule, the lender might charge you a fee to compensate for its lost interest.</p>\n\n<table id=\"tablepress-164636\" class=\"tablepress tablepress-id-164636\">\n<thead>\n<tr class=\"row-1 odd\">\n\t<th class=\"column-1\">Type of fee</th><th class=\"column-2\">Typical cost</th>\n</tr>\n</thead>\n<tbody class=\"row-hover\">\n<tr class=\"row-2 even\">\n\t<td class=\"column-1\"><strong>Application<br />\n fee</strong></td><td class=\"column-2\">$25 to $50</td>\n</tr>\n<tr class=\"row-3 odd\">\n\t<td class=\"column-1\"><strong>Origination<br />\n fee</strong></td><td class=\"column-2\">1% to 6% of the loan amount</td>\n</tr>\n<tr class=\"row-4 even\">\n\t<td class=\"column-1\"><strong>Prepayment<br />\n penalty</strong></td><td class=\"column-2\">2% to 5% of the loan amount</td>\n</tr>\n<tr class=\"row-5 odd\">\n\t<td class=\"column-1\"><strong>Late payment fee</strong></td><td class=\"column-2\">$25 to $50 or 3% to 5% of monthly payment</td>\n</tr>\n<tr class=\"row-6 even\">\n\t<td class=\"column-1\"><strong>Returned check fee</strong></td><td class=\"column-2\">$20 to $50</td>\n</tr>\n<tr class=\"row-7 odd\">\n\t<td class=\"column-1\"><strong>Payment protection insurance</strong></td><td class=\"column-2\">1% of the loan amount</td>\n</tr>\n</tbody>\n</table>\n<!-- #tablepress-164636 from cache -->\n<h2>Rates</h2>\n<p>Generally, personal loans charge higher interest rates than loans like mortgages or auto loans, but less interest than credit cards do.</p>\n<p>Secured loans of all type charge less interest, so a secured personal loan will charge less than an unsecured personal loan will.</p>\n<div data-ng-controller=\"cc-widget\" ng-init=\"placementSlug=personal_loan-articles-rate-table\"><div class=\"cc-widget\" cc-widget show-filters=\"false\" personal-loans=\"true\" single-display=\"\" compact-view=\"\" show-more=\"\" end-of-article=\"\" slideshow=\"\" ccobj=\"ccobj\" gacategory=\"gacategory\" producttype=\"producttype\" headersname=\"headersname\" ng-if=\"ccobj\" /></div></div>\n<h2>The Best Uses for Personal Loans</h2>\n<p>There are a number of reasons that you might be tempted to use a personal loan.</p>\n<h3>Debt consolidation</h3>\n<p>If you have a lot of debt you can use a personal loan to consolidate it. Get a personal loan and use the money to <a href=\"https://www.mybanktracker.com/personal-loans/faq/how-to-use-personal-loans-debt-consolidation-268197\">pay off all your existing debts</a>.</p>\n<p>That will leave you with one monthly bill to pay instead of many, making it easier to handle.</p>\n<h3>Home improvement</h3>\n<p>If you want to do some <a href=\"https://www.mybanktracker.com/personal-loans/faq/when-use-personal-loans-home-improvement-269071\">home improvement or other renovation</a> a personal loan can get you the money you need.</p>\n<p>It’s especially helpful if you don’t have enough equity to qualify for a home equity loan or line of credit.</p>\n<h3>Credit improvement</h3>\n<p><a href=\"https://www.mybanktracker.com/credit-cards/credit-score/what-is-the-fico-score-263578\">Your credit score</a> is based on how you’ve handled debt in the past. If you don’t have good credit, you still have a good chance of qualifying for a secured personal loan.</p>\n<p>If you make timely payments on the loan you can greatly <a href=\"https://www.mybanktracker.com/personal-loans/faq/credit-builder-loans-277027\">improve your credit</a>.</p>\n<h2>Personal Loans Cannot Substitute for an Emergency Fund</h2>\n<p>It’s important to remember that personal loans aren’t free. You have to pay interest on the money you borrow. Even though the rate is lower than the rate that other loans charge, it can still be expensive.</p>\n<p>The goal of an <a href=\"https://www.mybanktracker.com/savings/faq/how-much-keep-emergency-fund-275238\">emergency fund</a> is to make dealing with emergencies cheaper by letting you avoid debt.</p>\n<p>For that reason, you should not substitute a personal loan with your emergency fund.</p>\n<h3>Size of an emergency fund</h3>\n<p>Your emergency fund should be large enough that it will cover any unexpected expenses that come your way. This could be a surprise medical bill, car break down, or some other unpredictable bill.</p>\n<p>Also, consider that your emergency fund should be able to cover your expenses for a while should you lose your source of income.</p>\n<p>Given these two needs, the common rule of thumb is that your emergency fund should be equal to 3-6 months of expenses.</p>\n<p>The exact amount can vary based on your budget’s flexibility and how secure your source of income is.</p>\n<h3>Use an online savings account</h3>\n<p>If you have an emergency fund or need to start building one, we recommend that you use an <a href=\"https://www.mybanktracker.com/savings\">online savings account</a> to store your money.</p>\n<p>These accounts tend to charge low or no fees.</p>\n<p>They also tend to pay much more interest than savings accounts at traditional banks. That makes them ideal for savings that you don’t need to access on a regular basis.</p>\n<h2>When Personal Loans Make Sense for Emergencies</h2>\n<p>If you don’t have an emergency fund, you might need to use a personal loan in a financial emergency.</p>\n<h3>An absolute last resort</h3>\n<p>The first thing you should remember is that personal loans should be a last resort reaction to an emergency.</p>\n<p>Depending on the size and interest rate of the loan, you could wind up paying thousands of dollars more than you need by getting the loan.</p>\n<p>Try to find another way to pay your bill, whether it’s by finding a part-time job, asking friends and family for help, or selling some of your extra possessions.</p>\n<p>If you’re still unable to cover the expense, the three things that you should use a personal loan to cover are your shelter, health, and income.</p>\n<h3>Shelter</h3>\n<p>If your financial emergency leaves you with the option of taking out a loan or getting evicted or having the heat turned off, go for the personal loan.</p>\n<p>It is difficult to escape homelessness or having your essential utilities like heat and electricity turned off.</p>\n<p>Using a personal loan to keep the lights on makes sense.</p>\n<h3>Health</h3>\n<p>If you are forgoing vital medical care because you can’t afford it, you should take out a personal loan so you can get the help you need.</p>\n<p>You shouldn’t let money get in the way of essential medical attention. Your health should always come first.</p>\n<h3>Income</h3>\n<p>If your unexpected expense will result in you being unable to earn money, take out a personal loan to cover it.</p>\n<p>For example, if your car breaks down and you need your car to get to work, it’s worth taking on a loan to pay for the repair.</p>\n<p>If you don’t take out the loan, you’ll have no car and no way to earn the money to repair it, putting you an even worse spot.</p>\n<h2>Choosing an Affordable Loan</h2>\n<p>If you do need to get a personal loan, you should try to find the best deal available to you.</p>\n<h3>What to look for</h3>\n<p>The first thing to look for in a personal loan is whether the lender will let you borrow enough to cover your expense.</p>\n<p>If the lender does offer a large enough loan, then look at the loan’s interest rate and fees. You want to find the loan with the lowest fees and lowest interest rate.</p>\n<p>Ideally, you’ll choose the cheapest loan available.</p>\n<p>[mbt_calculator_widget type=personal_loans]</p>\n<h3>Your credit</h3>\n<p>Like anything that involves borrowing money, your credit score will have a big effect on the loan.</p>\n<p><img class=\"aligncenter size-full wp-image-276122\" src=\"https://d187qskirji7ti.cloudfront.net/news/wp-content/uploads/2018/04/fico-credit-score-ranges-e1524456439384.jpg\" alt=\"\" width=\"786\" height=\"509\" data-id=\"276122\" /></p>\n<p>It will determine which loans you qualify for and the interest rate that you are charged.</p>\n<p>If you have <a href=\"https://www.mybanktracker.com/credit-cards/credit-score/what-is-good-credit-score-range-254241\">good credit</a>, look for lenders that target people with good credit as they will be able to offer lower interest rates.</p>\n<h3>Job loss protection</h3>\n<p>If you have unstable employment, look for a lender that offers unemployment protection.</p>\n<p>Under one of these plans, you can stop making payments if you lose your job, without it affecting your credit. Interest will continue to accrue, but your credit score won’t drop.</p>\n<p>That takes some of the stress out of losing your job when you have a lot of bills to pay.</p>\n<h2>Conclusion</h2>\n<p>While they shouldn’t be your first or even second choice, personal loans can be a good last resort if you find yourself in a financial emergency.</p>\n<p>Their flexibility means you can use one to cover nearly any kind of expense.</p>\n<p>Just make sure that you’ve taken the time to look for the best deal available.</p>","tags":["FAQ","MBT Rails","Personal Loans"],"publishedDate":"2018-06-01T19:35:31Z","harvestDate":"2018-06-02T21:24:20Z","estimatedPublishedDate":"2018-06-01T19:35:31Z","url":"http://ct.moreover.com/?a=34207110507&p=1u0&v=1&x=nQDm780YeOyjwjWZigA5JQ","originalUrl":"https://www.mybanktracker.com/news/personal-loan-emergency","commentsUrl":"https://www.mybanktracker.com/news/personal-loan-emergency#respond","outboundUrls":[],"wordCount":"1638","dataFormat":"text","duplicateGroupId":"34207110507","media":{"audio":[],"images":[{"url":"https://d187qskirji7ti.cloudfront.net/news/wp-content/uploads/2018/04/fico-credit-score-ranges-e1524456439384.jpg"},{"url":"https://d187qskirji7ti.cloudfront.net/news/wp-content/uploads/2018/06/car-needs-emergency-repair-e1527964171853.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Personal finance news","group":"Finance"}],"companies":[],"author":{"name":"Thomas (TJ) Porter","publishingPlatform":{}},"licenses":[],"source":{"name":"MyBankTracker","homeUrl":"https://www.mybanktracker.com/news","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"94920156","name":"MyBankTracker","mediaType":"Blog","publishingPlatform":"WordPress","generator":"http://wordpress.org/?v=4.2.2","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"6","autoRankOrder":"76281","inboundLinkCount":"3"},"inWhiteList":"true","autoTopics":["ugc financial feeds"]}},"es_id":86990323}