{"sequenceId":"845367331571","id":"34207263432","language":"English","title":"Gardening the Community celebrates opening of Walnut Street farm stand","content":"SPRINGFIELD --  Gardening the Community welcomed city residents to its Walnut Street location Saturday to show off a new farm stand where vegetables, herbs and other produce harvested by the Springfield-based food justice and youth development organization will be available for purchase.  Dozens turned out to the GTC garden and farm stand, located at the corner of Walnut and James Streets, on Saturday morning to celebrate the new structure, which will house the organization's farm share pick-ups, cooking workshops, community gatherings and other events.  Dondre Scott, a 21-year-old GTC staff member and youth leader, said Saturday's farm stand opening highlights the organization's years of work to transform the site.  \"We purchased the Walnut Street site. As you can see, it's grown from sort of a wild wasteland of weeds and such with a concrete building and parking lot and we really changed it into something that really creates sense of purpose,\" he said in an interview.  Scott said the although the market stand will sell food grown at the Walnut Street garden and greenhouse, it will also feature produce from GTC's Hancock Street and Central Street locations.  \"It acts as a focal point for, not only us, but for the community. It's something that is ours -- it's nobody else's -- and with all of the help of the community. That's the big thing. It's because of the community that we're able to do it,\" he said. \"This whole event today is to show everybody not only the farm stand, but what GTC has become over the last four years that we've worked to create this site.\" Ibrahim Ali, GTC's co-director, said it was important for the organization to claim a permanent space to grow food for the Mason Square community.  \"We are excited to now have built a structure on the site where we can bring people together around healthy food in any weather and any season,\" she said in a statement. Gardening the Community inspires Springfield teens to grow, eat, fresh, healthy produce The farm stand will be open from 11 a.m. to 7 p.m. on Wednesday and Thursdays, and from 10 a.m. to 5 p.m. on Saturdays, beginning in mid-June. GTC's farm share program, GTC EATS!, meanwhile, will allow members to pick up shares of pesticide-free vegetables from mid-June to October on Wednesday and Thursdays at the Walnut Street farm. GTC noted that the farm and farm stand's development was supported by an array of donors, including: the Massachusetts Department of Agriculture Resources, MassMutual's Mutual Impact Program, the Harvard Pilgrim Health Care Foundation and the Community Foundation of Western Massachusetts and community members. ","contentWithMarkup":"Gardening the Community welcomed city residents to its Walnut Street location Saturday to show off a new farm stand where vegetables, herbs and other produce harvested by the Springfield-based food justice and youth development organization will be available for purchase.","tags":["cat:Events","tag:gardening-the-community","tag:mason-square","tag:springfield"],"publishedDate":"2018-06-02T21:06:32Z","harvestDate":"2018-06-02T22:00:20Z","estimatedPublishedDate":"2018-06-02T21:06:32Z","url":"http://ct.moreover.com/?a=34207263432&p=1u0&v=1&x=yngeoSjwyuZ7h3s_MFiw4g","originalUrl":"http://www.masslive.com/news/index.ssf/2018/06/gardening_the_community_celebr.html","outboundUrls":[],"wordCount":"429","dataFormat":"text","duplicateGroupId":"34207141349","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Shannon Young | syoung@repub.com","publishingPlatform":{}},"licenses":[],"source":{"name":"News","homeUrl":"http://www.masslive.com/news/index.ssf/","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"71945125","name":"News","mediaType":"Blog","publishingPlatform":"Movable Type","generator":"Movable Type Enterprise 4.29-advance http://www.sixapart.com/movabletype/","tags":[],"language":"English","dataFormat":"Image","rank":{"autoRank":"1","autoRankOrder":"1065","inboundLinkCount":"2294"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994831}