{"sequenceId":"845363518675","id":"34207154239","language":"English","title":"Which type of milk is right for you?","content":"The demand for alternatives to dairy milk has grown significantly over the past 30 years. Whether you're shopping for a substitute due to medical necessity, personal preference, health, sustainability, or cost concerns, switching to a different dairy or non-dairy milk can be confusing. With more and more options on the market, it can be difficult to decide which is best for you. We're here to help. Our milk guide gives you pros and cons for each type as well as breaks down each option by nutrition, price, and taste so you can sip with satisfaction. Need all this information in an easy-to-use guide? Print this handy milk chart and use it to help you make a choice for you and your family. DAIRY MILKCow's Milk NutritionWhole: 150 calories; 4.6g sat fat; 8g protein; 12g carb2%: 125 calories; 2.9g sat fat; 8g protein; 12g carb1%: 102 calories: 1.5g sat fat; 8g protein; 12g carbSkim: 83 calories; 0.1g sat fat; 8g protein; 12g carb Price (per 8 fl. oz.) Conventional: $0.30 Organic: $0.58 Grass-Fed Organic: $0.75 Pros A naturally good source of protein, calcium, and potassium, it's also fortified with vitamins A and D and offers a good protein-to-carb balance. Cow's milk, along with goat's milk, does not include synthetic thickeners (as most nondairy milks do). Cons Fat levels vary greatly between skim and whole; the more fat, the higher the calories. While fat aids in mineral absorption and satiety, most of the fat is saturated. Cow’s milk, as an animal product, contains trace amounts of naturally occurring hormones. But organic milk is free of synthetic hormones, as is milk labeled 'No rBST.’ If you’re concerned about hormones, keep in mind that the FDA has deemed the use of rBST as safe—milk from cows treated with hormones doesn’t appear to have any effect on humans. Taste Test Depending on the type, the flavor is rich, creamy, and slightly sweet (whole); moderately rich (2% and 1%); or very mild and bland (skim).Goat's Milk NutritionWhole: 140 calories; 7g sat fat; 8g protein; 12g carbLow-Fat: 100 calories; 1.5g sat fat; 8g protein; 11g carb Price (per 8 fl. oz.) $1.16 Pros A naturally good source of protein, calcium, and vitamin A, it also contains less lactose, making it a dairy milk that some with lactose intolerance can drink. Cons Whole goat's milk has the most saturated fat per glass of any milk—more than half the daily recommended amount. Sat fat has been shown to raise blood cholesterol levels. Taste Test Similar to cow's milk in consistency and color, with a pronounced goat flavor (think drinkable goat cheese). © Photo: Greg Dupree NONDAIRY ALTERNATIVESSoy Milk Nutrition: 80 calories; 0.5 sat fat; 7g protein; 4g carb Price (per 8 fl. oz.) $0.39 Pros Soy was the first nondairy milk that could rival the protein in dairy until pea milk arrived. Usually fortified with calcium and vitamins B12 and D. Cons Soy milk is rich in isoflavones, once thought to encourage cancer growth—though current research shows no correlation. Taste Test Creamy beige in color with a subtly nutty, bean flavor; good for boosting protein in smoothies and as a milk substitute in baking.Nut Milks (almond, cashew) Nutrition 25-60 calories; 0g sat fat; 0-2g protein; 1-2g carb Price (per 8 fl. oz.) $0.41 Pros Lower in calories than all other milks, nut milks also have negligible sat fat and are usually fortified with calcium and vitamins A and D. Cons Most nut milks offer no significant protein and little vitamin E unless fortified (despite the fact that nuts themselves are rich in protein and vitamin E). Taste Test Creamy consistency and subtle flavor of the nut they originated from; good for smoothies and oatmeal or for stirring into coffee. How to Make Your Own Almond Milk Have you jumped on the almond milk bandwagon yet? If you check out labels on many store-bought brands, you'll often find sugar, stabilizers, and other additives. Watch this video to learn how to make your own nut milk at home. Pea Milk Nutrition 75 calories; 0.5g sat fat; 8g protein; 0g carb Price (per 8 fl. oz.) $0.72 Pros Other than soy, pea milk is the only option that rivals the protein in cow's milk. It's also a source of iron and fortified with vitamins A and D, calcium, and omega-3 fatty acids. Cons There is only one brand available; it adds sunflower oil for creaminess, which is primarily omega-6 fatty acids, the type that can contribute to inflammation (and most Americans need to cut back on). Taste Test Thick, creamy texture with definite legume flavor and slight bitter note on the finish; good for using in a savory soup in place of cream to reduce saturated fat.Rice Milk Nutrition 70 calories; 0g sat fat; 0g protein; 11g carb Price (per 8 fl. oz.) $0.47 Pros It's low in calories, with most coming from carbyhydrates. It has no saturated fat or lactose and is usually fortified with calcium and vitamins B12 and D. Cons While some start with brown rice, most producers refine it in processing, losing the extra nutrients offered in whole grains. It's lowest in protein, too. Taste Test Almost identical to skim cow's milk in color and consistency with a sweet, slightly nutty flavor; a good option for cereal.Coconut Milk Nutrition 45 calories; 4g sat fat; 0g protein; 2g carb Price (per 8 fl. oz.) $0.41 Pros It comes closest in creaminess to 2% or whole milk, thanks to fat content. It's also lactose-free and fortified with calcium and vitamin D. Cons Its fat content comes almost entirely from saturated fat, and it has negligible protein. Taste Test Thick with a slightly tart flavor and faint coconut aftertaste; use with canned coconut milk to cut fat.Oat Milk Nutrition 130 calories; 0g sat fat; 4g protein; 24g carb Price (per 8 fl. oz.) $0.65 Pros Highest in protein among nut and grain milks; 2g fiber per cup. Lactose-free; fortified with calcium and vitamin D. Cons It has more calories than other nondairy options and double the carbohydrates of dairy milk. Taste Test Color and texture are similar to eggnog, and it has a naturally sweet oat flavor. Need all this information in an easy-to-use guide? Print this handy milk chart and use it to help you make a choice for you and your family. © Photo: Greg Dupree Disclaimer: Views expressed in this article are the author's own and MSN does not endorse them in any way. Neither can MSN independently verify any claims made in the article. You should consult your physician before starting any weight loss or health management programme to determine if it is right for your needs.","contentWithMarkup":"<img align=\"left\" src=\"http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAy7rpZ.img?h=100&w=100&m=6&q=60&o=f&l=f\" />","tags":[],"harvestDate":"2018-06-02T21:35:04Z","estimatedPublishedDate":"2018-06-02T21:35:04Z","url":"http://ct.moreover.com/?a=34207154239&p=1u0&v=1&x=olnQ6Jzt-2LK-TT7xVlu1w","originalUrl":"https://www.msn.com/en-in/lifestyle/lifestylegeneral/which-type-of-milk-is-right-for-you/ar-AAy8dvD?srcref=rss","outboundUrls":["https://www.cookinglight.com/microsites/pdf/alternative-milk-spread-1703.pdf"],"wordCount":"1073","dataFormat":"text","duplicateGroupId":"34202559778","media":{"audio":[],"images":[{"url":"http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAy7rpZ.img?h=100&w=100&m=6&q=60&o=f&l=f"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"publishingPlatform":{}},"licenses":[],"source":{"name":"Style, Beauty & Fashion News, Horoscope, Relationship News | MSN India","homeUrl":"http://www.msn.com/en-in/lifestyle/","location":{"country":"India","countryCode":"IN","region":"Asia","subregion":"Southern Asia"},"feed":{"id":"182236815","name":"Style, Beauty & Fashion News, Horoscope, Relationship News | MSN India","mediaType":"Blog","description":"Get the latest beauty and fashion trends, horoscopes, relationship advice, smart living tips and more.","tags":[],"copyright":"MSN India","language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":["ugc food feeds","ugc sport feeds","ugc recreation feeds","ugc arts feeds","ugc health feeds"],"editorialTopics":["Lifestyle","Consumer"]}},"es_id":86991772}