{"sequenceId":"845366174338","id":"34207234128","language":"English","title":"Why I’ll miss BSM","content":"Why I’ll miss BSM Close BSM flag flying high. Zach Zeman Zach Zeman BSM flag flying high. Sarah Hansberry, Staff Writer June 2, 2018 Share on Facebook Share on Twitter Share via Email\tClose Modal Window Hang on for a minute...we're trying to find some more stories you might like. Close Close Modal Window Email This Story Send email to this address Enter Your Name Add a comment here Verification Send Email Cancel As the class of 2018 nears the end of their high school careers, emotions are brewing and the excitement is overwhelming. Many students have mixed feelings about ending this important chapter of their lives. For some, it’s the pure joy of never having to use a bathroom pass again, and for some, it’s utter sadness as they will have to leave behind friends, family, and everything familiar. For me, it’s bittersweet. It’s the chance to meet new people and spread my wings, but leaving behind my friends, family, and most importantly my school will be difficult. High school has given me both the best and worst times of my life which has been an intricate part of discovering who I am and who I want to be. I credit this to my school as well as my peers. This is why I’ll miss BSM. There is no greater feeling than walking in the building every morning and being immediately greeted with smiling faces and genuine, “Hellos.” Walking through the halls and knowing almost everyone by name is a tremendous gift, one that many of us seem to take for granted. Having teachers that care about your success not only in class but also in extracurriculars showcases the community that BSM offers. The support given by faculty, teachers, and students alike is something very special, and I will greatly miss that next year. I will miss the community at BSM. The opportunity to get involved in a variety of clubs and sports is something unique to BSM. It is rare that you find a student more well rounded than a Red Knight merely because we have the chance to play multiple varsity sports and have leadership roles in several clubs. These opportunities come partly because of a smaller sized school, but also because we are encouraged to get involved in as many things as our schedules allow. Additionally, Red Knights are known for being outstanding volunteers and participating in service events all over the Twin Cities. I will miss being involved in over a dozen clubs and sports next year like I was at BSM. “ The support given by faculty, teachers, and students alike is something very special, and I will greatly miss that next year.” — Sarah Hansberry Benilde-St. Margaret’s has changed my life for the better by teaching me how to be the best person I can be in addition to the rigorous curriculum. I have enjoyed each semester of high school and I am devastated that my time here is almost over. Several of my fellow senior classmates can’t wait to finish high school and move on to college, but I know they’ll look back and regret wishing the final weeks of high school away. This is the very reason I smile at people and say hello as I walk into school every day, and why I continue to involve myself in new activities even as late as the spring of my senior year. BSM has been more than a high school to me. It’s been my family and my support system, and that is why I’ll miss BSM.  ","contentWithMarkup":"As the class of 2018 nears the end of their high school careers, emotions are brewing and the excitement is overwhelming. Many students have mixed feelings about ending this important chapter of their lives. For some, it’s the pure joy of never having to use a bathroom pass again, and for some, it’s utter sadness...","tags":["OPINIONS","Showcase","TOP STORIES"],"publishedDate":"2018-06-02T21:51:04Z","harvestDate":"2018-06-02T21:54:22Z","estimatedPublishedDate":"2018-06-02T21:51:04Z","url":"http://ct.moreover.com/?a=34207234128&p=1u0&v=1&x=ujM0Q4nEPQUTLCsGBfep4A","originalUrl":"https://bsmknighterrant.org/2018/06/02/why-ill-miss-bsm/","commentsUrl":"https://bsmknighterrant.org/2018/06/02/why-ill-miss-bsm/#respond","outboundUrls":["https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fbsmknighterrant.org%2F2018%2F06%2F02%2Fwhy-ill-miss-bsm%2F","https://twitter.com/intent/tweet?text=Why+I%26%238217%3Bll+miss+BSM&url=https%3A%2F%2Fbsmknighterrant.org%2F%3Fp%3D56465"],"wordCount":"590","dataFormat":"text","duplicateGroupId":"34207234128","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Sarah Hansberry, Staff Writer","publishingPlatform":{}},"licenses":[],"source":{"name":"Knight Errant","homeUrl":"https://bsmknighterrant.org","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"65045395","name":"Knight Errant","mediaType":"Blog","publishingPlatform":"WordPress","generator":"https://wordpress.org/?v=4.9.6","description":"The student news site of Benilde-St. Margaret's School in St. Louis Park, MN","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"6","autoRankOrder":"58587","inboundLinkCount":"5"},"inWhiteList":"true","autoTopics":["ugc health feeds"]}},"es_id":86994142}