{"sequenceId":"845367451984","id":"34207268014","language":"English","title":"Saturday Night Showcase: He-Man & She-Ra: The Secret Of The Sword","content":"One of the reasons He-Man And The Masters Of The Universe was so good was the way it treated its female cast. They were all just as strong as the male heroes without giving up their femininity or being all angry and snarky; just the occasional one-liner matching their characters. So I wouldn’t be surprised to see the show was a hit with little girls as much as it was little boys. However, the toy industry has this issue with girls liking “boys toys” and vice versa, leading to the toy shelves being about as integrated as an elementary school dance–boys over there, girls over there, occasionally only meeting to get punch and snacks. So when Mattel launched a girls version of Masters Of The Universe, entitled Princess Of Power, I’m sure that they planned to give girls their own Masters-type fantasy action line. But don’t play with those boys. These are the only commercials I know of in which She-Ra is actually depicted fighting evil. Usually it’s about how strong she is and how fun it is to comb her hair. Fans of my Free Comic Inside article series has also seen how girly She-Ra and her friends are depicted as the minicomics is basically She-Ra and Catra fighting over Bow, jewels, and dress-up clothes with one story having her conquer anything. Which I still maintain was Catra getting confused over what a “prom queen” is. Throw in how psycho She-Ra and Castaspella have come out thus far in my readings and I don’t think Mattel understood what drew girls to this franchise. Compare that to the cartoon, as She-Ra and her friends are fighting a war for control of Etheria against the Evil Horde, a group who on the toy shelves were part of the Masters Of The Universe line. This was a show that was filled with the same action and morals as her brother’s without getting too girly or too butch. And it all started with The Secret Of The Sword. This was later edited into the five part She-Ra: Princess Of Power episode “The Sword Of She-Ra”, with each episode having their own title. I had this in a previous Saturday Night Showcase, but for some reason Dreamworks (who now owns this portion of Filmation’s library–which was sold all over like Rankin Bass’ works) took those down and have been posting She-Ra episodes over on the He-Man channel and it looks like they’re slowly shutting down She-Ra’s channel. With a NEW She-Ra cartoon coming to Netflix (I’ll comment when they release more info about it to see if it will be good or another Thundercats Roar in terms of respecting the source) you’d think they’d push the original channel to give fans a look back…unless they’re hoping to subplant the old show like so many others. They have, however, posted The Secret Of The Sword to the official channel, which means I can now free and clear bring it to you. Enjoy! When the movie was translated into the five-parter some extra scenes were added so if you feel like something is missing you’re probably thinking of the TV version. For the first two episodes they also added an Dreamworks also seems to hate closing credits since they keep dropping them from He-Man, She-Ra, and Bravestarr. As a bonus video here is the music video for “I Have The Power”, the theme song from the movie. You’ll notice some different animation, including Orko (who wasn’t in the movie). Whether this was all original or based on test footage I couldn’t tell you. I don’t want this feature to be stuck in the past so I think next week I’m going to do something a little different with Saturday Night Showcase. Advertisements Posted by ShadowWing Tronix on June 2, 2018 in Animation Spotlight, Movie Spotlight, Television Spotlight and tagged He-Man, He-Man and the Masters of the Universe, Secret of the Sword, She-Ra, She-Ra: Princess of Power, The Secret Of The Sword.\tLeave a comment About ShadowWing Tronix A would be comic writer looking to organize his living space as well as his thoughts. So I have a blog for each goal. :)\tView all posts by ShadowWing Tronix »","contentWithMarkup":"The movie that introduced kids to She-Ra, He-Man's twin sister, in time with the announcement of a new She-Ra series.","tags":["Animation Spotlight","Movie Spotlight","Television Spotlight","He-Man","He-Man and the Masters of the Universe","Secret of the Sword","She-Ra","She-Ra: Princess of Power","The Secret Of The Sword"],"publishedDate":"2018-06-02T22:00:15Z","harvestDate":"2018-06-02T22:01:13Z","estimatedPublishedDate":"2018-06-02T22:00:15Z","url":"http://ct.moreover.com/?a=34207268014&p=1u0&v=1&x=o9Aptalq_lKyI4qYmW8T1g","originalUrl":"https://bwspotlight.com/2018/06/02/saturday-night-showcase-he-man-she-ra-the-secret-of-the-sword/","outboundUrls":[],"wordCount":"699","dataFormat":"text","duplicateGroupId":"34207268014","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"38967"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"ShadowWing Tronix","publishingPlatform":{"userId":"5436063"}},"licenses":[],"source":{"name":"BW Media Spotlight","homeUrl":"http://bwspotlight.com","location":{},"feed":{"id":"586734361","name":"BW Media Spotlight","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"5191096","generator":"http://wordpress.com/","description":"examining the art of storytelling","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"5","autoRankOrder":"31412","inboundLinkCount":"15"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994984}