{"sequenceId":"845365787414","id":"34207223805","language":"English","title":"It’s OK to leave Facebook","content":"The slow-motion privacy train wreck that is Facebook has many users, perhaps you, thinking about leaving or at least changing the way you use the social network. Fortunately for everyone but Mark Zuckerberg, it’s not nearly has hard to leave as it once was. The main thing to remember is that social media is for you to use, and not vice versa.    Social media has now become such an ordinary part of modern life that, rather than have it define our interactions, we can choose how we engage with it. That’s great! It means that everyone is free to design their own experience, taking from it what they need instead of participating to an extent dictated by social norms or the progress of technology.    Here’s why now is a better time than ever to take control of your social media experience. I’m going to focus on Facebook, but much of this is applicable to Instagram, Twitter, LinkedIn, and other networks as well.   Stalled innovation means a stable product   The Facebooks of 2005, 2010, and 2015 were very different things and existed in very different environments. Among other things over that eventful ten-year period, mobile and fixed broadband exploded in capabilities and popularity; the modern world of web-native platforms matured and became secure and reliable; phones went from dumb to smart to, for many, their primary computer; and internet-based companies like Google, Facebook, and Amazon graduated from niche players to embrace and dominate the world at large.    It’s been a transformative period for lots of reasons and in lots of ways. And products and services that have been there the whole time have been transformed almost continuously. You’d probably be surprised at what they looked like and how limited they were not long ago. Many things we take for granted today online were invented and popularized just in the last decade.    But the last few years have seen drastically diminished returns. Where Facebook used to add features regularly that made you rely on it more and more, now it is desperately working to find ways to keep people online. Why is that?    Well, we just sort of reached the limit of what a platform like Facebook can or should do, that’s all! Nothing wrong with that.    It’s like improving a car — no matter how many features you add or engines you swap in, it’ll always be a car. Cars are useful things, and so is Facebook. But a car isn’t a truck, or a bike, or an apple, and Facebook isn’t (for example) a broadcast medium, a place for building strong connections, or a VR platform (as hard as they’re trying).    The things that Facebook does well and that we have all found so useful — sharing news and photos with friends, organizing events, getting and staying in contact with people — haven’t changed considerably in a long time. And as the novelty has worn off those things, we naturally engage in them less frequently and in ways that make more sense to us.    Facebook has become the platform it was intended to be all along, with its own strengths and weaknesses, and its failure to advance beyond that isn’t a bad thing. In fact, I think stability is a good thing. Once you know what something is and will be, you can make an informed choice about it.   The downsides have become obvious   Every technology has its naysayers, and social media was no exception — I was and to some extent remain one myself. But over the years of changes these platforms have gone through, some fears were shown to be unfounded or old-fashioned.    The idea that people would cease interacting in the “real world” and live in their devices has played out differently from how we expected, surely; trying to instruct the next generation on the proper way to communicate with each other has never worked out well for the olds. And if you told someone in 2007 that foreign election interference would be as much a worry for Facebook as oversharing and privacy problems, you might be met with incredulous looks.    Other downsides were for the most part unforeseen. The development of the bubble or echo chamber, for instance, would have been difficult to predict when our social media systems weren’t also our news-gathering systems. And the phenomenon of seeing only the highlights of others’ lives posted online, leading to self esteem issues in those who view them with envy, is an interesting but sad development.    Whether some risk inherent to social media was predicted or not, or proven or not, people now take such risks seriously. The ideas that one can spend too much time on social networks, or suffer deleterious effects from them, or feel real pain or turmoil because of interactions on them are accepted (though sadly not always without question).    Taking the downsides of something as seriously as the upsides is another indicator of the maturity of that thing, at least in terms of how society interacts with it. When the hype cycle winds down, realistic judgment takes its place and the full complexities of a relationship like the one between people and social media can be examined without interference.    Between the stability of social media’s capabilities and the realism with which those capabilities are now being considered, choice is no longer arbitrary or absolute. Your engagement is not being determined by them any more.   Social media has become a rich set of personal choices   Your experience may differ from mine here, but I feel that in those days of innovation among social networks your participation was more of a binary. You were either on or you were off.    The way they were advancing and changing defined how you engaged with them by adding and opting you into features, or changing layouts and algorithms. It was hard to really choose how to engage in any meaningful way when the sands were shifting under your feet (or rather, fingertips). Every few months brought new features and toys and apps, and you sort of had to be there, using them as proscribed, or risk being left behind. So people either kept up or voluntarily stayed off.    Now all that has changed. The ground rules are set, and have been for long enough that there is no risk that if you left for a few months and come back, things would be drastically different.    As social networks have become stable tools used by billions, any combination or style of engagement with them has become inherently valid.    Your choice to engage with Facebook or Instagram does not boil down to simply whether you are on it or not any more, and the acceptance of social media as a platform for expression and creation as well as socializing means that however you use it or present on it is natural and no longer (for the most part) subject to judgment.    That extends from choosing to make it an indispensable tool in your everyday life to quitting and not engaging at all. There’s no longer an expectation that the former is how a person must use social media, and there is no longer a stigma to the latter of disconnectedness or Luddism.    You and I are different people. We live in different places, read different books, enjoy different music. We drive different cars, prefer different restaurants, like different drinks. Why should we be the same in anything as complex as how we use and present ourselves on social media?    It’s analogous, again, to a car: you can own one and use it every day for a commute, or use it rarely, or not have one at all — who would judge you? It has nothing to do with what cars are or aren’t, and everything to do with what a person wants or needs in the circumstances of their own life.    For instance, I made the choice to remove Facebook from my phone over a year ago. I’m happier and less distracted, and engage with it deliberately, on my terms, rather than it reaching out and engaging me. But I have friends who maintain and derive great value from their loose network of scattered acquaintances, and enjoy the immediacy of knowing and interacting with them on the scale of minutes or seconds. And I have friends who have never been drawn to the platform in the first place, content to select from the myriad other ways to stay in touch.    These are all perfectly good ways to use Facebook! Yet only a few years ago the zeitgeist around social media and its exaggerated role in everyday life — resulting from novelty for the most part — meant that to engage only sporadically would be more difficult, and to disengage entirely would be to miss out on a great deal (or fear that enough that quitting became fraught with anxiety). People would be surprised that you weren’t on Facebook and wonder how you got by.   Try it and be delighted   Social networks are here to improve your life the same way that cars, keyboards, search engines, cameras, coffee makers, and everything else are: by giving you the power to do something. But those networks and the companies behind them were also exerting power over you and over society in general, the way (for example) cars and car makers exerted power over society in the ’50s and ’60s, favoring highways over public transportation.    Some people and some places, more than others, are still subject to the influence of car makers — ever try getting around L.A. without one? And the same goes for social media — ever try planning a birthday party without it? But the last few years have helped weaken that influence and allow us to make meaningful choices for ourselves.    The networks aren’t going anywhere, so you can leave and come back. Social media doesn’t control your presence.    It isn’t all or nothing, so you can engage at 100 percent, or zero, or anywhere in between. Social media doesn’t decide how you use it.    You won’t miss anything important, because you decide what is important to you. Social media doesn’t share your priorities.    Your friends won’t mind, because they know different people need different things. Social media doesn’t care about you.    Give it a shot. Pick up your phone right now and delete Facebook. Why not? The absolute worst that will happen is you download it again tomorrow and you’re back where you started. But it could also be, as it was for me and has been for many people I’ve known, like shrugging off a weight you didn’t even realize you were bearing. Try it.               Read More At Article Source | Article Attribution    The post It’s OK to leave","contentWithMarkup":"The slow-motion privacy train wreck that is Facebook has many users, perhaps you, thinking about leaving or at least changing the way you use the social network. Fortunately for everyone but Mark Zuckerberg, it’s not nearly has hard to leave as it once was. The main thing to remember is that social media is for you to use, and not vice versa.    Social media has now become such an ordinary part of modern life that, rather than have it define our interactions, we can choose how we engage with it. That’s great! It means that everyone is free to design their own experience, taking from it what they need instead of participating to an extent dictated by social norms or the progress of technology.    Here’s why now is a better time than ever to take control of your social media experience. I’m going to focus on Facebook, but much of this is applicable to Instagram, Twitter, LinkedIn, and other networks as well.   Stalled innovation means a stable product   The Facebooks of 2005, 2010, and 2015 were very different things and existed in very different environments. Among other things over that eventful ten-year period, mobile and fixed broadband exploded in capabilities and popularity; the modern world of web-native platforms matured and became secure and reliable; phones went from dumb to smart to, for many, their primary computer; and internet-based companies like Google, Facebook, and Amazon graduated from niche players to embrace and dominate the world at large.    It’s been a transformative period for lots of reasons and in lots of ways. And products and services that have been there the whole time have been transformed almost continuously. You’d probably be surprised at what they looked like and how limited they were not long ago. Many things we take for granted today online were invented and popularized just in the last decade.    But the last few years have seen drastically diminished returns. Where Facebook used to add features regularly that made you rely on it more and more, now it is desperately working to find ways to keep people online. Why is that?    Well, we just sort of reached the limit of what a platform like Facebook can or should do, that’s all! Nothing wrong with that.    It’s like improving a car — no matter how many features you add or engines you swap in, it’ll always be a car. Cars are useful things, and so is Facebook. But a car isn’t a truck, or a bike, or an apple, and Facebook isn’t (for example) a broadcast medium, a place for building strong connections, or a VR platform (as hard as they’re trying).    The things that Facebook does well and that we have all found so useful — sharing news and photos with friends, organizing events, getting and staying in contact with people — haven’t changed considerably in a long time. And as the novelty has worn off those things, we naturally engage in them less frequently and in ways that make more sense to us.    Facebook has become the platform it was intended to be all along, with its own strengths and weaknesses, and its failure to advance beyond that isn’t a bad thing. In fact, I think stability is a good thing. Once you know what something is and will be, you can make an informed choice about it.   The downsides have become obvious   Every technology has its naysayers, and social media was no exception — I was and to some extent remain one myself. But over the years of changes these platforms have gone through, some fears were shown to be unfounded or old-fashioned.    The idea that people would cease interacting in the “real world” and live in their devices has played out differently from how we expected, surely; trying to instruct the next generation on the proper way to communicate with each other has never worked out well for the olds. And if you told someone in 2007 that foreign election interference would be as much a worry for Facebook as oversharing and privacy problems, you might be met with incredulous looks.    Other downsides were for the most part unforeseen. The development of the bubble or echo chamber, for instance, would have been difficult to predict when our social media systems weren’t also our news-gathering systems. And the phenomenon of seeing only the highlights of others’ lives posted online, leading to self esteem issues in those who view them with envy, is an interesting but sad development.    Whether some risk inherent to social media was predicted or not, or proven or not, people now take such risks seriously. The ideas that one can spend too much time on social networks, or suffer deleterious effects from them, or feel real pain or turmoil because of interactions on them are accepted (though sadly not always without question).    Taking the downsides of something as seriously as the upsides is another indicator of the maturity of that thing, at least in terms of how society interacts with it. When the hype cycle winds down, realistic judgment takes its place and the full complexities of a relationship like the one between people and social media can be examined without interference.    Between the stability of social media’s capabilities and the realism with which those capabilities are now being considered, choice is no longer arbitrary or absolute. Your engagement is not being determined by them any more.   Social media has become a rich set of personal choices   Your experience may differ from mine here, but I feel that in those days of innovation among social networks your participation was more of a binary. You were either on or you were off.    The way they were advancing and changing defined how you engaged with them by adding and opting you into features, or changing layouts and algorithms. It was hard to really choose how to engage in any meaningful way when the sands were shifting under your feet (or rather, fingertips). Every few months brought new features and toys and apps, and you sort of had to be there, using them as proscribed, or risk being left behind. So people either kept up or voluntarily stayed off.    Now all that has changed. The ground rules are set, and have been for long enough that there is no risk that if you left for a few months and come back, things would be drastically different.    As social networks have become stable tools used by billions, any combination or style of engagement with them has become inherently valid.    Your choice to engage with Facebook or Instagram does not boil down to simply whether you are on it or not any more, and the acceptance of social media as a platform for expression and creation as well as socializing means that however you use it or present on it is natural and no longer (for the most part) subject to judgment.    That extends from choosing to make it an indispensable tool in your everyday life to quitting and not engaging at all. There’s no longer an expectation that the former is how a person must use social media, and there is no longer a stigma to the latter of disconnectedness or Luddism.    You and I are different people. We live in different places, read different books, enjoy different music. We drive different cars, prefer different restaurants, like different drinks. Why should we be the same in anything as complex as how we use and present ourselves on social media?    It’s analogous, again, to a car: you can own one and use it every day for a commute, or use it rarely, or not have one at all — who would judge you? It has nothing to do with what cars are or aren’t, and everything to do with what a person wants or needs in the circumstances of their own life.    For instance, I made the choice to remove Facebook from my phone over a year ago. I’m happier and less distracted, and engage with it deliberately, on my terms, rather than it reaching out and engaging me. But I have friends who maintain and derive great value from their loose network of scattered acquaintances, and enjoy the immediacy of knowing and interacting with them on the scale of minutes or seconds. And I have friends who have never been drawn to the platform in the first place, content to select from the myriad other ways to stay in touch.    These are all perfectly good ways to use Facebook! Yet only a few years ago the zeitgeist around social media and its exaggerated role in everyday life — resulting from novelty for the most part — meant that to engage only sporadically would be more difficult, and to disengage entirely would be to miss out on a great deal (or fear that enough that quitting became fraught with anxiety). People would be surprised that you weren’t on Facebook and wonder how you got by.   Try it and be delighted   Social networks are here to improve your life the same way that cars, keyboards, search engines, cameras, coffee makers, and everything else are: by giving you the power to do something. But those networks and the companies behind them were also exerting power over you and over society in general, the way (for example) cars and car makers exerted power over society in the ’50s and ’60s, favoring highways over public transportation.    Some people and some places, more than others, are still subject to the influence of car makers — ever try getting around L.A. without one? And the same goes for social media — ever try planning a birthday party without it? But the last few years have helped weaken that influence and allow us to make meaningful choices for ourselves.    The networks aren’t going anywhere, so you can leave and come back. Social media doesn’t control your presence.    It isn’t all or nothing, so you can engage at 100 percent, or zero, or anywhere in between. Social media doesn’t decide how you use it.    You won’t miss anything important, because you decide what is important to you. Social media doesn’t share your priorities.    Your friends won’t mind, because they know different people need different things. Social media doesn’t care about you.    Give it a shot. Pick up your phone right now and delete Facebook. Why not? The absolute worst that will happen is you download it again tomorrow and you’re back where you started. But it could also be, as it was for me and has been for many people I’ve known, like shrugging off a weight you didn’t even realize you were bearing. Try it.               Read More At Article Source | Article Attribution    The post It’s OK to leave","tags":[],"publishedDate":"2018-06-02T21:17:39Z","harvestDate":"2018-06-02T21:51:39Z","estimatedPublishedDate":"2018-06-02T21:17:39Z","url":"http://ct.moreover.com/?a=34207223805&p=1u0&v=1&x=FTzHHmNUuM9VjYChVv7taQ","originalUrl":"http://www.rocketnews.com/2018/06/its-ok-to-leave-facebook/","outboundUrls":["https://www.crunchbase.com/organization/facebook/","http://feedproxy.google.com/~r/Techcrunch/~3/ctDNsyt-HTs/","http://feeds.feedburner.com/~ff/Techcrunch?a=ctDNsyt-HTs:Nqm09t6G18A:2mJPEYqXBVI","http://feeds.feedburner.com/~ff/Techcrunch?a=ctDNsyt-HTs:Nqm09t6G18A:7Q72WNTAKBA","http://feeds.feedburner.com/~ff/Techcrunch?a=ctDNsyt-HTs:Nqm09t6G18A:yIl2AUoC8zA","http://feeds.feedburner.com/~ff/Techcrunch?a=ctDNsyt-HTs:Nqm09t6G18A:-BTjWOF_DHI","http://feeds.feedburner.com/~ff/Techcrunch?a=ctDNsyt-HTs:Nqm09t6G18A:D7DqB2pKExk","http://feeds.feedburner.com/~ff/Techcrunch?a=ctDNsyt-HTs:Nqm09t6G18A:qj6IDK7rITs"],"wordCount":"1777","dataFormat":"text","duplicateGroupId":"34206721412","media":{"audio":[],"images":[{"url":"http://www.rocketnews.com/wp-content/uploads/2018/06/facebook-javascript-trackers-1-1024x544.png"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Cyberculture news","group":"Internet"},{"name":"Facebook news","group":"Internet"},{"name":"Social media news","group":"Internet"},{"name":"Social networks news","group":"Internet"},{"name":"Internet latest","group":"Internet"}],"companies":[{"name":"With Inc","symbol":"WWTH","exchange":"PINX","isin":"US9773991040","titleCount":0,"contentCount":1,"primary":true}],"author":{"publishingPlatform":{}},"licenses":[{"name":"Publicly Available"}],"source":{"name":"RocketNews","homeUrl":"http://www.rocketnews.com","category":"National","editorialRank":"5","location":{"country":"Canada","countryCode":"CA","region":"Americas","subregion":"Northern America"},"feed":{"id":"169669883","name":"RocketNews","mediaType":"News","tags":[],"language":"Unassigned","dataFormat":"text","rank":{"inboundLinkCount":"4"},"inWhiteList":"true","autoTopics":[],"editorialTopics":["InformationTechnology","Professional"],"genre":"General"}},"es_id":86993800}