{"sequenceId":"845363651299","id":"34207158885","language":"English","title":"Germaine Greer views rape as non-violent and no big deal","content":"\"Women have very little idea of how much men hate them\" -- Germaine Greer In what could only be an attempt to make the intellectually deficient seem bright, Australian \"feminist\" Germaine Greer said that rape should be viewed more as \"lazy, careless and insensitive\" and that the lawful punishment should be lessened. She believes that most rapes are just \"bad sex.\" Some believe that Greer is being coached by a secret Islamist organization that grooms young girls to be gang-raped and would like it if law enforcement would look the other way. Others believe that Greer is a total fraud and an imbecile. Sign me up for this group. Greer spoke at the Hay literary festival in the UK and said the legal system wasn't working in regards to rape.  The 79-year-old divorcee argued that the issue always comes down to whether a person consented or not. Brilliant. \"Most rapes don't involve any injury whatsoever,\" Greer claims without providing actual facts. \"We are told that it is a sexually violent crime, an expert like Quentin Tarantino will tell us that when you use the word 'rape' you're talking about violence, a throwing them down . . . it is one of the most violent crimes in the world. B******t Tarantino. \"Most rape is just lazy, just careless, insensitive. Every time a man rolls over his exhausted wife and insists on enjoying his conjugal rights, he is raping her. It will never end up in a court of law,\" she pontificated. Greer, in an attempt to normalize rape said that we shouldn't think of it as a \"spectacularly violent\" crime. \"It is moments like these, I can hear the feminists screaming at me, 'you're trivializing rape!'\" she said. \"Well, I'll tell you what. You might want to believe that the penis is a lethal weapon and that all women live in fear of that lethal weapon, but that's bull***t. It's not true. We don't live in fear of the penis. A man can't kill you with his penis.\" Right. It's the knife he's holding to your throat after he cuts off your skirt and panties and forces himself on you that he can kill you with. No big deal. The so-called feminist suggests that a rapist should be sentenced to 200 hours' community service and maybe an \"R\" tattoo on his hand, arm or cheek. She believes that without an external injury, a rape is not violent. I agree with Greer when she said that transgender women are \"not women.\" You can't change biology. But this pretentious academic also said that female genital mutilation is akin to getting a tattoo. What a horrible misunderstanding and lack of empathy this woman has for other women. She's a perfect representative of those on the left who are willing to slaughter their unborn baby due to its \"inconvenience,\" as Barack Obama labeled it in reference to his own daughters. The woman is appalling and does not deserve to be a spokesperson for true feminism. Tweet","contentWithMarkup":"<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-ia2lrhhsV20/WxL7FhYgGCI/AAAAAAAAjJs/yvCBnGqx5msoi8m_pu5wZY4oIL5IcqlGQCLcBGAs/s1600/1527780509031.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"524\" data-original-width=\"931\" height=\"225\" src=\"https://2.bp.blogspot.com/-ia2lrhhsV20/WxL7FhYgGCI/AAAAAAAAjJs/yvCBnGqx5msoi8m_pu5wZY4oIL5IcqlGQCLcBGAs/s400/1527780509031.jpg\" width=\"400\" /></a></div><br /><blockquote class=\"tr_bq\">\"Women have very little idea of how much men hate them\" -- <i>Germaine Greer</i></blockquote>In what could only be an attempt to make the intellectually deficient seem bright, Australian \"feminist\" Germaine Greer said that rape should be viewed more as \"lazy, careless and insensitive\" and that the lawful punishment should be lessened.<br /><br />She believes that most rapes are just \"bad sex.\"<br /><br />Some believe that Greer is being coached by a secret Islamist organization that grooms young girls to be gang-raped and would like it if law enforcement would look the other way.<br /><br />Others believe that Greer is a total fraud and an imbecile. Sign me up for this group.<br /><br />Greer spoke at the Hay literary festival in the UK and said the legal system wasn't working in regards to rape.  The 79-year-old divorcee argued that the issue always comes down to whether a person consented or not.<br /><br />Brilliant.<br /><br />\"Most rapes don't involve any injury whatsoever,\" Greer claims without providing actual facts. \"We are told that it is a sexually violent crime, an expert like Quentin Tarantino will tell us that when you use the word 'rape' you're talking about violence, a throwing them down . . . it is one of the most violent crimes in the world. B******t Tarantino.<br /><br />\"Most rape is just lazy, just careless, insensitive. Every time a man rolls over his exhausted wife and insists on enjoying his conjugal rights, he is raping her. It will never end up in a court of law,\" she pontificated.<br /><br />Greer, in an attempt to normalize rape said that we shouldn't think of it as a \"spectacularly violent\" crime.<br /><br />\"It is moments like these, I can hear the feminists screaming at me, 'you're trivializing rape!'\" she said. \"Well, I'll tell you what. You might want to believe that the penis is a lethal weapon and that all women live in fear of that lethal weapon, but that's bull***t. It's not true. We don't live in fear of the penis. A man can't kill you with his penis.\"<br /><br />Right. It's the knife he's holding to your throat after he cuts off your skirt and panties and forces himself on you that he can kill you with. No big deal.<br /><br />The so-called feminist suggests that a rapist should be sentenced to 200 hours' community service and maybe an \"R\" tattoo on his hand, arm or cheek.<br /><br />She believes that without an external injury, a rape is not violent.<br /><br />I agree with Greer when she said that transgender women are \"not women.\" You can't change biology.<br /><br />But this pretentious academic also said that female genital mutilation is akin to getting a tattoo.<br /><br />What a horrible misunderstanding and lack of empathy this woman has for other women. She's a perfect representative of those on the left who are willing to slaughter their unborn baby due to its \"inconvenience,\" as Barack Obama labeled it in reference to his own daughters.<br /><br />The woman is appalling and does not deserve to be a spokesperson for true feminism.<br /><br /><div><a class=\"twitter-share-button\" data-count=\"vertical\" data-related=\"robhoey127.blogspot.com/:Brain Flushings Blog\" data-via=\"RobHoey\" href=\"http://twitter.com/share\">Tweet</a><script src=\"https://platform.twitter.com/widgets.js\" type=\"text/javascript\"></script></div></div><div class=\"blogger-post-footer\">Read my latest novel, Jihad Joe at Amazon:\nhttp://tinyurl.com/6wp7hys</div><img src=\"http://feeds.feedburner.com/~r/BrainFlushings/~4/uZGPztoB_JY\" height=\"1\" width=\"1\" alt=\"\"/>","tags":["feminism","FGM","Germaine Greer","Hay","law","Obama","rape","violence"],"publishedDate":"2018-06-02T20:19:13Z","harvestDate":"2018-06-02T21:36:25Z","estimatedPublishedDate":"2018-06-02T20:19:13Z","url":"http://ct.moreover.com/?a=34207158885&p=1u0&v=1&x=0lG1PVFndHq0DXybGvAQWw","originalUrl":"http://robhoey127.blogspot.com/2018/06/women-have-very-little-idea-of-how-much.html","commentsUrl":"http://robhoey127.blogspot.com/2018/06/women-have-very-little-idea-of-how-much.html#comment-form","outboundUrls":["https://2.bp.blogspot.com/-ia2lrhhsV20/WxL7FhYgGCI/AAAAAAAAjJs/yvCBnGqx5msoi8m_pu5wZY4oIL5IcqlGQCLcBGAs/s1600/1527780509031.jpg","http://twitter.com/share","http://tinyurl.com/6wp7hys"],"wordCount":"496","dataFormat":"text","duplicateGroupId":"34207158885","media":{"audio":[],"images":[{"url":"https://2.bp.blogspot.com/-ia2lrhhsV20/WxL7FhYgGCI/AAAAAAAAjJs/yvCBnGqx5msoi8m_pu5wZY4oIL5IcqlGQCLcBGAs/s400/1527780509031.jpg"}],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Womens rights news","group":"Society"},{"name":"Crime and punishment news","group":"Society"}],"companies":[],"author":{"name":"Rob H","publishingPlatform":{}},"licenses":[],"source":{"name":"Brain Flushings","homeUrl":"http://robhoey127.blogspot.com/","location":{},"feed":{"id":"107544457","name":"Brain Flushings","mediaType":"Blog","publishingPlatform":"Blogger","generator":"Blogger http://www.blogger.com","description":"Random thoughts running frenetically through a labyrinth of synaptic strands of goo","tags":["Obama","satire","Islam","Trump","Hillary Clinton","ISIS","terrorism","Jihad","Israel","Iran","Donald Trump","Koran","Syria","FBI","anti-Semitism","North Korea","Russia","GOP","fox news","liberals","cnn","muslim","Barack Hussein Obama","Hamas","Putin","John Kerry","Kim Jong Un","Benghazi","Iraq","Twitter","racism","G"],"language":"English","dataFormat":"text","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86991935}