{"sequenceId":"845361802763","id":"34207097641","language":"English","title":"Fake cops responded to 911 calls fooling police for years","content":"FLINT, MI -- A group of wannabe cops has been fooling police, firefighters and the public for years across Genesee County, according to law enforcement officials.  Now they are facing felony charges.  The group is accused of conducting false arrests of individuals they accused of committing crimes and even tricking real emergency responders at crime scenes.  \"We believe that on some occasions, they were the first to show up on crime scenes,\" said Genesee County Prosecutor David Leyton. \"On some occasions, the real police would ask them to perform tasks at the scene, not realizing they were imposters.\" A group of people calling themselves the Genesee County Fire and EMS Media-Genesee County Task Force Blight Agency has been acting as police at locations that include county parks, house fires, vehicle crashes and other crime scenes, according to Kevin Shanlian, chief of the Genesee County Parks ranger division. An investigation into the group was launched after Shanlian received a call about a complaint of rude rangers at Stepping Stone Falls and Picnic area in Genesee on Sept. 21, 2017. He investigated the incident because the victims thought they were being mistreated by park rangers, but Shanlian soon learned the victims were actually dealing with the fake cops.  Ultimately, the investigation led to Leyton filing criminal charges.  Leyton authorized charges against three people on Wednesday, May 30, that include three counts of unlawful imprisonment and one count of impersonating a peace officer to commit a crime. Emily Nicole Burrison, 27, of Burton, and Jeffrey Lee Jones, 29, of Flint, were arraigned on the charges Thursday, May 31, before Genesee District Judge David Goggins. A third Flint man was charged in connection with the case and he was taken into custody while working at Cedar Point in Ohio. Investigators said he is being held at the Erie County Jail while awaiting extradition to Genesee County for arraignment on the charges. Court records indicate there are five other co-defendants in the case, however, charges have not yet been filed against them. The three individuals who are charged dressed like police officers and approached two people at Stepping Stone Falls and Picnic area, Leyton said. The charged individuals said the people were trespassing, the park was closed and they were under arrest despite the fact the park was actually open, according to Leyton. Both victims were handcuffed and the fake police demanded their driver's licenses. Information from the licenses was entered into a laptop inside the suspects' vehicle, which Leyton said had a police light bar on top of it. The victims were told they were being placed on a criminal watch list database, Leyton said, before getting the handcuffs taken off and receiving their licenses back.  \"We believe they've done this to other people,\" Leyton said. \"We're asking people to come forward if, in fact, they believe they've been victimized by people they don't believe are real police officers.\" Leyton said the group kept a log and were responding to 911 calls.   Shanlian said there was a core group of about 10 people who were impersonating police since October 2015. \"I believe there's probably hundreds of victims who were actually detained and didn't have good experiences with these folks,\" Shanlian said. However, the group was not always successful in their deception. In one instance, the impersonators tried to get into a scene of a house fire in Mt. Morris Township, according to police Chief Terence Green. But a real officer at the scene didn't let the people in, Green said. \"As far as I know, that incident was the only contact we had with that group,\" he said. \"He would not allow them into the crime scene.\" Green said people pretending to be officers is a safety hazard to the public and his plainclothes officers. \"It's a grave concern,\" he said. \"It's very serious. People are going to question if (plainclothes officers) are legitimate because of these individuals who are illegitimate.\" Shanlian said those who may have interacted with people impersonating police should call his office at 810-249-3830. No court date for Burrison or Jones has been set.  \"To me, this is serious stuff,\" Leyton said. \"You can't run around pretending to be law enforcement. I don't know what these people were thinking.\"","contentWithMarkup":"Investigators said there is a group of about 10 people who were impersonating police since October 2015.","tags":["tag:br-homepage","tag:homepage","tag:nd-ls","tag:news","tag:offbeat"],"publishedDate":"2018-06-02T15:14:57Z","harvestDate":"2018-06-02T21:21:06Z","estimatedPublishedDate":"2018-06-02T15:14:57Z","url":"http://ct.moreover.com/?a=34207097641&p=1u0&v=1&x=r7xHN_nUEesFRNLk80pY6w","originalUrl":"http://www.nola.com/crime/index.ssf/2018/06/fake_cops_responded_to_911_cal.html","outboundUrls":["http://www.mlive.com/news/flint/index.ssf/2018/06/attorney_for_accused_fake_cop.html"],"wordCount":"698","dataFormat":"text","duplicateGroupId":"34197739569","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Police news","group":"Society"}],"companies":[],"author":{"name":"Dominic Adams | dadams5@mlive.com","publishingPlatform":{}},"licenses":[],"source":{"name":"NOLA River","homeUrl":"http://blog.nola.com/nola_river/","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"304532292","name":"NOLA River","mediaType":"Blog","publishingPlatform":"Movable Type","generator":"Movable Type Enterprise 4.29-advance http://www.sixapart.com/movabletype/","tags":[],"language":"English","dataFormat":"Image","rank":{"autoRank":"10","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[],"editorialTopics":["Society","Standard"]}},"es_id":86989868}