{"sequenceId":"845366856890","id":"34207252102","language":"English","title":"URGENT CALL ALERT for Kevin Rashid Johnson","content":"This is an urgent call for support for prison rebel and journalist Kevin “Rahid” Johnson, who is currently held within the Florida Department of Corrections – Santa Rosa Correctional Institution. by Support Kevin Rashid Johnson / It's Going Down  On May 21, 2018, Kevin Johnson was retaliated against for speaking up on behalf of a prisoner with a psychiatric disability named Murphy who was being brutalized by corrections officers at the Santa Rosa Correctional Institution (SRCI). As Florida Department of Corrections (FDOC) officers were gassing and assaulting Mr. Murphy for making too much noise, Mr. Johnson raised his voice from inside his solitary confinement cell (in order to be heard on the video and audio recorders on the cell block) and said that prison guards had been abusing Murphy by failing to provide him with needed mental health care, by withholding meals, and by responding to his psychiatric disability with violence by gassing him nine times and brutally extracting him from his cell. Retaliation for Speech: For this act, Lt. Marcus Stokes told Johnson that he was going to be put on “strip cell,” a punishment where everything in a prisoner’s cell is removed, including toiletries and bedding, and he is left in solitary confinement with nothing but his underwear. Stokes and three other officers then gassed Mr. Johnson six times. After having been put in handcuffs and taken to the showers to clean off the residue from the gas attack, Mr. Johnson was brutally thrown down to the floor, while Lt. Stokes repeatedly threatened to kill him and stated that he was “a marked man.” Unconstitutional Pretext for Punishment: As a pretext, Lt. Stokes wrote in his disciplinary report that Mr. Johnson was punished because his property was “not properly stored” and his “bedding was on the floor.” The practice of FDOC officers gassing and then putting prisoners on “strip cell” for minor disciplinary infractions, as a form of retaliation, or for no reason at all has been well documented by news media and courts. According to one Miami Herald report, previous instances of this kind of abuse caused FDOC to change its policies so that prison guards may no longer gas prisoners and put them on “strip cell” for improperly storing their property or not making their beds.1 Interference with Access to Legal Counsel and Courts: On May 24th, Mr. Johnson’s time on “strip cell” was to have ended; however, FDOC officials returned only one bag of his property, when there should have been six bags of property. Missing property included legal documents necessary to pursue litigation against FDOC officials for numerous violations of his constitutional rights. By withholding this property, FDOC officials were successful in denying Mr. Johnson the ability to exchange legal documents with his attorney Melinda Patterson during a legal visit on May 24th, thereby interfering with his right to legal counsel and his right to access the courts. Reading and Tampering with Legally Privileged Mail: A letter clearly identified as legal mail sent by attorney Melinda Patterson to Mr. Johnson on January 22nd, while he was at Florida State Prison, was received already opened and resealed with a pink glue stick. On April 1st, legal mail sent by Mr. Johnson while at SRCI to attorney Dustin McDaniel was opened, read by FDOC guards, and then resealed with tape prior to delivering to the mailroom staff. Another letter sent by Mr. Johnson on April 1stvia privileged media mail to his editor Carole Seligman was opened, read, and resealed by guards prior to delivering to the mailroom staff. These letters were delayed and received 2 weeks after the date they were submitted for mailing. Mailroom staff admitted that these letters were tampered with, when responding to Mr. Johnson’s grievances #119-1804-0722 and #119-1804-0723. Destroying Legally Privileged Mail: Legal mail sent by Mr. Johnson to attorney Dustin McDaniel on April 17thwas never received, is now missing, and was presumably destroyed by FDOC officials. Letters sent by Mr. Johnson to his editor Carole Seligman on April 5th, 16th, 17th, and 25thwere never delivered and were presumably destroyed by FDOC staff. Included in these mailings were three essays for publication detailing abuses inside the FDOC.  DEMANDS:  \tReturn all confiscated property to Kevin Johnson #158039 \tStop the interference with Mr. Johnson’s legal and news media correspondence \tStop retaliation against Mr. Johnson for exercising his First Amendment rights \tStop the repeated, cruel, arbitrary, and excessive punishment of Mr. Johnson \tImmediately transfer Mr. Johnson from Florida DOC to Virginia DOC  PLEASE CALL:  Warden Clemmons – Santa Rosa Correctional Institution (850) 981-5199  Kenneth S. Steely- General Counsel – Florida Department of Corrections (850) 717-3605  Patrick Finan – Security Operations– Interstate Corrections Compact Unit (850) 717-3222  Lester Fernandez – Inspector General – Florida Department of Corrections (850) 488-9265  Send reports back to: jaybeware@riseup.net","contentWithMarkup":"<h3>This is an urgent call for support for prison rebel and journalist Kevin “Rahid” Johnson, who is currently held within the Florida Department of Corrections – Santa Rosa Correctional Institution.</h3>\n<em><strong>by <a href=\"http://rashidmod.com/\">Support Kevin Rashid Johnson</a> / <a href=\"https://itsgoingdown.org/urgent-call-alert-for-kevin-rashid-johnson/\">It's Going Down</a></strong></em>\n\nOn May 21, 2018, Kevin Johnson was retaliated against for speaking up on behalf of a prisoner with a psychiatric disability named Murphy who was being brutalized by corrections officers at the Santa Rosa Correctional Institution (SRCI). As Florida Department of Corrections (FDOC) officers were gassing and assaulting Mr. Murphy for making too much noise, Mr. Johnson raised his voice from inside his solitary confinement cell (in order to be heard on the video and audio recorders on the cell block) and said that prison guards had been abusing Murphy by failing to provide him with needed mental health care, by withholding meals, and by responding to his psychiatric disability with violence by gassing him nine times and brutally extracting him from his cell.\n<h2><strong>Retaliation for Speech:</strong></h2>\nFor this act, Lt. Marcus Stokes told Johnson that he was going to be put on “strip cell,” a punishment where everything in a prisoner’s cell is removed, including toiletries and bedding, and he is left in solitary confinement with nothing but his underwear. Stokes and three other officers then gassed Mr. Johnson six times. After having been put in handcuffs and taken to the showers to clean off the residue from the gas attack, Mr. Johnson was brutally thrown down to the floor, while Lt. Stokes repeatedly threatened to kill him and stated that he was “a marked man.”\n<h2><strong>Unconstitutional Pretext for Punishment:</strong></h2>\nAs a pretext, Lt. Stokes wrote in his disciplinary report that Mr. Johnson was punished because his property was “not properly stored” and his “bedding was on the floor.” The practice of FDOC officers gassing and then putting prisoners on “strip cell” for minor disciplinary infractions, as a form of retaliation, or for no reason at all has been well documented by news media and courts. According to one Miami Herald <a href=\"http://www.miamiherald.com/news/special-reports/florida-prisons/article15772436.html\" target=\"_blank\" rel=\"noopener\">report</a>, previous instances of this kind of abuse caused FDOC to change its policies so that prison guards may no longer gas prisoners and put them on “strip cell” for improperly storing their property or not making their beds.<a name=\"_ednref\"></a>1\n<h2><strong>Interference with Access to Legal Counsel and Courts:</strong></h2>\nOn May 24<sup>th</sup>, Mr. Johnson’s time on “strip cell” was to have ended; however, FDOC officials returned only one bag of his property, when there should have been six bags of property. Missing property included legal documents necessary to pursue litigation against FDOC officials for numerous violations of his constitutional rights. By withholding this property, FDOC officials were successful in denying Mr. Johnson the ability to exchange legal documents with his attorney Melinda Patterson during a legal visit on May 24th, thereby interfering with his right to legal counsel and his right to access the courts.\n<h2><strong>Reading and Tampering with Legally Privileged Mail:</strong></h2>\nA letter clearly identified as legal mail sent by attorney Melinda Patterson to Mr. Johnson on January 22<sup>nd</sup>, while he was at Florida State Prison, was received already opened and resealed with a pink glue stick. On April 1<sup>st</sup>, legal mail sent by Mr. Johnson while at SRCI to attorney Dustin McDaniel was opened, read by FDOC guards, and then resealed with tape prior to delivering to the mailroom staff. Another letter sent by Mr. Johnson on April 1<sup>st</sup>via privileged media mail to his editor Carole Seligman was opened, read, and resealed by guards prior to delivering to the mailroom staff. These letters were delayed and received 2 weeks after the date they were submitted for mailing. Mailroom staff admitted that these letters were tampered with, when responding to Mr. Johnson’s grievances #119-1804-0722 and #119-1804-0723.\n<h2><strong>Destroying Legally Privileged Mail:</strong></h2>\nLegal mail sent by Mr. Johnson to attorney Dustin McDaniel on April 17<sup>th</sup>was never received, is now missing, and was presumably destroyed by FDOC officials. Letters sent by Mr. Johnson to his editor Carole Seligman on April 5<sup>th</sup>, 16<sup>th</sup>, 17<sup>th</sup>, and 25<sup>th</sup>were never delivered and were presumably destroyed by FDOC staff. Included in these mailings were three essays for publication detailing abuses inside the FDOC.\n\n<strong>DEMANDS:</strong>\n<ul>\n\t<li>Return all confiscated property to Kevin Johnson #158039</li>\n\t<li>Stop the interference with Mr. Johnson’s legal and news media correspondence</li>\n\t<li>Stop retaliation against Mr. Johnson for exercising his First Amendment rights</li>\n\t<li>Stop the repeated, cruel, arbitrary, and excessive punishment of Mr. Johnson</li>\n\t<li>Immediately transfer Mr. Johnson from Florida DOC to Virginia DOC</li>\n</ul>\n<strong>PLEASE CALL:</strong>\n\n<strong>Warden Clemmons </strong>– Santa Rosa Correctional Institution\n(850) 981-5199\n\n<strong>Kenneth S. Steely- </strong><strong>General Counsel </strong>– Florida Department of Corrections\n(850) 717-3605\n\n<strong>Patrick Finan – </strong><strong>Security Operations</strong>– Interstate Corrections Compact Unit\n(850) 717-3222\n\n<strong>Lester Fernandez – </strong><strong>Inspector General </strong>– Florida Department of Corrections\n(850) 488-9265\n\n<strong>Send reports back to: </strong>jaybeware@riseup.net","tags":["FRONT PAGE","Prisoner's Rights","TAKE ACTION","criminal justice system","Florida Corrections","Kevin Rashid Johnson","prisoner's rights","retaliation","Santa Rosa Correctional Institution"],"publishedDate":"2018-06-02T21:57:56Z","harvestDate":"2018-06-02T21:58:23Z","estimatedPublishedDate":"2018-06-02T21:57:56Z","url":"http://ct.moreover.com/?a=34207252102&p=1u0&v=1&x=t6uZbx7dr5tt2EypFFnAtA","originalUrl":"http://loveandragemedia.org/2018/06/02/urgent-call-alert-for-kevin-rashid-johnson/","outboundUrls":["http://rashidmod.com/","https://itsgoingdown.org/urgent-call-alert-for-kevin-rashid-johnson/","http://www.miamiherald.com/news/special-reports/florida-prisons/article15772436.html"],"wordCount":"777","dataFormat":"text","duplicateGroupId":"34192086429","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"8421"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"loveandrageteam","publishingPlatform":{"userId":"124033761"}},"licenses":[],"source":{"name":"Love and Rage Media Collective","homeUrl":"http://loveandragemedia.org","location":{},"feed":{"id":"577358162","name":"Love and Rage Media Collective","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"81927957","generator":"http://wordpress.com/","description":"Alternative News and Views","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"6","autoRankOrder":"92036","inboundLinkCount":"2"},"inWhiteList":"true","autoTopics":["ugc politics feeds","ugc international development feeds","ugc food feeds","ugc financial feeds","ugc law feeds"]}},"es_id":86994573}