{"sequenceId":"845362171824","id":"34207110363","language":"English","title":"The Unexpected Love Objects of Dunya Noor","content":"Joseph Noor, Syria’s premier heart surgeon and the only man in Lattakia to live in a two-storey home, is experiencing a learning moment: “Living in a dictatorship meant that throughout his life, he, just like the president, could dictate his wishes to anyone who had the misfortune of having less power than him, and he now wondered whether this sort of power could turn any man into a monster.”  This necessary connection between macro and micro is only one of many wonderful things in Rana Haddad’s quirky, very readable, and slightly odd novel. Contradictions abound - Syrian 'socialism' solidifies bourgeois snobbery while 'secularism' intensifies religious division. Characters sometimes manage to squeeze their various prejudices into gnomic phrases, like: \"Only an Armenian would think photography is a career, that and hairdressing.\"  The novel's chief protagonist, Dunya (Joseph’s daughter), is an unruly element in Hafez al-Assad’s totalitarian society of the 1980s, so unruly that she dares state in Qowmiyya (‘nationalism’) class that she doesn’t like the Baath Party. To preserve her safety and her father’s reputation, Dunya is sent to her grandparents in England, where people enjoy “a freedom that caused them to lose all interest in politics”.  Wherever she is, Dunya keeps finding unexpected (and in the eyes of society, inappropriate) love objects – a poor fisherman’s son, a camera, a Muslim, eventually a person of the ‘wrong’ gender. This last love object is found in Aleppo, where the story shifts gear towards the genre of magical (and slightly dreamlike) tale.  I recommend “The Unexpected Love Objects of Dunya Noor” for its lightness of tone and the weight of its concerns. And because it’s part set in Lattakia – not many novels wear that particular honour.","contentWithMarkup":"<img class=\" size-medium wp-image-4350 alignright\" src=\"https://qunfuz.files.wordpress.com/2018/06/unexpected.jpg?w=376\" alt=\"unexpected\" width=\"188\" height=\"300\" />Joseph Noor, Syria’s premier heart surgeon and the only man in Lattakia to live in a two-storey home, is experiencing a learning moment: “Living in a dictatorship meant that throughout his life, he, just like the president, could dictate his wishes to anyone who had the misfortune of having less power than him, and he now wondered whether this sort of power could turn any man into a monster.”\n\nThis necessary connection between macro and micro is only one of many wonderful things in Rana Haddad’s quirky, very readable, and slightly odd novel. Contradictions abound - Syrian 'socialism' solidifies bourgeois snobbery while 'secularism' intensifies religious division. Characters sometimes manage to squeeze their various prejudices into gnomic phrases, like: \"Only an Armenian would think photography is a career, that and hairdressing.\"\n\nThe novel's chief protagonist, Dunya (Joseph’s daughter), is an unruly element in Hafez al-Assad’s totalitarian society of the 1980s, so unruly that she dares state in Qowmiyya (‘nationalism’) class that she doesn’t like the Baath Party. To preserve her safety and her father’s reputation, Dunya is sent to her grandparents in England, where people enjoy “a freedom that caused them to lose all interest in politics”.\n\nWherever she is, Dunya keeps finding unexpected (and in the eyes of society, inappropriate) love objects – a poor fisherman’s son, a camera, a Muslim, eventually a person of the ‘wrong’ gender. This last love object is found in Aleppo, where the story shifts gear towards the genre of magical (and slightly dreamlike) tale.\n\nI recommend “The Unexpected Love Objects of Dunya Noor” for its lightness of tone and the weight of its concerns. And because it’s part set in Lattakia – not many novels wear that particular honour.","tags":["book review","Rana Haddad"],"publishedDate":"2018-06-02T21:24:14Z","harvestDate":"2018-06-02T21:24:18Z","estimatedPublishedDate":"2018-06-02T21:24:14Z","url":"http://ct.moreover.com/?a=34207110363&p=1u0&v=1&x=Cb5W-_Weq6merwHNbjQG7Q","originalUrl":"http://qunfuz.com/2018/06/02/the-unexpected-love-objects-of-dunya-noor/","outboundUrls":[],"wordCount":"282","dataFormat":"text","duplicateGroupId":"34207110363","media":{"audio":[],"images":[{"url":"https://qunfuz.files.wordpress.com/2018/06/unexpected.jpg?w=376"}],"video":[],"logo":[]},"publishingPlatform":{"itemId":"4349"},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Robin Yassin-Kassab","publishingPlatform":{"userId":"3961398"}},"licenses":[],"source":{"name":"Qunfuz","homeUrl":"http://qunfuz.com","location":{},"feed":{"id":"104330476","name":"Qunfuz","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"8216389","generator":"http://wordpress.com/","description":"Robin Yassin-Kassab","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"4","autoRankOrder":"23077","inboundLinkCount":"25"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990308}