{"sequenceId":"845367430116","id":"34207267230","language":"English","title":"World Eating Disorder Day: Erin Akers’ Story of Diabulimia","content":"By Erin M. Akers, Founder & Executive Director of Diabulimia Helpline On June 2, 2018, through mass social media messaging, blogs, publications, and local events, activists across the globe launch the third annual World Eating Disorders Action Day. This year’s theme, #WeDoAct2BreakStigma, is the perfect jumping off point for our origin story. Stigma: I can’t remember a time when I didn’t feel it. I was an overweight child. Not as in “she’s carrying a little baby weight,” but as in medically overweight, called out by my pediatrician when I was seven years old. When I was nine years old, I was diagnosed with type 1 diabetes. The doctor caught it on a fluke before I started showing symptoms, which means my diagnosis did not accompany the usual weight loss. Unfortunately, this meant I was an overweight child who had just been diagnosed with diabetes. I felt like the punch line to every bad diabetes joke ever written. The first few neighbors I told even asked, “Oh it’s because your parents fed you too much sugar growing up, right?” Of course not, but my diagnosis plus my weight felt like an indictment not only on my parents and myself but also on the entire diabetes community. Eventually, I became so ashamed and embarrassed of my disease that I stopped telling people I had type 1 diabetes at all. The stigma (and myth) around diabetes being a fat person disease, an old person disease, something you give yourself, a disease caused by lifestyle… all of it just became a crushing weight that I carried around and became a heavier burden day by day. Because of the stigma, I was reluctant to take my insulin or test my blood sugar in public. All I wanted was to be just like everyone else. This desperate need to be “normal” would become a deadly desire. At the age of 13, I started displaying clinical signs of ED-DMT1, the comorbid occurrence of eating disorder and diabetes mellitus type 1. I didn’t realize the feelings of shame and depression surrounding my disease were not only unsurprising but actually quite common. In fact, people with type 1 diabetes are 2x more likely to have a general anxiety disorder1 as those without, and type 1 diabetes comes with a 30% higher incidence of clinical depression2. According to the amazing grassroots movement behind World Eating Disorders Action Day, “One of the ways to decrease stigma is by talking openly with family, friends, and professionals.” Looking back, I often wonder what would have happened if someone had talked with me, in the beginning, to help me work through my feelings about developing a chronic illness or even simply told me my feelings were perfectly normal. Diabulimia, the practice of taking less insulin for the purpose of weight loss, is the deadliest of all eating disorders,3 and I just slipped into it. I took less and less care of my diabetes until I was losing weight even though I was binging on high sugar foods like Skittles, juice, and fruit. Eventually, at one of my 3-month endocrinology appointments, the scale finally started going down instead of up – the doctor cheered my weight loss, the rising A1c ignored, cultural bias confirmed, my shrinking waistline was all that mattered. It took less than one summer to lose enough weight that I had to buy a new wardrobe for school that fall. In that time I was also hospitalized for diabetic ketoacidosis twice, my A1c rose 4 points, and most importantly, a life-shattering eating disorder was cemented into my life forever. This eating disorder that we were never warned about began showing up in studies on insulin omission and eating disorders in the diabetes community as far back as 19864. In fact, one of these first studies showed that 39% of females with type 1 diabetes were omitting their insulin for weight loss purposes5. Dozens of studies all around the globe showed the same result: there was an eating disorder problem rampant in the diabetes community that no one was talking about. It wasn’t limited to insulin omission either; women with type 1 diabetes were over 2.4 times more likely to develop an eating disorder than their non-diabetic peers6. More recent studies show that 10-15% of men with type 1 diabetes are also omitting their insulin for weight loss reasons.8 Part of breaking the stigma around comorbid diabetes and eating disorders is by explaining to patients and providers alike that eating disorders have been scientifically shown to be genetically linked illnesses that can affect anyone. By 2008 I was mentally and physically done, having to leave college in Boston because of a staph infection in my spine. When I came home from school, I knew I no longer had control of my life. So, when my mom held a family “intervention” that Christmas and refused to pay for tuition until I went into treatment, I gratefully, though reluctantly, gave in. After an extensive search, we finally found one center in Florida that claimed to understand and be willing to work with diabulimia. However, when I arrived, I found there were no resources to support someone like myself: a type 1 diabetic struggling with an eating disorder. I needed answers to the complex questions. How do I manage my diabetes while still managing to eat intuitively? If I have to look at a food label to get the carb count for my insulin ratio, how do I not look at the calories? What about low blood sugars? God, how do I handle lows? When my body is telling my brain that I’m dying and only food will save me resulting in a binge-like eating incident, how do I handle the guilt afterward? I was the only diabetic the eating disorder clinic had ever dealt with so they simply treated me like any other eating disorder client and never addressed any of the issues that my disease brought into the equation. Nevertheless, as a natural nerd, I worked as hard at recovery as I did in school. I gave treatment all my energy and after three months was dubbed “recovered” and ready to return home. When I got home, I called a major diabetes organization and explained my situation. They were sympathetic but said it was an eating disorder problem. Next, I called a major eating disorder organization, but they said it was a diabetes problem. Not knowing what to do, I started researching, and that’s when I found them, dozens and dozens of studies showing thousands of other women with diabetes facing the same challenges as me. I needed to reach out, needed to find these people like me. That’s how the Diabulimia Awareness Facebook Support Group was formed. It was a way of breaking stigma before I even knew that’s what we were doing. In the general diabetes online community (DOC), when someone posts that their A1c is high and they’re struggling to take their insulin, the reaction can be harsh, even judgmental, with questions like “how can you?” and “don’t you understand the health risks?” It’s not helpful to point out what we already know. Remember, eating disorders, like any mental health disorder, are not a choice. In addition, because of the environmental, social, behavioral, and emotional issues that come into play in life with type 1 diabetes, a number of character traits associated with eating disorders can often be exacerbated by a type 1 diabetes diagnosis7. It’s because of these diabetes-eating-disorder-specific issues that in 2009, a year after we formed the support group, Diabulimia Helpline incorporated as the world’s first non-profit organization devoted to patient and family support, healthcare education, and advocacy related to diabetes and eating disorders. In 2011 we opened the DBH hotline, a 24-hour crisis and resource hotline for diabetes and eating disorders. The staff are all former diabulimia patients in recovery or family members who had helped their loved one find recovery. The hotline can be reached any time, even holidays, at (425) 985-3635. After de-stigmatizing diabulimia for people with diabetes, the natural progression was to bring healthcare professionals into the fold. Thus, we were thrilled in 2013 to launch our Healthcare Professional Education Series committed to educating medical and mental healthcare providers about the complex interweaving of diabetes and eating disorders in the brain and body. A lot of progress has been made in the last ten years; a lot of healthcare champions and diabetes heroes identified. Yet, at least once a week we hear from a client brave enough to bring up diabulimia or ED-DMT1 with their doctor, only to be told, “that isn’t a real thing.” And as great as the mentorship program and online support groups of 2,000 members from 5 different continents are, it’s not the same as looking across from someone or embracing a friend. You know the embrace, the diabuddy hug, the one you give that diabetic friend you’ve known thru Instagram for as long as you’ve had your account. It’s like that except these friends know your deepest darkest secret, and are often your cheerleaders in those moments when you’re not sure you want to take another shot and feel like you can’t go on. This November 9-11, 2018 in New Orleans, Louisiana, Diabulimia Helpline aims to break a lot of stigma in both the diabetes and mental health world by hosting the First International Conference on Diabetes and Eating Disorders. We are bringing together the world’s foremost experts in the field to provide education and inspiration in a two-track event – one for healthcare professionals and one for patients. For professionals, we have over a dozen speakers from 5 different countries to arm with the best knowledge and tools of prevention, recognition, treatment, and recovery. For patients, the conference offers a unique opportunity to come together in a warm, supportive environment to learn and talk with peers and experts about the things that no one else understands. This year we celebrate every possibility that grows from recovery. The first day of the conference our theme is Dream: let your dreams be boundless and infinite, only as limited as your imagination. The second day is all about Believe: learning how to believe in ourselves and our dreams. The last day is all about Hope: in our darkest hour hope can get us through, hope for a better day, hope for a lighter hour, hope for a damn cure! Dream, Believe, Hope: that’s the theme for the weekend, and we really hope to see you at DBHcon18 (Get Your Tickets Here!). This World Eating Disorder Action Day #WeDoAct2BreakStigma about not just eating disorders, but also about diabetes, about living with an invisible illness, about trying to live with the voice of two chronic illnesses in your head at all times, and about the fact that it’s okay if it’s hard at times. Because you know what they say “Managing type 1 diabetes is easy! It’s like riding a bike… except the bike is on fire. And you are on fire. And everything is on fire.” ReferencesGrigsby AB, et al. Prevalence of anxiety in adults with diabetes. Journal of Psychosomatic Research. Dec 2002; 53(6):1053-1060.Anderson BJ, et al. The Prevalence of Comorbid Depression in Adults with Diabetes. Diabetes Care. Jun 2001; 24(6):1069-1078.Goebel-Fabbri AJ, Franko DL, et al. Insulin restriction and associated morbidity and mortality in women with type 1 diabetes. Diabetes Care. 2007; 31:415-419.Steel JM, Young RJ, Lloyd GG, and Clarke BF. Clinically apparent eating disorders in young diabetic women: associations with painful neuropathy and other complications. British Medical Journal 1987; 294:859-62.Stancin T, Link D, Reuter J. Binge Eating and Purging in Young Women with IDDM. Diabetes Care 1989; 12:601-03.Jones JM, et al. Eating disorders in adolescent females with and without type 1 diabetes: cross-sectional study. BMJ. 2000; 2000(320):1563–1566.Lee-Akers D, Simon J and Jahraus J. Biological and psychological risk factors for eating disorders in type 1 diabetes. Poster presented at: American Association of Diabetes Educators Annual Meeting. 2017 Aug 4-7; Indianapolis, IN.Eating Disorders and Disordered Eating Symptoms in Adolescents with T1D” ,Toni, G., et al. Nutrients, 2017; 9:8, 906 Post Views: 1 Read more about A1c, American Association of Diabetes Educators (AADE), diabetes burnout, diabetes community, diabulimia, eating disorders, insulin, low blood glucose/sugar (hypoglycemia), neuropathy, obesity, stigma, World Eating Disorder Day.","contentWithMarkup":"By Erin M. Akers, Founder & Executive Director of Diabulimia Helpline On June 2, 2018, through mass social media messaging, blogs, publications, and local events, activists across the globe launch the third annual World Eating Disorders Action Day. This year’s theme, #WeDoAct2BreakStigma, is the perfect jumping off point for our origin story. Stigma: I can’t remember […]","tags":["Food","Life with Diabetes","Type 1 Diabetes","A1c","American Association of Diabetes Educators (AADE)","diabetes burnout","diabetes community","diabulimia","eating disorders","insulin","low blood glucose/sugar (hypoglycemia)","neuropathy","obesity","stigma","World Eating Disorder Da"],"publishedDate":"2018-06-02T20:00:00Z","harvestDate":"2018-06-02T22:01:04Z","estimatedPublishedDate":"2018-06-02T20:00:00Z","url":"http://ct.moreover.com/?a=34207267230&p=1u0&v=1&x=PpgxCElIh8LQW-IQLUanMw","originalUrl":"https://www.diabetesdaily.com/blog/world-eating-disorder-day-erin-akers-story-of-diabulimia-575352/","commentsUrl":"https://www.diabetesdaily.com/blog/world-eating-disorder-day-erin-akers-story-of-diabulimia-575352/#respond","outboundUrls":["http://www.diabulimiahelpline.org/","https://www.facebook.com/groups/DiabulimiaSupport","https://www.eventbee.com/v/dbhcon2018#/tickets"],"wordCount":"1998","dataFormat":"text","duplicateGroupId":"34207267230","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[],"companies":[],"author":{"name":"Guest Contributor","publishingPlatform":{}},"licenses":[],"source":{"name":"Diabetes Daily","homeUrl":"https://www.diabetesdaily.com","location":{"country":"Australia","countryCode":"AU","region":"Oceania","subregion":"Australia and New Zealand"},"feed":{"id":"581018818","name":"Diabetes Daily","mediaType":"Blog","publishingPlatform":"WordPress","generator":"https://wordpress.org/?v=4.9.6","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"6","autoRankOrder":"76281","inboundLinkCount":"3"},"inWhiteList":"true","autoTopics":["ugc management feeds","ugc food feeds","ugc medical feeds","ugc health feeds"]}},"es_id":86994966}