{"sequenceId":"845363855959","id":"34207165995","language":"English","title":"IMFL 70.3- The comeback","content":"In 2017 my coach and I decided that I was just going to build fitness and make 2018 my comeback/redemption year. I had so many life things happen post IMTX 2016 and I needed a reset. I was recovering from thyroid surgery, a PCS move with the military and the joys of home searching/buying. There was so much going on, I was having a hard time just focusing on me.  Fast Forward to 2018. Coach and I laid out the plan for the year with much flexibility built in. IMFL 70.3 would be a redemption race, I DNF'd it in 2015 (my first DNF) and I felt like I really need to go back and conquer the course. If nothing else, so I could finally wear the hat/T-shirt/backpack with pride.  Leading up to IMFL 70.3, my mother falls ill. First with a stroke, then a cancer diagnosis. After all the testing and appointments, surgery is scheduled just 4 days before the race. Of course this is the second thought in my head as moms tells me the plan. The first of course being that I need to get off work to be there. The second, is to tell her it's the week of the race. We discuss, she's adamant I go and race. My training has been minimal at this point, my fitness is there but it wasn't going to be a rockstar kind of day. I called my coach to discuss, she asked if I was dropping out. I tell her NO!! We devise the plan.  April 4th- Mom goes into surgery for cancer. Upon waking up from surgery I ask her again if she's sure she wants me to leave, and in her drugged up state, she says yes. I'm certain she would have said yes without those drugs ;) So, I leave 24 hours after her surgery, drive to FL. Typical pre race things happen: Bike tune up, eat all the food, check in to race, get all the gear, hug friends, get off feet and relax. I opted not to leave my bike there overnight (Big storms were coming through) and instead brought it with me race morning to check in. I was staying with my donut loving, life giving friend Ashley and she truly was a Godsend during this entire weekend. She was so patient and just so willing to do whatever I needed. It's great to have these kind of friends, I was still so worried about my mom and I couldn't think clearly most of the time.  Race morning we get up so early (This is the only thing I hate about racing!) and get things ready to go. Drive to the race (I don't remember much about the morning) and check the bike in, set up transition and get mentally ready to make new memories on this course, the one that broke my heart for the first time. I need to mention that I'm racked with my HitSquad teammates and they make the morning much easier, each of them asking about my mom and wishing me and her the best. These guys became my instant extended family.   The Swim: They changed the race to a rolling start- my absolute favorite way to race an IM! (Many people hate it) I seat myself in the 45-50 minute group, because this is where I know I'll end up. The last time I did this race I finished the swim in 1:11:13, just a hair over the 1:10 limit. Hence the DNF. For the 2018 race it was wetsuit legal, just barely, but I was suited up and ready to go. Amy found me in the sea of 2000 people and hugged me tight, causing my goggles to leak..(or maybe that was my happy tears). It was nice to see her just before I entered the water giving me the thumbs up that I could do this. As with every race, if you can get out of the water in time, you will finish. For the first 500 yds it was a battle royale. So congested, so many people. I did everything I could to find my own space. At the first buoy I was reminded why I said I would never do this race again- it is just too crowded. Like seriously you have to swim on the grass outside the lake to avoid people. But I kept my mind in the game, focused on each stroke and finally emerged at the finish in 50:22, 21 minutes better than last time.  [gallery ids=\"757,752\" type=\"rectangular\"]  A quick run through transition and on the bike. I was a little excited about the bike because I had a really great bike split on this race before (racing mad does that for you!) and I was looking forward to besting it. One tiny problem- I was very undertrained for this race. It was hot, hilly and again, crowded. I enjoy riding with people around me, but I do not enjoy having to ride two and three abreast to keep from drafting. At times it held me up, at times I had to push hard to get out of a pack and get my piece of the shoulder back. It was a great ride, cool at first, and then hot. I got behind on my fluids (I'm beginning to see this as a thyroid issue-I'm just not thirsty) but didn't realize it until later. I climbed the hills, I pushed hard, I gave that bike my all and finished in 3:31:31, 10 minutes slower than I had raced it before. I was a little disappointed in this but knew at least I would have legs to run on. My heart really believed I could race it much faster, so I took that disappointment out on the run.  In transition I'm by myself on my rack and on the next row is a girl who is very excited to get off her bike and go run. She's beaming with excitement and telling her support crew how much fun she's having. I don't mean to, but I laugh out loud and ask her if it's her first race. She says no, but says it's the first one she has enjoyed. I smiled big and wished her the best run. Meanwhile I was telling myself how much the rest of this day was going to suck and how this was going to be my last year of racing triathlons. I grab my stuff, hit the porta john, and run out, up the first of many hills.  The Run: I remember this run from the last time, except now the road was paved. It's three loops, with hills in the first two miles over every loop, and inclines the other two miles. A total elevation gain of 486 feet! I had a plan going in, I had been running the hills in my neighborhood, I knew I could get up them. It was so hot at this point, no clouds, and did I mention hilly? Paramedics were on every corner, ice was at every aide station. I walked up the hills, ran down the hills and the jogged the flats. I was starting to feel the effects of heat exhaustion. I was nauseous, I couldn't get any fluids in or food. I saw Ashley about 3 miles into the first loop and I told her I was going to drop out of the race. I didn't feel well, I was overheating and I needed to find shade. She encouraged me to keep going to get to the second loop and reevaluate. Because I couldn't get fluids in, I poured them on me, I put ice on every major artery. I did everything I could to keep myself in the right mindset. Loop two came and I walked up those hills again. Saw Ashley again told her I was dying but I kept moving. (In front of me a man passed out about 5 minutes later!). I make it through loop 2, see Amy at the finish and tell her I'm dying. She tells me to keep moving. I have the best friends :) On loop 3 the clouds come and it looks like rain. I pray for rain. I pray for the clouds to stay. I'm feeling better because I've been successful in getting my body temp down and some fluids in. I know I'm going to finish if I have to walk the last 4 miles.    As in all races, I wind up with friends along the course. A man was running behind me, then with me for this last loop and we began to talk. I told him I was walking all inclines, but running downhills and flats. He asked if I minded company. Nope, but I'm not altering my plan. So we ran the last 3 miles together, and I'm so grateful. It really took my mind off what was happening. At the last 1/2 mile he left me, clearly he had more in the tank! I ran in to the finisher shoot and Ashley was waiting with a huge smile for me! That run would be a 2:57:28, my second slowest run in a 70.3. 12 minutes slower than the last time I did it.  [gallery ids=\"753,754,755\" type=\"rectangular\"]  It's easy to compare races, and no two are ever the same, not even on the same course. But the Type A perfectionist in me does it anyway. I tried hard to see the small victories, the great swim time considering my lack of training, the great transition times (I've been working on those!), and the fact that I finished this race. All in 7:34:55, 13 minutes slower than my DNF. I also look at it as a huge success considering my mind was totally on getting back in my car and driving the 12 hours back to MS to be with my mom. I pick it apart all the time, and I truly am now finished trying to prove anything to myself with this course. I did prove that I could race without much training- which I DO NOT recommend, and that if I recover properly I can pick up my training right away.  [gallery ids=\"751,749,756\" type=\"rectangular\"]  Following IMFL 70.3 I came home to be with my mom. Share all the swag, show her all the photos and talk about the race. I get one chance each time to tell her about it before it's old news. I could talk about Triathlon every day, if someone wanted to listen ;)    So you take the lessons, you apply them, you talk to your coach about them. You reevaluate your year, your plan, your goals. You make new plans, new goals. You move forward. Until it's not fun anymore, and then you move on. I have two big races left on the calendar this year and I'm going to focus on having fun. If I make it to IMAZ and across the finish line then the process will start all over.  This could be my last year of Triathlons, but I also like the thought of doing Honu and Iceland, Roth and Santa Rosa. Maybe I'll finish my career with Boulder. But first, I have to go find the fun in racing again.","contentWithMarkup":"In 2017 my coach and I decided that I was just going to build fitness and make 2018 my comeback/redemption year. I had so many life things happen post IMTX 2016 and I needed a reset. I was recovering from thyroid surgery, a PCS move with the military and the joys of home searching/buying. There was so much going on, I was having a hard time just focusing on me.\n\nFast Forward to 2018. Coach and I laid out the plan for the year with much flexibility built in. IMFL 70.3 would be a redemption race, I DNF'd it in 2015 (my first DNF) and I felt like I really need to go back and conquer the course. If nothing else, so I could finally wear the hat/T-shirt/backpack with pride.\n\nLeading up to IMFL 70.3, my mother falls ill. First with a stroke, then a cancer diagnosis. After all the testing and appointments, surgery is scheduled just 4 days before the race. Of course this is the second thought in my head as moms tells me the plan. The first of course being that I need to get off work to be there. The second, is to tell her it's the week of the race. We discuss, she's adamant I go and race. My training has been minimal at this point, my fitness is there but it wasn't going to be a rockstar kind of day. I called my coach to discuss, she asked if I was dropping out. I tell her NO!! We devise the plan.\n\nApril 4th- Mom goes into surgery for cancer. Upon waking up from surgery I ask her again if she's sure she wants me to leave, and in her drugged up state, she says yes. I'm certain she would have said yes without those drugs ;) So, I leave 24 hours after her surgery, drive to FL. Typical pre race things happen: Bike tune up, eat all the food, check in to race, get all the gear, hug friends, get off feet and relax. I opted not to leave my bike there overnight (Big storms were coming through) and instead brought it with me race morning to check in. I was staying with my donut loving, life giving friend Ashley and she truly was a Godsend during this entire weekend. She was so patient and just so willing to do whatever I needed. It's great to have these kind of friends, I was still so worried about my mom and I couldn't think clearly most of the time.\n\nRace morning we get up so early (This is the only thing I hate about racing!) and get things ready to go. Drive to the race (I don't remember much about the morning) and check the bike in, set up transition and get mentally ready to make new memories on this course, the one that broke my heart for the first time. I need to mention that I'm racked with my HitSquad teammates and they make the morning much easier, each of them asking about my mom and wishing me and her the best. These guys became my instant extended family. <img class=\"alignnone size-full wp-image-748\" src=\"https://torijmoffitt.files.wordpress.com/2018/06/30516751_10214624872528410_1491142203412578304_n.jpg\" alt=\"30516751_10214624872528410_1491142203412578304_n\" width=\"960\" height=\"720\" />\n\nThe Swim: They changed the race to a rolling start- my absolute favorite way to race an IM! (Many people hate it) I seat myself in the 45-50 minute group, because this is where I know I'll end up. The last time I did this race I finished the swim in 1:11:13, just a hair over the 1:10 limit. Hence the DNF. For the 2018 race it was wetsuit legal, just barely, but I was suited up and ready to go. Amy found me in the sea of 2000 people and hugged me tight, causing my goggles to leak..(or maybe that was my happy tears). It was nice to see her just before I entered the water giving me the thumbs up that I could do this. As with every race, if you can get out of the water in time, you will finish. For the first 500 yds it was a battle royale. So congested, so many people. I did everything I could to find my own space. At the first buoy I was reminded why I said I would never do this race again- it is just too crowded. Like seriously you have to swim on the grass outside the lake to avoid people. But I kept my mind in the game, focused on each stroke and finally emerged at the finish in 50:22, 21 minutes better than last time.\n\n[gallery ids=\"757,752\" type=\"rectangular\"]\n\nA quick run through transition and on the bike. I was a little excited about the bike because I had a really great bike split on this race before (racing mad does that for you!) and I was looking forward to besting it. One tiny problem- I was very undertrained for this race. It was hot, hilly and again, crowded. I enjoy riding with people around me, but I do not enjoy having to ride two and three abreast to keep from drafting. At times it held me up, at times I had to push hard to get out of a pack and get my piece of the shoulder back. It was a great ride, cool at first, and then hot. I got behind on my fluids (I'm beginning to see this as a thyroid issue-I'm just not thirsty) but didn't realize it until later. I climbed the hills, I pushed hard, I gave that bike my all and finished in 3:31:31, 10 minutes slower than I had raced it before. I was a little disappointed in this but knew at least I would have legs to run on. My heart really believed I could race it much faster, so I took that disappointment out on the run.\n\nIn transition I'm by myself on my rack and on the next row is a girl who is very excited to get off her bike and go run. She's beaming with excitement and telling her support crew how much fun she's having. I don't mean to, but I laugh out loud and ask her if it's her first race. She says no, but says it's the first one she has enjoyed. I smiled big and wished her the best run. Meanwhile I was telling myself how much the rest of this day was going to suck and how this was going to be my last year of racing triathlons. I grab my stuff, hit the porta john, and run out, up the first of many hills.\n\nThe Run: I remember this run from the last time, except now the road was paved. It's three loops, with hills in the first two miles over every loop, and inclines the other two miles. A total elevation gain of 486 feet! I had a plan going in, I had been running the hills in my neighborhood, I knew I could get up them. It was so hot at this point, no clouds, and did I mention hilly? Paramedics were on every corner, ice was at every aide station. I walked up the hills, ran down the hills and the jogged the flats. I was starting to feel the effects of heat exhaustion. I was nauseous, I couldn't get any fluids in or food. I saw Ashley about 3 miles into the first loop and I told her I was going to drop out of the race. I didn't feel well, I was overheating and I needed to find shade. She encouraged me to keep going to get to the second loop and reevaluate. Because I couldn't get fluids in, I poured them on me, I put ice on every major artery. I did everything I could to keep myself in the right mindset. Loop two came and I walked up those hills again. Saw Ashley again told her I was dying but I kept moving. (In front of me a man passed out about 5 minutes later!). I make it through loop 2, see Amy at the finish and tell her I'm dying. She tells me to keep moving. I have the best friends :) On loop 3 the clouds come and it looks like rain. I pray for rain. I pray for the clouds to stay. I'm feeling better because I've been successful in getting my body temp down and some fluids in. I know I'm going to finish if I have to walk the last 4 miles.\n\n\n\nAs in all races, I wind up with friends along the course. A man was running behind me, then with me for this last loop and we began to talk. I told him I was walking all inclines, but running downhills and flats. He asked if I minded company. Nope, but I'm not altering my plan. So we ran the last 3 miles together, and I'm so grateful. It really took my mind off what was happening. At the last 1/2 mile he left me, clearly he had more in the tank! I ran in to the finisher shoot and Ashley was waiting with a huge smile for me! That run would be a 2:57:28, my second slowest run in a 70.3. 12 minutes slower than the last time I did it.\n\n[gallery ids=\"753,754,755\" type=\"rectangular\"]\n\nIt's easy to compare races, and no two are ever the same, not even on the same course. But the Type A perfectionist in me does it anyway. I tried hard to see the small victories, the great swim time considering my lack of training, the great transition times (I've been working on those!), and the fact that I finished this race. All in 7:34:55, 13 minutes slower than my DNF. I also look at it as a huge success considering my mind was totally on getting back in my car and driving the 12 hours back to MS to be with my mom. I pick it apart all the time, and I truly am now finished trying to prove anything to myself with this course. I did prove that I could race without much training- which I DO NOT recommend, and that if I recover properly I can pick up my training right away.\n\n[gallery ids=\"751,749,756\" type=\"rectangular\"]\n\nFollowing IMFL 70.3 I came home to be with my mom. Share all the swag, show her all the photos and talk about the race. I get one chance each time to tell her about it before it's old news. I could talk about Triathlon every day, if someone wanted to listen ;)\n\n<img class=\"alignnone size-full wp-image-758\" src=\"https://torijmoffitt.files.wordpress.com/2018/06/30261778_10156300597228953_4122439112554708992_o.jpg\" alt=\"30261778_10156300597228953_4122439112554708992_o\" width=\"1080\" height=\"1350\" />\n\nSo you take the lessons, you apply them, you talk to your coach about them. You reevaluate your year, your plan, your goals. You make new plans, new goals. You move forward. Until it's not fun anymore, and then you move on. I have two big races left on the calendar this year and I'm going to focus on having fun. If I make it to IMAZ and across the finish line then the process will start all over.\n\nThis could be my last year of Triathlons, but I also like the thought of doing Honu and Iceland, Roth and Santa Rosa. Maybe I'll finish my career with Boulder. But first, I have to go find the fun in racing again.","tags":[],"publishedDate":"2018-06-02T21:38:03Z","harvestDate":"2018-06-02T21:38:08Z","estimatedPublishedDate":"2018-06-02T21:38:03Z","url":"http://ct.moreover.com/?a=34207165995&p=1u0&v=1&x=KFOuw5X46VHawA3YohJ1FQ","originalUrl":"https://torijmoffitt.wordpress.com/2018/06/02/imfl-70-3-the-comeback/","outboundUrls":[],"wordCount":"1844","dataFormat":"text","duplicateGroupId":"34207165995","media":{"audio":[],"images":[{"url":"https://torijmoffitt.files.wordpress.com/2018/06/30516751_10214624872528410_1491142203412578304_n.jpg"},{"url":"https://torijmoffitt.files.wordpress.com/2018/06/30261778_10156300597228953_4122439112554708992_o.jpg"}],"video":[],"logo":[]},"publishingPlatform":{"itemId":"747"},"adultLanguage":"false","topics":[],"companies":[{"name":"IDS","symbol":"MLIDS","exchange":"PAR","isin":"FR0000079691","titleCount":0,"contentCount":3,"primary":true},{"name":"Finish Line Inc","symbol":"TF3A","exchange":"STU","isin":"US3179231002","titleCount":0,"contentCount":1,"primary":false},{"name":"Finish Line Inc","symbol":"TF3A","exchange":"FRA","isin":"US3179231002","titleCount":0,"contentCount":1,"primary":false},{"name":"Finish Line Inc","symbol":"FINL","exchange":"NAS","isin":"US3179231002","titleCount":0,"contentCount":1,"primary":false},{"name":"Finish Line Inc","symbol":"TF3A","exchange":"BER","isin":"US3179231002","titleCount":0,"contentCount":1,"primary":false}],"author":{"name":"bluewxeyes","publishingPlatform":{"userId":"72784207"}},"licenses":[],"source":{"name":"Living out Loud","homeUrl":"https://torijmoffitt.wordpress.com","location":{},"feed":{"id":"553192072","name":"Living out Loud","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"76209777","generator":"http://wordpress.com/","description":"Cats. Navy. Running. Crossfit. Triathlons. Life","tags":[],"language":"Unassigned","dataFormat":"text","rank":{"autoRank":"9","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86992179}