{"sequenceId":"845361982014","id":"34207103965","language":"English","title":"KS:  Pastor Tallied $67K In Gambling Losses","content":"KANSAS CITY, Mo. (CNN) -- Court documents released Friday (June 1) in a case involving a Johnson County pastor charged with stealing money from a Catholic church detailed thousands in fraudulent billing.  Earlier this month, Johnson County prosecutors charged Joseph Cramer with one count of theft and two counts of computer crimes in connection to an investigation of the financial records of the Divine Mercy Parish in Gardner, Kan.  Court documents in the case indicate that Cramer’s scheme was initially detected when a church worker noticed inconsistencies in the parish’s finances.  After the Archdiocese alerted authorities, investigators discovered that Cramer would manipulate the financial records at the church to cover up checks he made out to himself on behalf of the church.  In one instance, a $510 check made out to Cramer was listed in the church’s finance records as a payment for a “new desk.” When investigators checked with the supposed vendor of the new desk, they found no record of the purchase.  Investigators tracked the stolen church money to three local casinos. Accounts at the casinos indicate Cramer lost more than $67,000 between November 2015 and May 2016.  Cramer was booked into jail on the charges on May 8 and posted bond shortly thereafter. He’s scheduled to appear back in court on June 20.","contentWithMarkup":"KANSAS CITY, Mo. (CNN) -- Court documents released Friday (June 1) in a case involving a Johnson County pastor charged with stealing money from a Catholic church detailed thousands in fraudulent billing.\n\nEarlier this month, Johnson County prosecutors charged Joseph Cramer with one count of theft and two counts of computer crimes in connection to an investigation of the financial records of the Divine Mercy Parish in Gardner, Kan.\n\nCourt documents in the case indicate that Cramer’s scheme was initially detected when a church worker noticed inconsistencies in the parish’s finances.\n\nAfter the Archdiocese alerted authorities, investigators discovered that Cramer would manipulate the financial records at the church to cover up checks he made out to himself on behalf of the church.\n\nIn one instance, a $510 check made out to Cramer was listed in the church’s finance records as a payment for a “new desk.” When investigators checked with the supposed vendor of the new desk, they found no record of the purchase.\n\nInvestigators tracked the stolen church money to three local casinos. Accounts at the casinos indicate Cramer lost more than $67,000 between November 2015 and May 2016.\n\nCramer was booked into jail on the charges on May 8 and posted bond shortly thereafter. He’s scheduled to appear back in court on June 20.","tags":["News"],"publishedDate":"2018-06-02T21:22:29Z","harvestDate":"2018-06-02T21:22:32Z","estimatedPublishedDate":"2018-06-02T21:22:29Z","url":"http://ct.moreover.com/?a=34207103965&p=1u0&v=1&x=w0eKzqkwyIvWIZdBodZxWg","originalUrl":"http://5newsonline.com/2018/06/02/ks-pastor-tallied-67k-in-gambling-losses/","outboundUrls":[],"wordCount":"208","dataFormat":"text","duplicateGroupId":"34201710003","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{"itemId":"357226"},"adultLanguage":"false","topics":[],"companies":[{"name":"Finance Co PLC","symbol":"TFC.X0000","exchange":"COL","isin":"LK0230X00008","titleCount":0,"contentCount":1,"primary":true},{"name":"Finance Co PLC","symbol":"TFC.N0000","exchange":"COL","isin":"LK0230N00009","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"Ninette Sosa","publishingPlatform":{"userId":"110110078"}},"licenses":[],"source":{"name":"Fort Smith/Fayetteville News | 5newsonline KFSM 5NEWS","homeUrl":"http://5newsonline.com","location":{"country":"United States","countryCode":"US","region":"Americas","subregion":"Northern America"},"feed":{"id":"243635329","name":"Fort Smith/Fayetteville News | 5newsonline KFSM 5NEWS","mediaType":"Blog","publishingPlatform":"WordPress","idFromPublisher":"29519551","generator":"http://wordpress.com/","description":"Get the local news and weather where you live from 5NEWS. Covering Fort Smith, Fayetteville, Bentonville, and all of Northwest Arkansas and the River Valley.","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"2","autoRankOrder":"2192","inboundLinkCount":"822"},"inWhiteList":"true","autoTopics":[]}},"es_id":86990052}