{"sequenceId":"845366522522","id":"34207244416","language":"English","title":"Virtual Reality vs. Augmented Reality – What’s the Difference?","content":"Share\rTweet\rShare\rShare\rEmail\rComments\rDue to impressive developments in several technologies, there has been a spike in applications of both augmented reality and virtual reality. They can be confusing concepts, though, or at least, it’s possible to confuse them with each other. We’re going to lay out the key differences between the two, because you can expect to see a lot more of both in the near future! Augmented Reality Let’s started with AR, or Augmented Reality. Augmented, i.e. when something is enhanced or improved. In general, AR apps are used on smartphones and tablets, specifically utilising the camera of the device. By tapping into the device’s camera, the app will show you the real world in front of you, but then layer additional information onto that image – hence the use of the term ‘augmented’, since it has added to those real world objects and (hopefully) improved your experience in some way. A good example of AR is the Pokemon GO mobile game that was all the rage a while back. The app used the camera to provide an image of the real world, and then added sprites and character images on top in order to create the in-game environment. Another example is the Layar app, which adds additional useful information to real-world sites and places. This is especially helpful for tourists or people traveling to areas they’re unfamiliar with, since AR apps could provide information about a tourist site, or translate a public sign for people who don’t speak the local language. Virtual reality Virtual reality is an altogether different technology, where ‘virtual’ implies that something is artificial or simulated in some way. The crux here is that the real world, or your surroundings, don’t actually contribute meaningfully to what you see. This is usually achieved by having a device of some sort that a user will have to wear in order to view the simulated environment. Good examples are the Facebook-owned Oculus Rift, Google Cardboard for smartphones, or the Playstation VR headset that’s becoming increasingly popular for gaming use. These devices allow the user to look in every direction and see a complete simulated environment, in the case of something like Playstation’s VR headset, it will be the game environment of a shooting or platforming game for instance. For other applications, it could be a simulated landscape of Antarctica or the Kruger National Park, designed to give people a near-real view of those environments. A slight quirk with VR, though, is that because it simulates things that aren’t actually happening it can influence one’s senses in odd ways. Some people might experience vertigo or some dizziness if the VR environment has a lot of movement or activity on it, which kind of confuses your brain, because you might be sitting still but it seems like you’re gliding through space. Both of them have very different uses, and as companies improve how they operate and make them more affordable we’re probably only going to see a spate of new applications for both augmented reality as well as virtual reality. If you’re interested in giving VR a closer-look, weFix has a number of virtual reality products, including the VR Box headset to use with your smartphone, along with DJI’s VR goggles to use with your drone. Related Items:AR, Augmented Reality, Featured, gadgets, Playstation VR, tech, Virtual Reality, VR\rShare\rTweet\rShare\rShare\rEmail\rRecommended for you\rBlackberry Motion Arrives in SA, Price Revealed\rCan These Smartphone Lenses Replace DSLRs?\rThink SMS is dead? Think again!\rClick to comment","contentWithMarkup":"Time to know your VR from your AR!","tags":["Gadgets","Partner content","Tech and Gadgets","AR","Augmented Reality","Featured","gadgets","Playstation VR","tech","Virtual Reality","VR"],"publishedDate":"2018-06-02T21:56:54Z","harvestDate":"2018-06-02T21:57:08Z","estimatedPublishedDate":"2018-06-02T21:56:54Z","url":"http://ct.moreover.com/?a=34207244416&p=1u0&v=1&x=dSVCNa1rkR-LhgNPGfY6PA","originalUrl":"http://www.menstuff.co.za/gadgets/virtual-reality-vs-augmented-reality-whats-the-difference/","commentsUrl":"http://www.menstuff.co.za/gadgets/virtual-reality-vs-augmented-reality-whats-the-difference/#respond","outboundUrls":["https://www.layar.com/","http://bit.ly/2IKvyFv","http://bit.ly/2x8jMmU"],"wordCount":"590","dataFormat":"text","duplicateGroupId":"34207244416","media":{"audio":[],"images":[],"video":[],"logo":[]},"publishingPlatform":{},"adultLanguage":"false","topics":[{"name":"Augmented reality news","group":"Technology"}],"companies":[{"name":"AP Co Co Ltd","symbol":"3175","exchange":"TKS","isin":"JP3160620005","titleCount":0,"contentCount":1,"primary":true},{"name":"With Inc","symbol":"WWTH","exchange":"PINX","isin":"US9773991040","titleCount":0,"contentCount":1,"primary":true}],"author":{"name":"Elan Solomon","publishingPlatform":{}},"licenses":[],"source":{"name":"MenStuff","homeUrl":"http://www.menstuff.co.za","location":{"country":"South Africa","countryCode":"ZA","region":"Africa","subregion":"Southern Africa"},"feed":{"id":"473685502","name":"MenStuff","mediaType":"Blog","publishingPlatform":"WordPress","generator":"https://wordpress.org/?v=4.8.6","description":"Men's lifestyle features, reviews and news","tags":[],"language":"English","dataFormat":"text","rank":{"autoRank":"9","autoRankOrder":"194399","inboundLinkCount":"0"},"inWhiteList":"true","autoTopics":[]}},"es_id":86994441}